#include <a_samp>
#undef MAX_PLAYERS
#define MAX_PLAYERS 500
/////////////////////////////////////
#include <crashdetect>
/////////////////////////////////////
#define STREAMER_OBJECT_SD 400.0
////#define STREAMER_OBJECT_DD 400.0
#include <streamer>
/////////////////////////////////////
#include <sscanf2_simplified>
//#include <sscanf2>
/////////////////////////////////////
//#include <pawn.cmd>
//#include <zcmd_simplified>
/////////////////////////////////////
//#define FOREACH_NO_BOTS
//#include <foreach_simp>
//#include <foreach_simplified>
#include <foreach_fast>
/////////////////////////////////////
//#include <FCNPC>
/////////////////////////////////////
#include <samp-precise-timers>
/////////////////////////////////////
#pragma warning disable 239

new Create_Iter<Player><500>;

new Create_Iter<PlyrInVeh><500>;

main()
{
    SSCANF_Init(1, 2, 3);

	print("\n\tCEKTOP 2 start\n\n");

//	new Players[500],elem;
	/*
	Iter_AAdd(Vehicles[0],1);
	Iter_AAdd(Vehicles[0],5);
	Iter_AAdd(Vehicles[0],9);
	Iter_AAdd(Vehicles[0],3);
	Iter_AAdd(Vehicles[0],100);
	Iter_AAdd(Vehicles[0],14);
	Iter_AAdd(Vehicles[0],16);
	Iter_AAdd(Vehicles[0],21);
///	Iter_Add(Players,3);
	Iter_AAdd(Vehicles[0],2);
//	Iter_Add(Players,77);
	
	Iter_ARemove(Vehicles[0],2);
//	Iter_Remove(Players,77);
//	Iter_ARemove(Vehicles[0],1);
//	Players[elem]
	
	
//	foreach(Players,i)
    //for(new i=Players[Players_last-1],eleme=Players_last-1;eleme!=0;--eleme,i=Players[eleme])
    foreachA(Vehicles[0], i)
	{
	    printf("%d",i);
	}*/
}
new vorota=0,vorota_open=0;
#define MAX_CARS 200
enum vehiclce
{
	inventory[10],
	bool: backpack,
	bool: doors,
	bool: pas_door,
	bool: Engine,
	akum ,
	benz ,

	driveid
};
new vInfo[MAX_CARS][vehiclce];

enum sektor_pInfo {

	Name[MAX_PLAYER_NAME],
	Password[25],
	
	pack,
	slot,
	end_slot,
	
	sytok,
	minyts,
	
	bool:pol,
	
	skin,
	afktime,
	
	lvl,
	Exp,
	
	pMutDo,
	
	moneyid,
	pred_cena,
	
	
	money,
	
	kpkmoney,
	kpk_snd,
	
    chasov,
	deads,
	
	jobid,/////////////////////////////работа в бункере
	
	
	rang,
	
	
	bool:bike,
	
	gangid,
	gangname[10],
	gangTityl,
	
	immynitet,
	golod,
	voda,
	temperatura,
	son,
	nyjda,
	nastroenie,
	
	Virus,
	Temp,

	preVirus,
	preTemp,

	bool:prostil,
	bool:otrava,

    obnal,//разрешить вас обнимать 1 - да, 0 нет
	pojal,
	intim,
	
	zmedik,//задания

	zmaster,//задание у мастера
	zprodov,//задания продовольствия у иваныча
	zholodn,//задание холодного оружия у иваныча

	cigarts,
	spitchki,

	bool:Isvip,
	bool:vip_chat,
	
	bool:openInv,

	bool:krov,

	bool:Resp,
	bool:racia,
	bool:torg,
	
	Clothes,
	Ready_clothe,
	
	bool:login,
	bool:spawned,
	warns,

	bool:in_water,
	bool:vivih,
	Float:pos_x,Float:pos_y,Float:pos_z,

	body_object,hand_object,	//==обьекты трупа при смерти игрока
	
	car_id,
	car_back,
	
	remont,
	boxe,
	karate,
	kckbox,
	exp_tt,
	exp_dd,
	exp_drob,
	exp_obrz,
	exp_ak,
	exp_mk,
	exp_uzi,
	
	player_c,
	
	effect,
	bool:indikat,
	bool:dmap,

	bool:komnata,
	bool:door_komn,
	
	skin_type
	
};
new PlayerText:PTD[MAX_PLAYERS][25];
#define PLAYER_DRAWS PTD
enum ptle{PlayerText:loot_model,PlayerText:loot_textX,loottype};
#define MAX_INVENTORY_LOOT 56// восемь лутов слева направо, и 7 лутов сверху в низ . 7*8=56
new PTL[MAX_PLAYERS][MAX_INVENTORY_LOOT][ptle];
#define PLAYER_LOOT_DRAW PTL
new AdminId[4], pInfo[MAX_PLAYERS][sektor_pInfo],mysor[10];
#define IsPlayerHaveResp(%0) pInfo[%0][Resp]
#define GetLVL(%0) pInfo[%0][lvl]
#define GetPlayerExperianc(%0) pInfo[%0][Exp]
#define GetPlayerMutDo(%0) pInfo[%0][pMutDo]
#define GetSkin(%0) pInfo[%0][skin]


#define MAX_TYPE_LOOT 143
new PLKOL[MAX_PLAYERS][MAX_TYPE_LOOT][2];
#define LOOT_KOLVO PLKOL
#define kolichectvo 0
#define link_to_PTL 1
new pprul[MAX_PLAYERS];
#define PLAYER_PRE_USE_ pprul
enum DLI{//---------------|
	luttype,
	dynO,
	Text3D:dynT
};
#define MAX_LOOT 1000
new DropLoot[MAX_LOOT][DLI],
endloot=0;

enum LI{
	NAMEloot[26],
	TEXTloot[132],//max len:132
	model,
	deneg_p,
	deneg_npc
};


new InfoLoot[MAX_TYPE_LOOT][LI]={
{"Пусто","",0,0,0},
{"Личные нужды","Стандартный набор личных вещей. Есть у всех выживших в рюкзаке.",19873,0,0},
{"Журнал заданий","Ваша личная записная книжка, в которой содержатся записи о заданиях. Есть у всех выживших в рюкзаке.",2894,0,0},
{"Котелок","Позволяет готовить пищу на костре. Есть у всех выживших в рюкзаке.",11718,0,0},
{"Радиопередатчик","Хитрый радиопередатчик, который могут использовать только радиоведущие.",19610,0,0},
{"Ноутбук","Дешёвый, старый ноутбук. Необходим наёмникам и выдается только им.",19893,0,0},
{"Фотография","Фотокарточка от Механика, с изображением транспорта, который вам нужно для него найти.",485,0,0},
{"Фотография","Фотокарточка от Механика, с изображением транспорта, который вам нужно для него найти.",603,0,0},
{"Фотография","Фотокарточка от Механика, с изображением транспорта, который вам нужно для него найти.",531,0,0},
{"Яблоко","Обычное яблоко, немного подпорченное, но фруктовые витамины большая редкость в наше время.",19576,10,6},
{"Томат","Редкий и полезный продукт, т.к. свежих овощей сейчас не найти. Выращивается игроками.",19575,12,6},
{"Хлеб","Черствый хлеб. Но выбрасывать жалко, как говорится: в каждой буханке - пот хлебороба!",19576,5,3},
{"Сухой паек","Консервы и галеты, отличный набор еды для дальних походов.",2663,15,9},
{"Бургер","Чёрствый хлеб и не первой свежести котлета.",2768,10,0},
{"Шаурма","Немного старого жареного мяса в лаваше.",2769,10,0},
{"Тушенка","Старая тушенка, в облезлой банке, пригодная для еды.",1666,12,7},
{"Разогретая тушенка","Разогретая на огне тушенка. Настоящий деликатес для выжившего бродяги!",1666,12,7},
{"Банка горошка","Банка консервированного горошка. Надпись почти стерлась, но можно прочитать: \"Вы ничего вкусней не ели овощей от Бондюэля\".",1902,8,5},
{"Банка грибов","Консервированные грибы в железной банке. Вроде внутри шампиньоны.",1901,8,5},
{"Мешок овощей","Мешок со старыми овощами. Картошка, лук, свекла, морковь... Пахнет гнилью, часть овощей уже испортилась, но еще есть и нормальные.",2060,5,0},
{"Сырое мясо","Сырое мясо неизвестного происхождения. Может быть это свинина, а может быть твой друг Валерка, который пропал неделю назад.",2804,0,2},
{"Жареное мясо","Мясо неизвестного животного. Или человека... Но выглядит вполне аппетитно.",19582,5,0},
{"Гнилое мясо","Гнилое мясо, неизвестного происхождения. Тошнотворно воняет тухлятиной.",19882,5,0},
{"Сырая рыба","Сырая рыба, хорошо бы ее пожарить на костре.",19630,5,3},
{"Жареная рыба","Горячая рыбка, видимо недавно обжаренная на костре.",19630,15,9},
{"Крупа","Старая крупа. Можно перебрать и сварить кашу.",19562,10,6},
{"Каша","Вареная каша, выглядит вполне съедобно.",11739,15,0},
{"Семена","Старенький мешочек с семенами.",2060,10,10},
{"Газировка","Сладкая газировка, в мятой банке.",1546,10,6},
{"Сок","Детский фруктовый сок в коробке.",19564,10,6},
{"Молоко","Концентрат из сухого молока. Полезно, если не испортилось.",19570,15,0},
{"Вскипяченное молоко","Кипяченое молоко. Невкусно, но полезно.",19570,15,0},
{"Энергетик","Банка с энергетическим напитком. Кофеин бодрит и окрыляет, как говорилось в рекламе.",1455,12,7},
{"Бутылка с грязной водой","Бутылка с мутной, грязной водой.",1951,2,0},
{"Бутылка с кипяченой водой","Бутылка кипяченой воды. Можно выпить или приготовить на этом пищу.",1951,6,0},
{"Пиво","Бутылка пива, не самого лучшего качества. Викинги верили, что пенный напиток придает силы.",1543,10,6},
{"Виски","Дешевый виски. Стоит сделать пару глотков, когда в депрессии.",1512,5,3},
{"Водка","Обычная русская водка. Содержание спирта в ней так велико, что помогает бороться с вирусами!",19821,5,3},
{"Пустая бутылка","Обычная бутылка. Можно зачерпнуть в нее воды из реки.",1950,3,0},
{"Сигареты","Дешевые сигареты. Курение убивает, как говорил Минздрав, но что не убивает в наше время?",19897,10,6},
{"Бронежилет","Лучшая жилетка - бронежилетка! Эта штука может не раз спасти вашу жизнь.",1242,50,30},
{"Карта","Обычная карта, полезная в любом походе.",19167,10,10},
{"Навигатор","Простенький навигатор, который может показать где находится то или иное место.",18875,10,6},
{"Рация","Обычная портативная рация.",330,10,6},
{"Респиратор","Респиратор частично очищает вдыхаемый кислород, без него на поверхность лучше не выходить.",19472,25,15},
{"Дрова","Простое полено. Необходимое топливо для костра.",19793,5,3},
{"Спички","Спички детям не игрушки! А вот мародёрам жизненно необходимая вещь.",11748,5,3},
{"Удочка","Простая удочка, если найти наживку, то можно попробовать поймать рыбу из реки.",18632,15,9},
{"Палатка","Старая, но надежная брезентовая палатка. Защитит от дождя и ветра.",1279,25,0},
{"Рюкзак 10","Не один мародёр не пойдет на поверхность без рюкзака. Такой встречается только у самых нищих новичков.",371,-1,-1},
{"Рюкзак 20","Недорогой, но вместительный рюкзак, встречается у большинства начинающих мародеров.",371,-1,-1},
{"Рюкзак 30","Довольно большой рюкзак, встречается у продвинутых мародеров.",371,-1,-1},
{"Рюкзак 40","Дорогой рюкзак, такой носят только крутые мародеры.",371,-1,-1},
{"Рюкзак 50","Самый большой рюкзак, такой носят только самые матёрые мародеры. Или мажоры.",371,-1,-1},
{"Термоящик","Этот ящик можно установить на поверхности и сделать тайник. Вещи в нем защищены от непогоды и вирусов.",2977,250,150},
{"Инструменты","Ключи, головки, отвертки и прочие инструменты. Автолюбителю без него никуда!",19624,50,0},
{"Пустая канистра","Простая пластиковая канистра, можно наполнить бензином на заброшенной автозаправке.",1650,20,40},
{"Канистра с бензином","Канистра с топливом, очень нужная вещь! Можно заправлять механизмы, транспорт или использовать при крафте.",1650,40,40},
{"Запчасти","Всякий железный хлам, может пригодиться для ремонта машины.",1575,5,3},
{"Ремкомплект для шин","Суперклей и набор жгутов с заплатками. Можно заклеить пробитое колесо.",1580,5,3},
{"Запчасти для мото/вело","Мотоциклы на поверхности встречаются не часто, поэтому запчасти для них всегда в цене!",1579,25,15},
{"Аккумулятор","Дешевый аккумулятор, полезная вещь, для любителей передвигаться на колесах!",19615,50,25},
{"Био-батарейка","Редкая и сложная батарейка, работающая на био топливе. Такую можно вставить в защитный костюм.",2976,150,100},
{"Стройматериалы","Различный строительный хлам, который еще может пригодиться.",1500,5,3},//изменить
{"Бинт","Медицинский бинт, им можно перетянуть раны. В походе без него не обойтись! Так же, нужен для некоторых крафтов.",11736,5,3},
{"Аптечка","Стандартный набор лекарств, для оказания первой помощи. Но главное в нем - антибиотики, для борьбы с вирусом!",11738,25,15},
{"Снадобье","Отвар каких-то трав, на спирту. Делается местными медиками. Лечит от всех простых болезней: от простуды - до поноса!",19823,20,12},
{"Растирка","Хорошая, согревающая растирка! Такую делают местные медики. Разотритесь, когда холодно, это поможет избежать переохлаждения!",1644,15,9},
{"Мазь от зомби","Это вонючее зелье сможет спасти вас от зомбаков. Просто разотритесь им и они вас не учуят некоторое время!",2709,0,0},//изменить
{"Целебная трава","Пучок каких-то трав, медики считают их целебными и используют для крафта.",19473,3,2},
{"Гитара","Музыка помогает жить, с гитарой в походах легче и ночи у костра короче.",19317,25,15},
{"Золото","Многие влиятельные люди бункера ценят этот дорогой металл больше, чем деньги!",19941,100,50},
{"Новогодняя шапка","Редкая вещица, встречается только во время празднования Нового года.",19064,15,0},//изменить цену
{"Фейерверк","Праздничный салют!",1654,0,0},//изменить цену
{"Фейерверк ракета","Ракетница с салютом. Вроде еще не отсырела.",1654,25,0},//изменить цену
{"Посылка","Обычная почтовая посылка. Что внутри неизвестно, можно открыть и посмотреть.",19572,20,12},
{"Подарок","Таинственный подарок в красивой, праздничной упаковке. Такой можно найти только на праздники.",19057,150,90},
{"Подарок Санты","Санта попросил вас помочь ему с доставкой подарков. Интересно, что внутри?",19056,0,0},
{"Бутылка с картой","Старая бутылка, выловленная из воды. Внутри какая-то карта.",1520,50,0},
{"Тыква","Обычная тыква.Если близится Хэллоуин, то возможно ей заинтересуются в бункере!",19320,30,0},
{"Ёлочная игрушка","Старая ёлочная игрушка. Хорошо сохранилась, не разбитая.",2485,30,0},//изменить модель
{"Деревянная игрушка","Самодельная игрушечная машинка, грубо сделанная из куска дерева.",2485,10,0},
{"Валентинка","Старая открытка в виде сердечка. Можно подписать и подарить кому-нибудь.",1240,0,0},//изменить цену
{"Части оружия","Старое, непригодное оружие. Возможно, его можно починить или использовать для крафта.",2034,15,9},
{"Бита","Бейсбольная бита. В России никогда не использовалась по назначению.",336,40,20},
{"Катана","Старенькая катана. Обычный настенный сувенир, плохого качества.",339,40,20},
{"Полицейская дубинка","Полицейская дубинка. Больно бьет, но не оставляет следов на теле!",334,40,20},
{"Лопата","Обычная штыковая лопата, может быть использована в качестве оружия или инструмента.",337,40,20},
{"Кий","Крепкий деревянный кий, можно использовать как оружие.",338,40,20},
{"Цветы","Весенние полевые цветы. Можно выгодно продать или использовать в качестве оружия.",325,65,50},
{"Огнетушитель","Обычный, пенный огнетушитель. Может справиться с огнем или быть использован в качестве оружия.",2690,50,30},
{"Пистолет ТТ","Простой пистолет ТТ, калибра 9мм. Встречается довольно часто у новичков.",346,50,0},
{"Патроны для ТТ","Дешевые боеприпасы для пистолета ТТ и различного крафта.",2061,3,0},
{"Пустынный орел","Элитный зарубежный пистолет, калибра 50. Очень убойная штука.",348,1000,0},
{"ПТ для Пустынный орел","Боеприпасы для пистолета Пустынный орел.",2061,0,0},
{"Зажигательный пистолет","Модификация пистолета ТТ, к такому подходят только самодельные зажигательные капсулы!",347,150,0},
{"Зажигательные капсулы","Капсулы с горючей смесью, для зажигательного пистолета.",1636,25,0},
{"Помповый дробовик","Простой помповый дробовик. Такой любят дедушки в деревнях.",349,150,0},
{"Патроны для п.дробовика","Патроны для помпового дробовика.",2061,10,0},
{"Самозарядный дробовик","Быстрый, надежный дробовик. Отличный урон, на маленьком расстоянии.",351,500,0},
{"Патроны для с.дробовика","Патроны для помпового дробовика.",2061,12,0},
{"Обрез","Самодельное ружье, с спиленным стволом. Такое изготавливают местные оружейники.",350,75,0},
{"Патроны для обреза","Патроны для обреза.",2061,5,0},
{"УЗИ","Скорострельный, но не точный пистолет-пулемет. Можно стрелять, находясь за рулем!",352,250,0},
{"Патроны для УЗИ","Патроны для УЗИ.",2061,15,0},
{"Автомат Калашникова","Старый, добрый АК-47. Гордость СССР.",355,500,0},
{"Патроны для АК","Патроны для Автомата Калашникова.",2061,25,0},
{"М4","Американская винтовка М4. Довольно редкая штучка, превосходит АК-47 по всем параметрам, в том числе и по цене.",356,2500,0},
{"Патроны для М4","Патроны для М4.",2061,0,0},
{"РПГ","Ручной противотанковый гранатомет. Убойная и дорогущая дура!",359,5000,0},//изменить ?
{"Ракета для РПГ","Ракета для гранатомета.",345,100,0},//изменить цену
{"Коктейль Молотова","Бутылка с зажигательной смесью - самодельное оружие местных мастеров.",344,20,12},
{"Граната","Осколочная граната. Хочешь вес6елья? Дёрни кольцо!",342,20,12},
{"Одежда летняя","Легкая, летняя одежда. Сейчас такую уже никто не носит.",-1,40,20},
{"Одежда полиции","Летняя полицейская форма. Выглядит круто, но согревает не очень.",-1,40,20},
{"Одежда новичка","Самая распространенная среди мародеров-новичков одежда. На большее они не заработали.",-1,40,20},
{"Одежда рабочего","Такую одежду выдавали всем работягам - шахтерам, дорожникам, грузчикам и прочим трудягам.",-1,40,20},
{"Одежда гопника","Олимпийка, спортивные штаны и дурацкая кепочка - типичный прикид гопоты. Семки есть?",-1,40,20},
{"Одежда репортера","Практичная, но заношенная одежда. Такую предпочитали операторы, репортеры и другие работники СМИ.",-1,40,20},
{"Одежда музыканта","Стразики, блёстки... эстрадная одежда 'звезд'.",-1,40,20},
{"Одежда гражданского","Джинсы и куртка, обычная одежда.",-1,40,20},
{"Одежда пожарного","Старая, потрепанная одежда пожарного, сделанная еще в советские годы.",-1,40,20},
{"Одежда здоровяка","Одежда для крупных людей. Кто-то любит покушать.",-1,100,60},
{"Одежда бандита 2","Такую одежду предпочитали бандиты 90-ых.",-1,100,60},
{"Одежда барыги","Одежда уличной шпаны.",-1,100,60},
{"Одежда гражданского 2","Стильная, гражданская одежда.",-1,100,60},
{"Одежда рэпера","Йоу, браза! Свободная одежда рэпера.",-1,100,60},
{"Одежда костюм","Вполне приличный костюм, для серьезных людей.",-1,100,60},
{"Одежда китайская","Такая одежда популярна на Востоке.",-1,100,60},
{"Одежда костюм 2","Вполне приличный костюм, для серьезных людей.",-1,100,60},
{"Одежда хиппи","Хиппи или хипстер... кто их разберет.",-1,100,60},
{"Одежда бандита 3","Такую одежду предпочитали бандиты 90-ых.",-1,100,60},
{"Одежда рэпера 2","Йоу, браза! Свободная одежда рэпера.",-1,100,60},
{"Одежда костюм 3","Вполне приличный костюм, для серьезных людей.",-1,100,60},
{"Одежда бандита","Качественные шмотки авторитетного бандита! Дорогая штука!",-1,-1,-1},
{"Одежда байкера","Качественные шмотки уличного гонщика! Дорогая штука!",-1,-1,-1},
{"Одежда спецназа","Качественная одежда спецподразделений. Дорогая штука!",-1,-1,-1},
{"Одежда военного","Качественная одежда военного. Дорогая штука!",-1,-1,-1},
{"Одежда гражданского 3","Качественная одежда гражданского. Дорогая штука!",-1,-1,-1},
{"Одежда гангстера","Качественная одежда гангстеров. Дорогая штука!",-1,-1,-1},
{"Одежда мафиози","Качественная одежда мафиози. Дорогая штука!",-1,-1,-1},
{"Одежда рокера","Качественная одежда рокера. Очень дорогая штука!",-1,-1,-1},
{"Одежда богача","Качественная и пафосная одежда богача. Дорогая штука!",-1,-1,-1}

};
#define GetLootName(%0) InfoLoot[%0][NAMEloot]
//{"Чай","Бутылка с крепким и теплым чаем.",1951,6,0},
////{"Медовуха","Самогон на основе мёда, который гонят горцы.",19820,20,12},//
//{"Копченое мясо","Ароматная копченая рулька, весьма хорошего качества.",19847,12,7},
//{"Жареная рыба (остывшая)","Уже остывшая жаренная рыбка.",19630,5,3},
//{"Копченая рыба","Ароматная рыба холодного копчения.",19630,20,12},
//{"Мандарин","От запаха этого фрукта сразу вспоминаются новогодние праздники.",19574,10,6},
//{"Набор сладостей","Детский новогодний набор: шоколадные конфеты, вафли и печенье. Кажется, внутри что-то звенит.",19565,15,9},

//{"Мёд","Сладкий и очень полезный мёд.",2751,15,9},
//{"Сметана","Свежая и вкусная сметана, почти такая же, как делала бабушка.",19569,15,9},
//{"Яйцо","Сырое яйцо, похоже на куриное. Можно пожарить на костре или рискнуть съесть сырым.",3003,5,3},
//{"Яичница с помидорами","Вкусная и полезная яичница с помидорами!",19580,-1,-1},
//{"Рагу с мясом","Тушеные овощи, с мясом и грибами. Пахнет очень вкусно!",19811,30,10},
//{"Оливье","Салат 'Оливье', приготовленный по классическому рецепту.",19811,60,20},
//{"Селёдка под шубой","Салат 'Селедка под шубой', в составе которого вареная рыба, а не соленая селёдка.",19811,54,18},
//{"Пасхальное яйцо","Раскрашенное пасхальное яйцо. Напоминает о светлых и мирных деньках.",19345,0,0},//изменить цену
//{"Кулич","Пасхальный кулич, говорят, обладает целебными свойствами.",11740,45,15},
//{"Шампанское","Игристое вино. Этикетка почти стерлась, но содержимое может храниться очень долго.",19824,10,6},
//{"Мороженое","Контейнер с вишневым мороженым. Благодаря упаковке и холодной погоде еще пригодно в пищу!",19568,15,9},
#define BOLEZN_PROSTIL 1
#define BOLEZN_OTPABA 2

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ганг зоны
#define BUNKER_GREEN_ZONE 1
#define BLACK_MAP 1

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// пикапы
#define PICK_HOME 1
#define PICK_HOME_EXIT 2
#define PICK_HOME_SEIF 3

#define PICK_MASTER 4
#define PICK_MASTER_EXIT 5


#define PICK_SPORTZAL 6

#define PICK_LIFT 7// вход в спортзал или стрельбище

#define PICK_CLOTHES 8 // пошив одежды подработка новичкам или магазин одежды

#define PICK_FABRICK_CLOTHES_EXIT 9

#define PICK_FABRICK_CLOTHES_A 10
#define PICK_FABRICK_CLOTHES_B 11
#define PICK_FABRICK_CLOTHES_C 12
#define PICK_FABRICK_CLOTHES_D 13

#define PICK_SHOP_EXIT 14

#define PICK_SPORTZAL_EXIT 15

#define PICK_STELBISHE_EXIT 16
#define PICK_SHRAM_EXIT 17

#define PICK_FC_POLICE 18
#define PICK_FC_AMMO 19

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// дефайн функции
#define isInvNotFull(%0) (pInfo[%0][pack]*10>pInfo[%0][slot])
stock GivesPlayerMoney(playerid,moneys)
{
//	if(moneys>0)
//	{
	    pInfo[playerid][money]+=moneys;
//	}
//	else
//	{
//		pInfo[playerid][money]-=moneys;
//	}
		GivePlayerMoney(playerid, moneys);
}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// динамические зоны
#define AREA_BUNKER 1
#define BUNKER_VOROTA 2
#define BUNKER_HOME 3
#define STOL_A 4
#define STOL_B 5
#define STOL_C 6
#define STOL_D 7
#define STOL_E 8
#define STOL_F 9
#define STOL_G 10
#define STOL_H 11
#define STOL_i 12

#define FABRIC_PRODUCTION 13
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// текстдравы
#define DRAW_BLACK_SCREEN Text:0
#define DRAW_BOX_KPK Text:1
#define DRAW_GLOBAL_TIME Text:2
#define DRAW_GTA_SAMP_logotype Text:3

#define INV_YELLOY_MENU Text:4
#define INV_BLACK_A Text:5
#define INV_BLACK_B Text:6
#define INV_BLACK_C Text:7
#define INV_BLACK_D Text:8
#define INV_BLACK_E Text:9
#define INV_BLACK_F Text:10
#define INV_BLACK_G Text:11
#define INV_POLY_BLACK_RIGHT_PANEL Text:12
#define INV_CROSS Text:13
#define INV_TORG Text:14
//#define INV_BLUE_CLOTH Text:15
//#define INV_SKULL Text:16
#define INV_RIGHT_PACK Text:15
#define INV_KPK_MODEL_LAPTOP Text:16

#define DRAW_RED_SCREEN Text:17

#define DRAW_HOLOD Text:18
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// актеры
#define ACTR_bynker_a 2

#define ACTR_hospital_a 3

#define 	ACTR_voen 4

#define ACTR_bynker_b 5
#define ACTR_bynker_c 6
#define ACTR_bynker_d 7

#define ACTR_hospital_b 8

#define ACTR_vrach_a 9
#define ACTR_vrach_b 10

#define ACTR_sportzal_a 21
#define ACTR_sportzal_b 22
#define ACTR_sportzal_c 27
stock playerSick(playerid,boleznid)
{
	if(boleznid==BOLEZN_PROSTIL)
	{
	    PlayerPlaySound(playerid,31202,0.0,0.0,0.0);
		SendClientMessage(playerid,0x008800FF,"Ой, что-то вам не хорошо, похоже у вас температура! Как же глупо сдохнуть от простуды!");
		SendClientMessage(playerid,0x008800FF,"Вам нужен отвар (снадобье), возьмите его у медиков!");
		PlayerTextDrawColor(playerid,PLAYER_DRAWS[playerid][12],0xFFFFFFAA);
		PlayerTextDrawShow(playerid,PLAYER_DRAWS[playerid][12]);
		pInfo[playerid][prostil]=true;
	}
	else
	{
	 	pInfo[playerid][otrava]=true;
	    PlayerTextDrawColor(playerid,PLAYER_DRAWS[playerid][12],0xFFFFFFAA);
	}
}

#define IsPlayerInZZ(%0) (pInfo[%0][pos_x]>=91.0&&360.0<=pInfo[%0][pos_x]&&pInfo[%0][pos_y]>=1781.0&&1948.0<=pInfo[%0][pos_y])

//new IteratorArray:PlayerPerhapsVehicle[MAX_PLAYERS]<MAX_CARS>;
//new IteratorArray:PlayerPerhapsLoot[MAX_PLAYERS]<25>;//25 максимальное количество лута в диалоге при поднятии
new Create_AIter<PlayerPerhapsVehicle><500><MAX_CARS>;

stock GetVehicleCoordBackPack(vehicleid, &Float:x, &Float:y, &Float:z)
{
    new Float:angle,Float:distance;
    GetVehicleModelInfo(GetVehicleModel(vehicleid), 1, x, distance, z);
    distance = distance/2 + 0.1;
    GetVehiclePos(vehicleid, x, y, z);
    GetVehicleZAngle(vehicleid, angle);
    x += (distance * floatsin(-angle+180, degrees));
    y += (distance * floatcos(-angle+180, degrees));

}
stock obosal_clothe(playerid)
{
	SetPlayerSkin
    252
}
stock use_loot(playerid,id)
{
	switch(id)
	{
	    case 1://туалетная бумага
	    {
	       // if(IsPlayerInDynamicArea(playterid,)==false)
	     //  91.0,1781.0,360.0,1948.0
	       
            if(IsPlayerInZZ(playerid))
	        {
	        	SendClientMessage(playerid,0xD20000AA,!"Тут нельзя.");
	        }
			else
			{
			    ShowPlayerDialog(playerid, 2227,2, !"{FF0000}Личные нужды", "{FF8000}Спать {FFFFFF}(пополняется 'Усталость')\n\
		{FF8000}Сходить в туалет {FFFFFF}(пополняется 'Нужда')\n\
		{FF8000}Посмотреть количество сигарет и спичек",!"Ок",!"Отмена");
		//{FF8000}Проверить износ респиратора
		//{FF8000}Проверить состояние одежды

		//{FF8000}Профессия {FFFFFF}(профессиональные навыки)
		//{FF8000}Термос, Ок, Отмена)
			}
	        	


	    }
	    case 2://журнал задания
	    {
	    /*
	        static str_journal[]=
	        "\
	        {FF6600}Записная книжка {80FF00}.\n\n\
{FF0000}Сюжетные задания (обучение):\n\n\
{FFFFFF}.\n\n\
{FF0000}Задания по доставке:\n\n\
{0080FF}Провизии:\t\t\t{FFFFFF}???????? 5 ??????? ??????.\n\
{0080FF}Иванычу:\t\t\t{FFFFFF}???????? ??????????? ???????.\n\
{0080FF}Мастеру:\t\t\t{FFFFFF}???????? 3 ??????????.\n\
{0080FF}Механику:\t\t\t{FFFFFF}????? ??????? ? ????????!\n\n\
{FF0000}?????????? ???????:\n\n\
{0080FF}Лагерь ученых:		 {FFFFFF}????? ??????? ? ???????!\n\
{0080FF}Барыга:			 {FFFFFF}????? ??????? ? ???????!
	        ";

	    	ShowPlayerDialog(playerid,0,11014, "{51FF0F}Журнал",str_journal,"Ок","");
*/
	    }
	    case 3://котелок
	    {
	        if(IsPlayerInZZ(playerid))
	        {
	        	SendClientMessage(playerid,0xD20000AA,!"Тут нельзя.");
	        }
			else
			{
				ShowPlayerDialog(playerid, 2327,5, "{FF0000}Котелок",
				"{FF8000}Блюдо\t{FF8000}Ингредиенты\n\
				Кипяченая вода\tБутылка грязной воды\n\
				Кипяченое молоко\tБутылка молока\n\
				Жареное мясо\tСырое мясо\n\
				Разогретая тушенка\tБанка тушенки\n\
				Жареная рыба\tСырая рыба\n\
				Каша\tКрупа, кипяченая вода или молоко", !"Ок", !"Отмена");
			}
/*
Чай	Бутылка кипяченой воды и целебная трава или просто остывший чай
Яблочный сок	Яблоки (2шт)

Жареный гриб	Сырой гриб
Цитрусовый сок	Мандарин
Солдатская каша	Крупа, кипяченая вода, тушенка
Яичница	Яйцо (продукт сразу употребляется)
Яичница с помидорами	Яйцо, томаты
Пасхальное яйцо	Яйцо, краситель
Торт	Мука, сметана, яйцо, краситель, кипяченая вода, ягоды, мёд
Суп	Сырое мясо, кипяченая вода, овощи (продукт сразу употребляется)
Уха	Рыба, кипяченая вода, овощи (продукт сразу употребляется)
Тыквенный суп	Тыква, сырое мясо, кипяченая вода (продукт сразу употребляется)
Овощное рагу	Овощи, кипяченая вода, сырое мясо, грибы
'Оливье'	Овощи, кипяченая вода, сырое мясо, яйцо, сметана, горошек
'Селедка под шубой'	Овощи, кипяченая вода, сырая рыба, яйцо, сметана
Снадобье из цветов	Весенние цветы, целебная трава, водка
Целебное снадобье	Целебная трава, водка
Растирка	Бинты, водка
Мазь от зомби	Бинты, гнилое мясо (2шт)
Отвар из рога	Рог оленя, водка
Глинтвейн	Вино, целебная трава, мёд
Духи	Цветы, водка*/


	    }
	    case 9://яблоко
	    {
			if(pInfo[playerid][golod]<90)
			{
			    pInfo[playerid][golod]+=10;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>1)
				{
				    pInfo[playerid][nyjda]-=2;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////
				if(pInfo[playerid][immynitet]>89)
				{
				    pInfo[playerid][immynitet]=100;
				}
				else
				{
				    pInfo[playerid][immynitet]+=10;
				}
				PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
				ApplyAnimation(playerid, "FOOD","EAT_Burger",4.100000, 0, 0,0,0,0);
    			SendClientMessage(playerid,0x008800AA,!"Вы съели старое яблоко. Его витамины укрепляют иммунитет!");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это есть.");
			}
	    }
	    case 10:{}//томат
		case 11://хлеб
		{
			if(pInfo[playerid][golod]<90)
			{
			    pInfo[playerid][golod]+=10;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>1)
				{
				    pInfo[playerid][nyjda]-=2;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////
				PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
				ApplyAnimation(playerid, "FOOD","EAT_Burger",4.100000, 0, 0,0,0,0);
				SendClientMessage(playerid,0x008800AA,!"Вы съели черствый хлеб.");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это есть.");
			}
		}
		case 12://сухой паек
		{
			if(pInfo[playerid][golod]<50)
			{
			    pInfo[playerid][golod]+=50;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>9)
				{
				    pInfo[playerid][nyjda]-=10;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////
				PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
				ApplyAnimation(playerid, "FOOD","EAT_Burger",4.100000, 0, 0,0,0,0);
				SendClientMessage(playerid,0x008800AA,!"Вы съели сухой паек.");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это есть.");
			}
		}
		case 13://бургер
		{
			if(pInfo[playerid][golod]<80)
			{
			    pInfo[playerid][golod]+=20;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>4)
				{
				    pInfo[playerid][nyjda]-=5;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////
				PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
				ApplyAnimation(playerid, "FOOD","EAT_Burger",4.100000, 0, 0,0,0,0);
				SendClientMessage(playerid,0x008800AA,!"Вы съели бургер.");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это есть.");
			}
		}
		case 14://шаурма
		{
			if(pInfo[playerid][golod]<80)
			{
			    pInfo[playerid][golod]+=20;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>4)
				{
				    pInfo[playerid][nyjda]-=5;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////
				PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
				ApplyAnimation(playerid, "FOOD","EAT_Burger",4.100000, 0, 0,0,0,0);
				SendClientMessage(playerid,0x008800AA,!"Вы съели шаурму.");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это есть.");
			}
		}
		case 15://тушенка
		{
			if(pInfo[playerid][golod]<70)
			{
			    pInfo[playerid][golod]+=30;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>9)
				{
				    pInfo[playerid][nyjda]-=10;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////

			    PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
				ApplyAnimation(playerid, "FOOD","EAT_Burger",4.100000, 0, 0,0,0,0);
				SendClientMessage(playerid,0x008800AA,!"Вы съели тушенку!");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это есть.");
			}
		}
		case 16://тушенка разогретая
		{
			if(pInfo[playerid][golod]<70)
			{
			    pInfo[playerid][golod]+=30;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>9)
				{
				    pInfo[playerid][nyjda]-=10;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////

			    PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
			    
				if(pInfo[playerid][temperatura]<91)
				{
					pInfo[playerid][temperatura]+=10;
				}
				else
				{
				    pInfo[playerid][temperatura]=100;
				}
				////////////////////////////////////////////
				PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
				ApplyAnimation(playerid, "FOOD","EAT_Burger",4.100000, 0, 0,0,0,0);
				SendClientMessage(playerid,0x008800AA,!"Вы съели разогретую тушенку!");
				SendClientMessage(playerid,0x008800AA,!"Вы чувствуете тепло от горячей еды!");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это есть.");
			}

		}
		case 17://банка горошка
		{
			if(pInfo[playerid][golod]<90)
			{
			    pInfo[playerid][golod]+=10;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>4)
				{
				    pInfo[playerid][nyjda]-=5;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////

			    PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
                ApplyAnimation(playerid, "FOOD","EAT_Burger",4.100000, 0, 0,0,0,0);
				SendClientMessage(playerid,0x008800AA,!"Вы съели консервированный горошек.");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это есть.");
			}
		}
		case 18://банка грибов
		{
			if(pInfo[playerid][golod]<90)
			{
			    pInfo[playerid][golod]+=10;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>4)
				{
				    pInfo[playerid][nyjda]-=5;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////

			    PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
                ApplyAnimation(playerid, "FOOD","EAT_Burger",4.100000, 0, 0,0,0,0);
				SendClientMessage(playerid,0x008800AA,!"Вы съели консервированные грибы.");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это есть.");
			}
		
		}
		case 19://мешок овощей
		{
			if(pInfo[playerid][golod]<80)
			{
			    pInfo[playerid][golod]+=20;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>19)
				{
				    pInfo[playerid][nyjda]-=20;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////

			    PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
                ApplyAnimation(playerid, "FOOD","EAT_Burger",4.100000, 0, 0,0,0,0);
				SendClientMessage(playerid,0x008800AA,!"Вы выбрали наиболее хорошие овощи и съели их, выбросив гнилые.");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это есть.");
			}
		}
		case 20://сырое мясо
		{
			if(pInfo[playerid][golod]<90)
			{
			    pInfo[playerid][golod]+=10;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>19)
				{
				    pInfo[playerid][nyjda]-=20;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////

			    PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
                ApplyAnimation(playerid, "FOOD","EAT_Burger",4.100000, 0, 0,0,0,0);
				SendClientMessage(playerid,0x008800AA,!"Вы съели сырое мясо.");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это есть.");
			}
		}
		case 21://жаренное мясо
		{
			if(pInfo[playerid][golod]<90)
			{
			    pInfo[playerid][golod]+=10;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>19)
				{
				    pInfo[playerid][nyjda]-=20;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////
				if(pInfo[playerid][temperatura]<91)
				{
					pInfo[playerid][temperatura]+=10;
				}
				else
				{
				    pInfo[playerid][temperatura]=100;
				}
				////////////////////////////////////////////
				PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
				ApplyAnimation(playerid, "FOOD","EAT_Burger",4.100000, 0, 0,0,0,0);
				SendClientMessage(playerid,0x008800AA,!"Вы съели жаренное мясо!");
				SendClientMessage(playerid,0x008800AA,!"Вы чувствуете тепло от горячей еды!");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это есть.");
			}
		}
		case 22://гнилое мясо
		{
			if(pInfo[playerid][golod]<80)
			{
			    pInfo[playerid][golod]+=20;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>9)
				{
				    pInfo[playerid][nyjda]-=10;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////
			    playerSick(playerid,BOLEZN_OTPABA);
			    PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
			    ApplyAnimation(playerid, "FOOD","EAT_Burger",4.100000, 0, 0,0,0,0);
			    SendClientMessage(playerid,0x008800AA,!"Вы съели мерзкое и вонючее гнилое мясо! Что с вами, как вы дошли до этого?");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это есть.");
			}
		}
		case 23://сырая рыба
		{
			if(pInfo[playerid][golod]<90)
			{
			    pInfo[playerid][golod]+=10;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>4)
				{
				    pInfo[playerid][nyjda]-=5;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				///////////////////////////////////////

				PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
				ApplyAnimation(playerid, "FOOD","EAT_Burger",4.100000, 0, 0,0,0,0);
				SendClientMessage(playerid,0x008800AA,!"Вы съели сырую рыбу!");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это есть.");
			}
		}
		case 24://жаренная рыба
		{
			if(pInfo[playerid][golod]<80)
			{
			    pInfo[playerid][golod]+=20;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>9)
				{
				    pInfo[playerid][nyjda]-=10;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				///////////////////////////////////////
				if(pInfo[playerid][temperatura]<91)
				{
					pInfo[playerid][temperatura]+=10;
				}
				else
				{
				    pInfo[playerid][temperatura]=100;
				}
				////////////////////////////////////////////
				PlayerPlaySound(playerid, 32200, 0.000000, 0.000000, 0.000000);
				ApplyAnimation(playerid, "FOOD","EAT_Burger",4.100000, 0, 0,0,0,0);
				SendClientMessage(playerid,0x008800AA,!"Вы съели жаренную рыбу!");
				SendClientMessage(playerid,0x008800AA,!"Вы чувствуете тепло от горячей еды!");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это есть.");
			}
		}
		case 25://крупа
		{
		    SendClientMessage(playerid,0x008800AA,!"Эту крупу можно сварить! Используйте котелок у костра.");
		}
		case 26://каша
		{
		}
		case 27://семена
		{
		    SendClientMessage(playerid,0x008800AA,!"Вы не можете посадить тут семена, слишком много вирусов! Вам нужна подземная ферма!");
		}
		case 28://газировка
		{
			if(pInfo[playerid][voda]<80)
			{
			    pInfo[playerid][voda]+=20;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>9)
				{
				    pInfo[playerid][nyjda]-=10;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////

			    ApplyAnimation(playerid,"BAR","dnk_stndM_loop",4.100000, 0, 0,0,0,0);
			    PlayerPlaySound(playerid,32201, 0.000000, 0.000000, 0.000000);
			    SendClientMessage(playerid,0x008800AA,!"Вы выпили газировку.");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это пить.");
			}
		}
		case 29://газировка
		{
			if(pInfo[playerid][voda]<80)
			{
			    pInfo[playerid][voda]+=20;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>9)
				{
				    pInfo[playerid][nyjda]-=10;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////

			    ApplyAnimation(playerid,"BAR","dnk_stndM_loop",4.100000, 0, 0,0,0,0);
			    PlayerPlaySound(playerid,32201, 0.000000, 0.000000, 0.000000);
			    SendClientMessage(playerid,0x008800AA,!"Вы выпили сок.");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это пить.");
			}
		}
		case 30://молоко
		{
			if(pInfo[playerid][voda]<80)
			{
			    pInfo[playerid][voda]+=20;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>9)
				{
				    pInfo[playerid][nyjda]-=10;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////
			    ApplyAnimation(playerid,"BAR","dnk_stndM_loop",4.100000, 0, 0,0,0,0);
			    PlayerPlaySound(playerid,32201, 0.000000, 0.000000, 0.000000);
			    SendClientMessage(playerid,0x008800AA,!"Вы выпили молоко");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это пить.");
			}
		}
		case 31:// вскипяченное молоко
		{
			if(pInfo[playerid][voda]<80)
			{
			    pInfo[playerid][voda]+=20;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>9)
				{
				    pInfo[playerid][nyjda]-=10;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////
				if(pInfo[playerid][temperatura]<91)
				{
					pInfo[playerid][temperatura]+=10;
				}
				else
				{
				    pInfo[playerid][temperatura]=100;
				}
			    ////////////////////////////////////////

			    ApplyAnimation(playerid,"BAR","dnk_stndM_loop",4.100000, 0, 0,0,0,0);
			    PlayerPlaySound(playerid,32201, 0.000000, 0.000000, 0.000000);
			    SendClientMessage(playerid,0x008800AA,!"Вы выпили теплое, вскипяченное молоко!");
			    SendClientMessage(playerid,0x008800AA,!"Вы чувствуете тепло, от горячего питья!");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это пить.");
			}
		}
		case 32://энергетик
		{
			if(pInfo[playerid][voda]<80)
			{
			    pInfo[playerid][voda]+=20;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>9)
				{
				    pInfo[playerid][nyjda]-=10;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////
				if(pInfo[playerid][son]<90)
				{
				    pInfo[playerid][son]+=10;
				}
				else
				{
				    pInfo[playerid][son]=99;
				}
				//////////////
				if(pInfo[playerid][son]>69)
				{
					   PlayerTextDrawColor(playerid,PLAYER_DRAWS[playerid][9],0xFFFFFFAA);
				}
				else if (pInfo[playerid][son]>29)
				{
				    PlayerTextDrawColor(playerid,PLAYER_DRAWS[playerid][9],0xFFFF00AA);
				}
				else if (pInfo[playerid][son]>=0)
				{
				    PlayerTextDrawColor(playerid,PLAYER_DRAWS[playerid][9],0xFF0000AA);
				}
				PlayerTextDrawShow(playerid,PLAYER_DRAWS[playerid][9]);
				////////////////////////////////////////
			    ApplyAnimation(playerid,"BAR","dnk_stndM_loop",4.100000, 0, 0,0,0,0);
			    PlayerPlaySound(playerid,32201, 0.000000, 0.000000, 0.000000);
			    SendClientMessage(playerid,0x008800AA,!"Вы выпили энергетик. Напиток бодрит.");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это пить.");
			}
		}
		case 33://грязная вода
		{
			if(pInfo[playerid][voda]<80)
			{
			    pInfo[playerid][voda]+=20;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>19)
				{
				    pInfo[playerid][nyjda]-=20;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////
			    ApplyAnimation(playerid,"BAR","dnk_stndM_loop",4.100000, 0, 0,0,0,0);
			    PlayerPlaySound(playerid,32201, 0.000000, 0.000000, 0.000000);
			    SendClientMessage(playerid,0x008800AA,!"Вы выпили грязную воду. Мерзкий привкус.");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это пить.");
			}
		}
		case 34://кипяченая вода
		{
			if(pInfo[playerid][voda]<80)
			{
			    pInfo[playerid][voda]+=20;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>19)
				{
				    pInfo[playerid][nyjda]-=20;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////
			    ApplyAnimation(playerid,"BAR","dnk_stndM_loop",4.100000, 0, 0,0,0,0);
			    PlayerPlaySound(playerid,32201, 0.000000, 0.000000, 0.000000);
			    SendClientMessage(playerid,0x008800AA,!"Вы выпили кипяченую воду");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это пить.");
			}
		}
		case 35://пиво
		{
			if(pInfo[playerid][voda]<90)
			{
			    pInfo[playerid][voda]+=10;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>1)
				{
				    pInfo[playerid][nyjda]-=2;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////
				if(pInfo[playerid][nastroenie]<100)
				{
				    pInfo[playerid][nastroenie]++;
				}
			    ApplyAnimation(playerid,"BAR","dnk_stndM_loop",4.100000, 0, 0,0,0,0);
			    PlayerPlaySound(playerid,32201, 0.000000, 0.000000, 0.000000);
			    SetPlayerAttachedObject(playerid,7, 1543,6, 0.081900, 0.031000, -0.235900, 0.000000, 0.000000, 0.000000, 1.000000, 1.000000, 1.000000);
       			SendClientMessage(playerid,0x008800AA,!"Вы выпили пиво. Не пейте много, если уже пьяны - вас может вырубить!");
       			SendClientMessage(playerid,0x008800AA,!"Ваше настроение улучшилось!");
       			SetPreciseTimer("REM_USE_LOT",4000,0,"d",playerid);
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это пить.");
			}
		
		}
		case 36://виски
		{
			if(pInfo[playerid][voda]<90)
			{
			    pInfo[playerid][voda]+=10;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>1)
				{
				    pInfo[playerid][nyjda]-=2;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////
				if(pInfo[playerid][nastroenie]<100)
				{
				    pInfo[playerid][nastroenie]++;
				}
			    ApplyAnimation(playerid,"BAR","dnk_stndM_loop",4.100000, 0, 0,0,0,0);
			    PlayerPlaySound(playerid,32201, 0.000000, 0.000000, 0.000000);
       			SendClientMessage(playerid,0x008800AA,!"Вы выпили виски. Не пейте много, если уже пьяны - вас может вырубить!");
       			SendClientMessage(playerid,0x008800AA,!"Ваше настроение улучшилось!");
       			SendClientMessage(playerid,0x008800AA,!"Вам стало теплее!");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это пить.");
			}
		}
		case 37://водка
		{
			if(pInfo[playerid][voda]<90)
			{
			    pInfo[playerid][voda]+=10;
			    ////////////////////////////////////////
			    if(pInfo[playerid][nyjda]>1)
				{
				    pInfo[playerid][nyjda]-=2;
				}
				else
				{
				    pInfo[playerid][nyjda]=0;
				}
				////////////////////////////////////////
				if(pInfo[playerid][nastroenie]<100)
				{
				    pInfo[playerid][nastroenie]++;
				}
				////////////////////////////////////////
				if(pInfo[playerid][temperatura]<91)
				{
					pInfo[playerid][temperatura]+=10;
				}
				else
				{
				    pInfo[playerid][temperatura]=100;
				}
				////////////////////////////////////////
			    ApplyAnimation(playerid,"BAR","dnk_stndM_loop",4.100000, 0, 0,0,0,0);
			    PlayerPlaySound(playerid,32201, 0.000000, 0.000000, 0.000000);
				SendClientMessage(playerid,0x008800AA,!"Вы выпили водку. Не пейте много, если уже пьяны - вас может вырубить!");
				SendClientMessage(playerid,0x008800AA,!"Напиток согревает, улучшает настроение и иммунитет!");
				SendClientMessage(playerid,0x008800AA,!"Ваше настроение улучшилось!");
				SendClientMessage(playerid,0x008800AA,!"Вам стало теплее!");
			}
			else
			{
				SendClientMessage(playerid,0xD20000AA,!"Ты не хочешь пока это пить.");
			}
		}
	    case 39://сигареты
	    {
			SendClientMessage(playerid,0x008800AA,!"Вы открыли пачку сигарет(20 шт)! Они сохраняются с релогом, но теряются при гибели.");
	        SendClientMessage(playerid,0x008800AA,!"Закурить: N-Действия.");
	        pInfo[playerid][cigarts]=20;
	    }
	    case 40://бронежилет
	    {
	        //вы надели бронежилет!
	    }
	    case 41://карта
	    {
	    }
	    case 42://навигатор
	    {
			//
			ShowPlayerDialog(playerid, 12000, 2, !"{0BBE01}Навигатор", "{008000}Оружие\n{FF0000}Больницы\n{0080FF}Полиция\n{FF8000}Одежда\n{962DFF}Кафе и магазины продуктов\n{FFFF00}Разное\n{80FF00}Убежища\nОтключить навигатор", "Метка", "Отмена");
	    }
	    case 43://рация
		{
		    if(pInfo[playerid][racia]==false)
		    {
		        pInfo[playerid][racia]=true;
		        SetPlayerAttachedObject(playerid,7, 363,8, 0.124900, 0.078900, 0.060000, 90.000000, -87.589996, 9.790000, 0.330000, 0.500000, 0.470000);
		        SendClientMessage(playerid,0x008800AA,!"Теперь вы можете пользоваться рацией, пока не умрете! Она ловит на расстоянии 1км.");
		        SendClientMessage(playerid,0x008800AA,!"Говорить в рацию команда: /р текст и /б текст");
		    }
		    else
		    {
		        SendClientMessage(playerid,0xD20000AA,!"У вас уже есть рация.");
		    }
		    
		}
		case 44://респиратор
		{
		    if(pInfo[playerid][Resp]==false)
		    {
		        pInfo[playerid][Resp]=true;
		        SendClientMessage(playerid,0x008800AA,!"Вы использовали респиратор, он сохраняется с релогом, но пропадает при гибели.");
		    }
		    else
		    {
		        SendClientMessage(playerid,0x008800AA,!"Вы надели новый респиратор! Он частично защитит вас от вирусов.");
		        SendClientMessage(playerid,0x008800AA,!"Респиратор сохраняется с релогом, но пропадает при гибели.");
		    }
		}
		case 45://дрова
		{
		    if(pInfo[playerid][spitchki]>0)
		    {
				//2015: потратив спички и дрова вы разожгли костер
                SendClientMessage(playerid,0xAFAFAFAA,!"Вы разожгли костер!");
                pInfo[playerid][spitchki]--;
		    }
		    else
		    {
		        SendClientMessage(playerid,0xFF0000FF,!"У вас нет спичек.");
		    }
		}
		case 46://спички
		{
		    SendClientMessage(playerid,0x008800AA,!"Вы открыли коробку спичек, теперь они готовы к использованию (20 шт)!");
		    pInfo[playerid][spitchki]=20;
		}
		case 47://удочка
		{
		}
		case 48://палатка
		{
		}
		case 49://10 ячеек
		{
		}
		case 50://20 ячеек
		{
		}
		case 51://30 ячеек
		{
		}
		case 52://40 ячеек
		{
		}
		case 53://50 ячеек
		{
			// барсов купил в своем видео как выживают топы
		}

		case 54://темроящик
		{
		
		}
		case 55://инструменты
		{
		}
		case 56://пустая канистра
		{
		}
		case 57://канистра с бензином
		{
		    if(IsPlayerInDynamicArea(playerid,AREA_BUNKER))
	        {
	        	SendClientMessage(playerid, 0xAFAFAFAA, !"Нельзя в безопасной зоне!");
	        }
	        else
	        {


				new Float:cx,Float:cy,Float:cz;
			    new Float:dist,Float:olddist=5.0;
			    new carid=0;
			    foreachA(PlayerPerhapsVehicle[playerid],vehicleid)
				{
				    GetVehiclePos(vehicleid,cx,cy,cz);
				    dist=GetPlayerDistanceFromPoint(playerid,cx,cy,cz);
				    if(dist<olddist)
				    {
				        olddist=dist;
				        carid=vehicleid;
				    }


				}
				if(carid!=0)
				{
				    if(vInfo[carid][benz]+5<=50)
				    {
				        vInfo[carid][benz]+=5;
				    }
				    else
				    {
				        vInfo[carid][benz]=50;
				    }
					SendClientMessage(playerid, 0x008800AA, !"Вы заправили транспорт из канистры + 5 литров!");
				}
			}
			//вы заправили транспорт из канистры + 5 литров
		}
		case 58://запчасти
		{
		    //вы не в машине - серый?
		    
	  //темно красным: Ты не умеешь ремонтировать транспорт. Обратись к Механику, он научит!
	  
		    // при помощи инструментов и запчастей, вы починили транспорт, как смогли!008800aa
		    //чтобы научиться чинить лучше и быстрее - обратитесь к механику 008800aa
		}
		case 59://рекомплект для шин
		{
		    //при помощи жгутов, клея и шипа, вы починили колесо, как смогли!
		}
		case 60://зачасти для мото/вело
		{
		}
		case 61://аккумулятор
		{
		    //вы установили новый аккумулятор в машину!
		    PlayerPlaySound(playerid,1133,0.0,0.0,0.0);
		}
		case 62://биобатарейка
		{
		}
		case 63://стройматериалы
		{
		}
		case 64://бинт
		{
		    PlayerPlaySound(playerid,42803, 0.000000, 0.000000, 0.000000);
		    pInfo[playerid][vivih]=false;
		    PlayerTextDrawColor(playerid,PLAYER_DRAWS[playerid][11],0x000000AA);
		}
	    case 65://аптечка
	    {
	        pInfo[playerid][vivih]=false;
	        SendClientMessage(playerid,0x008800AA,!"Вы использовали аптечку! Антибиотик борется с вирусом и восстанавливает ваш иммунитет и здоровье!");
			SetPlayerHealth(playerid,100);
			if(pInfo[playerid][immynitet]>50)
			{
			    pInfo[playerid][immynitet]=100;
			}
			else
			{
			    pInfo[playerid][immynitet]+=50;
			}
			UpdateImmynitet(playerid);
			PlayerTextDrawColor(playerid,PLAYER_DRAWS[playerid][11],0x000000AA);
	    }
	    case 66://снадобье
	    {
	    }
	    case 67://растирка
	    {
	    }
	    case 68://мазь от зомби
	    {
	    }
	    case 69://целебная трава
	    {
	    }
	    case 70://гитара
	    {
	    }
	    case 71://золото
	    {
	    }
	    case 72://новоодняя шапка
	    {
	    }
	    case 73://фейрверк
	    {
	    }
	    case 74://фейрверк ракета
	    {
	    }
	    case 75://посылка
	    {
	    }
	    case 76://подарок
	    {
	    }
	    case 77://подарок санты
	    {
	    }
	    case 78://бутылка с картой
	    {
	    }
	    case 79://тыква
	    {
	    }
	    case 80://ёлочная игрушка
	    {
	    }
	    case 81://деревянная игрушка
	    {
	    }
	    case 82://валентинка
	    {
	    }
	    case 83://части оружия
	    {
	        // при использовании ничего не происходит - проверял лично
	    }
	    case 84://бита
	    {
	    }
	    case 85://катана
	    {
			//"Вы взяли в руки катану"
	    }
	    case 86://полицейская дубинка
	    {
	    }
	    case 87://лопата
	    {
	    }
	    case 88://кий
	    {
	    }
	    case 89://цвета
	    {
	    }
	    case 90://огнетушитель
	    {
	    }
	    case 91://пистолет тт
	    {
	    }
	    case 92://патроны пистолета тт
	    {
	    }
	    case 93://пистолет пустынный орёл
	    {
	    }
	    case 94://патроны пистолет пустынный орёл
	    {
	    }
	    case 95://зажигательный пистолет
	    {
	    }
	    case 96://зажигательные капсулы
	    {
	    }
	    case 97://помповый дробавик
	    {
	    }
	    case 98://пт для помповый дробовик
	    {
	    }
	    case 99://самозарядный дробовик
	    {
	    }
	    case 100://пт для самозарядный дробовик
	    {
	    }
	    case 101://обрез
	    {
	    }
	    case 102://пт для обрез
	    {
	    }
	    case 103://узи
	    {
	    }
	    case 104://пт для узи
	    {
	    }
	    case 105://ак47
	    {
	    }
	    case 106://пт для ак47
	    {
	    }
	    case 107://м4
	    {
	    }
	    case 108://пт для м4
	    {
	    }
	    case 109://рпг
	    {
	        //ничего не писать в чат если рокета есть
	    }
	    case 110://ракета рпг
	    {
	    }
	    case 111://коктейль молотова
	    {
	    }
	    case 112://граната
	    {
	    }
	}
}

new PreLoot[MAX_PLAYERS][20];//20количество индексов вдиалоге
stock CreateLoot(lootid,Float:x,Float:y,Float:z,world=0,interior=0)
{


	if(endloot<MAX_LOOT-1)
	{
	    DropLoot[endloot][luttype]=lootid;
		DropLoot[endloot][dynO]=CreateDynamicObject(InfoLoot[lootid][model],x,y,z,0.0,0.0,0.0,world,interior,-1,25.0);
		DropLoot[endloot][dynT]=CreateDynamic3DTextLabel(InfoLoot[lootid][NAMEloot],0x008080FF,x,y,z,25.0);
		++endloot;
	}
}
stock deleteLoot(id)
{
	DestroyDynamicObject(DropLoot[id][dynO]);
	DestroyDynamic3DTextLabel(DropLoot[id][dynT]);
	
	if(endloot>0)
	{
		--endloot;
		
    	if(endloot!=id)
		{
	    	DropLoot[id][luttype]=DropLoot[endloot][luttype];
			DropLoot[id][dynO]=DropLoot[endloot][dynO];
			DropLoot[id][dynT]=DropLoot[endloot][dynT];
		}
//		else
//		{
		DropLoot[endloot][luttype]=0;
		DropLoot[endloot][dynO]=0;
		DropLoot[endloot][dynT]=0;
	//	}

	}
}

stock GivePlayerLoot(playerid, lootid)
{

    if(LOOT_KOLVO[playerid][lootid][kolichectvo]==0)
    {
	    if(lootid>8)
		{
		    pInfo[playerid][slot]++;//если лут может иметь слот в инвентаре (фотокарточка, журнал заданий, личные нужды , котелок не занимают слоты)
		}
		/////////////////////////////////////////////////////////////////////////////////////////////////////
		//расчет создания нового лута в инвенторе т.е. расчет, позиций расчет: dmsl- на каком уровне находится лут сверху в низ, rmsl= на каком уровне находится лут слева на право
		new lot_pos=0;
		for(;lot_pos<MAX_INVENTORY_LOOT;lot_pos++)//i=3 потому что личные нужды , журнал заданий, котелок - тоже луты (так сделал барсов)
		{
            if(PLAYER_LOOT_DRAW[playerid][lot_pos][loottype]==0)//если клетка в масиве пустая
            {
				break;//если клетка в масиве пустая останавливаем цикл
            }
		}
		PLAYER_LOOT_DRAW[playerid][lot_pos][loottype]=lootid;//присваеваем лут тип в масив
		LOOT_KOLVO[playerid][lootid][link_to_PTL]=lot_pos;
	   // new msl=pInfo[playerid][end_slot];
	    new dmsl=1;
		for(new cic=1;cic<8;cic++)
		{
		    if(lot_pos<cic*8)
		    {
	            dmsl=cic;
	            dmsl--;
		        break;
		    }
		}
		new rmsl=lot_pos-(dmsl*8);//-msl;
		if(lot_pos<8)//так надо!
		{
		    rmsl=lot_pos;
	    }
	    //////////////////////////////////////////////////////////////////////////////////////
	    new Float:plus_x=rmsl*25.699997,
	        Float:plus_y=dmsl*31.699997;
	    //===================================
	    new PlayerText:textid=CreatePlayerTextDraw(playerid,185.149994+plus_x, 187.234100+plus_y," ");//модель лута
	    PlayerTextDrawFont(playerid,textid, 5);
	    PlayerTextDrawTextSize(playerid,textid,25.000000,31.000000);
	    PlayerTextDrawSetSelectable(playerid,textid,true);
	    PlayerTextDrawSetPreviewModel(playerid,textid,InfoLoot[lootid][model]);
		PlayerTextDrawSetPreviewRot(playerid,textid,-25.000000, 0.000000, -20.000000, 1.050000);
		PLAYER_LOOT_DRAW[playerid][lot_pos][loot_model]=textid;

	    //===================================
	   // new str_klot[5];
	  //  format(str_klot,5,"x%d",LOOT_KOLVO[playerid][lootid]);
	    LOOT_KOLVO[playerid][lootid][kolichectvo]=1;
	  
		textid=CreatePlayerTextDraw(playerid,190.149994+plus_x, 208.234100+plus_y,"x1");//количество лута
	    PlayerTextDrawFont(playerid,textid, 1);
	    PlayerTextDrawLetterSize(playerid,textid,0.4,0.8);
	    PlayerTextDrawSetOutline(playerid,textid,1);
	//	PlayerTextDrawSetProportional: Scale the text spacing in a player-textdraw to a proportional ratio.
		PlayerTextDrawSetShadow(playerid,textid,0);
		PLAYER_LOOT_DRAW[playerid][lot_pos][loot_textX]=textid;
	    //===================================
	    
		
		for(lot_pos=MAX_INVENTORY_LOOT-1;lot_pos!=0;--lot_pos)//i=3 потому что личные нужды , журнал заданий, котелок - тоже луты (так сделал барсов)
		{
            if(PLAYER_LOOT_DRAW[playerid][lot_pos][loottype]!=0)//если клетка в масиве не пустая
            {
                pInfo[playerid][end_slot]=lot_pos;//+1;
				break;//если клетка в масиве не пустая останавливаем цикл
            }
		}
	}
	else
	{
		LOOT_KOLVO[playerid][lootid][kolichectvo]++;//повышаем количества этого лута
	    new str_klot[5];
	    format(str_klot,5,"x%d",LOOT_KOLVO[playerid][lootid][kolichectvo]);
		PlayerTextDrawSetString(playerid,PLAYER_LOOT_DRAW[playerid][LOOT_KOLVO[playerid][lootid][link_to_PTL]][loot_textX],str_klot);
	}
	new str_kolvo[7];
	format(str_kolvo,7,"%d/%d",pInfo[playerid][slot],pInfo[playerid][pack]*10);
	PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][21],str_kolvo);
}

SubStractPlayerLoot(playerid,lootid)
{
    if(LOOT_KOLVO[playerid][lootid][kolichectvo]>=1)
    {
       // enum ptle{PlayerText:loot_model,PlayerText:loot_textX,loottype};



		new link_ptl=LOOT_KOLVO[playerid][lootid][link_to_PTL];//kolichectvo

	//	PLAYER_LOOT_DRAW[playerid][link_ptl][loot_model];
		
		if(LOOT_KOLVO[playerid][lootid][kolichectvo]==1)
		{
			PlayerTextDrawDestroy(playerid, PLAYER_LOOT_DRAW[playerid][link_ptl][loot_model]);
			PlayerTextDrawDestroy(playerid, PLAYER_LOOT_DRAW[playerid][link_ptl][loot_textX]);
			PLAYER_LOOT_DRAW[playerid][link_ptl][loottype]=0;
			LOOT_KOLVO[playerid][lootid][kolichectvo]=0;
			LOOT_KOLVO[playerid][lootid][link_to_PTL]=0;
			
			for(new lot_pos=MAX_INVENTORY_LOOT-1;lot_pos!=0;--lot_pos)//i=3 потому что личные нужды , журнал заданий, котелок - тоже луты (так сделал барсов)
			{
	            if(PLAYER_LOOT_DRAW[playerid][lot_pos][loottype]!=0)//если клетка в масиве не пустая
	            {
	                pInfo[playerid][end_slot]=lot_pos;//+1;
					break;//если клетка в масиве не пустая останавливаем цикл
	            }
			}
		}
		else
		{
		    LOOT_KOLVO[playerid][lootid][kolichectvo]--;
		}
	    if(lootid>8)
		{
		    pInfo[playerid][slot]--;//если лут может иметь слот в инвентаре (фотокарточка, журнал заданий, личные нужды , котелок не занимают слоты)
			new str_kolvo[7];
			format(str_kolvo,7,"%d/%d",pInfo[playerid][slot],pInfo[playerid][pack]*10);
			PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][21],str_kolvo);
		}

    }
}

public OnGameModeInit()
{

	
//	Iter_Init(PlayerPerhapsVehicle);
//	Iter_Init(PlayerPerhapsLoot);

	ConnectNPC("Ivanish", "ivanish");
	
//	ConnectNPC("Armen_Britva", "oxrana_britva");//охранник ходящий в бункере


	////////////////////////////////////////////////////////////////
	SetNameTagDrawDistance(120.0);
	LimitGlobalChatRadius(10000.0);
	SetGravity(0.01100);//как и в оригинале сектора
	EnableStuntBonusForAll(0);//отключить денежный бонус в машине
	DisableInteriorEnterExits();//отключить стандартные интерьеры (желтые маркеры)
	ManualVehicleEngineAndLights();// при заходе в машину двигатель будет выключен
    UsePlayerPedAnims();//бег сиджея
    
    Streamer_VisibleItems(STREAMER_TYPE_OBJECT , 999);
	////////////////////////////////////////////////////////////////

	CreateVehicle(495,171.492000,1820.662000,18.360000,0.0,3,0,99999);//1        Арендуемая машина механика
	CreateVehicle(495,156.904327,1820.629028,17.991159,0.0,3,0,99999);//        Арендуемая машина механика
	CreateVehicle(557,164.210602,1820.685303,17.968100,0.0,6,6,99999);//        Арендуемая машина механика

	CreateVehicle(416,117.207413,1831.780640,17.762672,270.0,0,121,99999);//    Скорая помощь
	CreateVehicle(416,117.201050,1837.870361,17.781521,270.0,0,121,99999);//    Скорая помощь
	CreateVehicle(416,117.197845,1843.417114,17.800543,270.0,0,121,99999);//    Скорая помощь
	CreateVehicle(416,117.199417,1849.252808,17.836210,270.0,0,121,99999);//    Скорая помощь
	CreateVehicle(416,117.207809,1854.254150,17.840788,270.0,0,121,99999);//    Скорая помощь
	CreateVehicle(416,117.210678,1859.919922,17.830564,270.0,0,121,99999);//    Скорая помощь
	for(new i=4;i<10;++i)
	{
		SetVehicleHealth(i,700.000000);
	}
	CreateVehicle(470,199.716003,1822.005981,17.381901,0.000000,-1,-1,99999);//10     	Хаммер наёмников
	CreateVehicle(470,205.212296,1822.005981,17.381901,0.000000,-1,-1,99999);//     	Хаммер наёмников
	CreateVehicle(470,210.859894,1822.005981,17.381901,0.000000,-1,-1,99999);//     	Хаммер наёмников
	CreateVehicle(470,217.263000,1822.005981,17.381901,0.000000,-1,-1,99999);//13     	Хаммер наёмников

	CreateVehicle(582,220.069366,1932.622925,17.673651,179.290787,254,0,99999);//14       Машина радиоведущих
	CreateVehicle(582,213.636505,1932.907837,17.673124,180.018677,254,0,99999);//      Машина радиоведущих
	CreateVehicle(411,209.666000,1933.909302,17.330803,180.000031,254,254,99999);//16      Машина радиоведущих

	CreateVehicle(509, 1761.3119, 2871.7283, 13.7575, 95.0000, -1, -1, 99999);/////////////////////////////////////
	CreateVehicle(509, 2819.9929, 2137.2751, 14.1522, 0.0000, -1, -1, 99999);
	CreateVehicle(509, 2195.0962, 1986.3613, 11.8110, 0.0000, -1, -1, 99999);
	CreateVehicle(509, 1411.1875, 2002.4510, 14.2795, 90.0000, -1, -1, 99999);
	CreateVehicle(509, 1896.7345, 727.8359, 13.7815, 0.0000, -1, -1, 99999);
	CreateVehicle(509, 2513.8018, 125.9797, 27.2115, 0.0000, -1, -1, 99999);
	CreateVehicle(509, 1537.8865, 19.8537, 23.6194, 3.0000, -1, -1, 99999);
	CreateVehicle(510, 297.5757, -1764.8778, 4.1384, 90.0000, -1, -1, 99999);//////////////// В Е Л О С И П Е Д Ы //////
	CreateVehicle(509, -90.8357, -1598.9365, 2.1288, -60.0000, -1, -1, 99999);
	CreateVehicle(509, -2182.2678, -2260.1851, 32.7787, -40.0000, -1, -1, 99999);
	CreateVehicle(509, -2815.2944, -1509.7472, 138.7737, -90.0000, -1, -1, 99999);
	CreateVehicle(509, -2792.7292, -55.2396, 6.6602, 0.0000, -1, -1, 99999);
	CreateVehicle(509, -2619.8098, 61.4800, 3.8219, 0.0000, -1, -1, 99999);
	CreateVehicle(510, -2657.6917, 852.4637, 63.6033, 0.0000, -1, -1, 99999);
	CreateVehicle(509, -2446.9343, 2492.2456, 14.8435, 0.0000, -1, -1, 99999);//////////////////////////////////
	
	
    CreateVehicle(604,-86.154282,1155.981079,19.370411,26.821384,-1,-1,99999);//ломанная машина биг смоука в ФОРТ КАРСОНЕ
    
    
    
    CreateVehicle(478,156.665359,-173.800552,1.547510,26.460487,-1,-1,99999);//мясовозка деревня справа от фермы
    CreateVehicle(448,214.167999,-177.226898,1.173900,320.861694,-1,-1,99999);//мотоцикл пиццерии
    CreateVehicle(498,218.537201,11.942997,2.599802,312.083710,-1,-1,99999);//boxville справа от фермы

	for(new i=0;i<40;++i)
	{
    	SetVehicleNumberPlate(i, "SEKTOR 2");
    }
/*
//unkown CreateDynamicActor(297, 190.323898, 1818.213623, 1217.751221,  0.000000);//83 100.000000
//unkown CreateDynamicActor(164, 194.417557, 1818.299683, 1217.751221,  48.776619);//84 100.000000

//[11:51:12] ?? ???????? ?? ???? ? ???? ??????!
//[11:51:12] ?? ????? ? ????????, ??? ????? ????????? ????? ? ??????!


[11:51:19] ? ??? ??? ????! ?? ??????: 2276 ??????(?)

[11:51:36] ?? ?????? ??????????! {FF0000}?? ????????? ???????, ???? ?? ?????? ?? ????????!

[11:51:36] ????? ???????? ???????, ?? ???????? ?????????? (????????, 1 ??? ???????? ???????).

[11:51:37] ?????? ?????? ?? ????? ?????????? ? ?????????! {FF0000}?? ???????? ??????????!


*/

new obj;
CreateDynamicObject(3109,-1800.704834,1201.030396,25.269583,0.000000,0.000000,270.000000);
CreateDynamicObject(3117,-1800.034546,1201.094238,27.416578,0.000000,266.000000,90.000000);
CreateDynamicObject(3095,-1935.915771,239.554001,33.309135,90.000000,0.000000,0.000000);
CreateDynamicObject(3095,-2716.774170,217.249832,3.179688,0.000000,90.000000,0.000000);
CreateDynamicObject(3095,1042.489136,-1025.501221,31.069178,90.000000,0.000000,0.000000);
CreateDynamicObject(3117,2646.644287,-2039.209717,13.539376,90.000000,0.000000,180.000000);
CreateDynamicObject(3117,2643.100098,-2039.234741,13.553406,90.000000,0.000000,179.994507);
CreateDynamicObject(3117,2646.637451,-2039.217285,14.665037,90.000000,0.000000,179.994507);
CreateDynamicObject(3117,2643.091553,-2039.243286,14.665037,90.000000,0.000000,179.994507);
CreateDynamicObject(3095,2386.827637,1044.112915,9.820313,90.000000,0.000000,0.000000);
CreateDynamicObject(3095,720.015625,-462.523407,16.399401,90.000000,0.000000,0.000000);
CreateDynamicObject(3095,-1420.546875,2591.156250,56.045799,90.000000,0.000000,-1.570800);
CreateDynamicObject(3095,-100.000000,1111.414063,19.995899,90.000000,0.000000,0.000000);
CreateDynamicObject(3095,2071.476563,-1831.421875,13.041370,90.000000,0.000000,89.696991);
CreateDynamicObject(3095,-2425.726563,1027.992188,52.281250,90.000000,0.000000,-1.570800);
CreateDynamicObject(3095,1968.046997,2162.569092,11.583700,90.000000,0.000000,90.000000);
CreateDynamicObject(3095,487.871735,-1734.485840,12.390630,90.000000,0.000000,351.977264);
CreateDynamicObject(3095,1024.984375,-1029.351563,31.566000,90.000000,0.000000,0.000000);
CreateDynamicObject(3095,-1904.531250,277.898407,42.713100,90.000000,0.000000,0.000000);
CreateDynamicObject(19315,-426.788177,-1804.827515,4.243336,0.000000,0.000000,183.480194);
CreateDynamicObject(19379,-7.060000,95.180000,1000.000000,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,3.420000,95.180000,1000.000000,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,1159.880859,-1314.383057,900.485596,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,1170.384155,-1324.015381,900.485596,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,1170.384155,-1314.383057,900.485596,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,1159.880859,-1324.015381,900.485596,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,1159.880859,-1304.755615,900.485596,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,1170.364258,-1304.752197,900.485596,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,1180.867920,-1304.752197,900.485596,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,1180.867920,-1314.383057,900.485596,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,1180.867920,-1324.015381,900.485596,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,-1506.949341,2515.325195,861.395020,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,-1506.949341,2505.709473,861.395020,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,-1506.949341,2496.084961,861.395020,0.000000,90.000000,0.000000);
CreateDynamicObject(19445,-1512.098877,2505.472168,863.067505,0.000000,0.000000,0.000000);
CreateDynamicObject(14597,1604.430054,1771.640015,1000.280029,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,-315.690399,1048.562500,823.997192,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,-315.691162,1058.179443,823.997192,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,-326.178589,1048.562500,823.997192,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,-326.178314,1058.179443,823.997192,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,-326.178589,1038.939331,823.997192,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,-315.690399,1038.939331,823.997192,0.000000,90.000000,0.000000);
CreateDynamicObject(19445,-331.357513,1048.585449,825.832825,0.000000,0.000000,0.000000);
CreateDynamicObject(19545,331.154999,1830.657227,5.976799,0.000000,0.000000,90.000000);
CreateDynamicObject(19377,247.172897,1858.169678,7.642400,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,258.136597,1854.737671,7.642400,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,248.213303,1878.240967,7.642400,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,243.287399,1848.109253,7.642400,0.000000,90.000000,0.000000);
CreateDynamicObject(14668,-1269.770020,2718.459961,850.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(14665,666.559998,1712.150024,800.349976,0.000000,0.000000,0.000000);
CreateDynamicObject(14846,2289.540039,2454.909912,1000.929993,0.000000,0.000000,0.000000);
CreateDynamicObject(19379,-2159.631836,-2377.603760,836.774109,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,-2159.631836,-2387.233398,836.774109,0.000000,90.000000,0.000000);
CreateDynamicObject(19545,-1950.609985,360.279999,993.130005,0.000000,0.000000,0.000000);
CreateDynamicObject(19545,-1935.630005,360.279999,993.130005,0.000000,0.000000,0.000000);
CreateDynamicObject(19594,72.580902,1974.575195,827.916870,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,289.498688,1831.991821,6.938499,0.000000,90.000000,0.000000);
CreateDynamicObject(18045,2179.560059,944.760010,1000.659973,0.000000,0.000000,0.000000);
CreateDynamicObject(16059,606.030029,871.450012,840.000000,356.859985,0.000000,3.140000);
CreateDynamicObject(19377,626.150024,836.280029,840.909973,0.000000,90.000000,91.040001);
CreateDynamicObject(1800,277.740692,1855.710327,7.650000,0.000000,0.000000,-90.699974);
CreateDynamicObject(1800,277.760834,1860.640747,7.650000,0.000000,0.000000,-90.699974);
CreateDynamicObject(19448,289.776215,1815.189331,3.585999,0.000000,90.000000,90.000000);
CreateDynamicObject(19448,280.153290,1815.189331,3.585999,0.000000,90.000000,90.000000);
CreateDynamicObject(19594,317.444489,2030.600464,900.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(19461,322.604492,2050.912842,895.337708,0.000000,90.000000,180.000000);
CreateDynamicObject(19461,322.604492,2041.289551,895.337708,0.000000,90.000000,180.000000);
CreateDynamicObject(19461,322.604492,2031.661011,895.337708,0.000000,90.000000,180.000000);
CreateDynamicObject(19461,312.489288,2031.661011,895.337708,0.000000,90.000000,0.000000);
CreateDynamicObject(19461,312.489288,2041.289551,895.337708,0.000000,90.000000,0.000000);
CreateDynamicObject(19461,312.489288,2050.912842,895.337708,0.000000,90.000000,0.000000);
CreateDynamicObject(19461,318.390808,2057.433838,895.317688,0.000000,90.000000,-90.000000);
CreateDynamicObject(19375,230.416901,1887.014038,816.626892,0.000000,90.000000,0.000000);
CreateDynamicObject(19375,230.416901,1887.014038,1216.626831,0.000000,90.000000,0.000000);
CreateDynamicObject(19355,853.395996,-1389.341919,-1.615100,0.000000,90.000000,47.769402);
CreateDynamicObject(19355,2559.982910,-417.517395,793.903992,0.000000,90.000000,90.000000);
CreateDynamicObject(14412,-2445.570068,2278.040039,850.000000,0.000000,0.000000,89.879997);
CreateDynamicObject(6959,379.940002,2389.500000,1888.599976,0.000000,0.000000,0.000000);
CreateDynamicObject(19461,365.450012,2390.639893,1893.790039,0.000000,0.000000,0.000000);
CreateDynamicObject(19860,-293.950012,1759.199951,853.919983,0.000000,0.000000,180.000000);
CreateDynamicObject(19860,-296.950012,1759.209961,853.919983,0.000000,0.000000,0.000000);
CreateDynamicObject(14425,-322.720001,1770.650024,850.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(14488,-303.010010,1809.640015,855.080017,0.000000,0.000000,0.000000);
CreateDynamicObject(14424,-280.730011,1788.500000,854.289978,0.000000,0.000000,-90.000000);
CreateDynamicObject(14393,-283.720001,1784.849976,854.890015,0.000000,0.000000,180.000000);
CreateDynamicObject(14430,-322.720001,1770.650024,850.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(14431,-322.720001,1770.650024,850.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(14389,-252.419998,1664.599976,855.929993,0.000000,0.000000,90.000000);
CreateDynamicObject(14431,-322.720001,1782.650024,850.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(19860,-285.130005,1701.817993,853.925598,0.000000,0.000000,0.000000);
CreateDynamicObject(19860,-282.131989,1701.817993,853.935608,0.000000,0.000000,180.000000);
CreateDynamicObject(968,1100.229980,2289.219971,10.656000,0.000000,90.000000,89.489998);
CreateDynamicObject(19538,1157.752197,1189.659302,1100.000000,0.000000,0.000000,90.000000);
CreateDynamicObject(19538,1550.899414,1074.603027,1099.959961,0.000000,0.000000,-45.000000);
CreateDynamicObject(3502,2856.169678,-112.719398,800.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(18038,828.851563,-370.581116,700.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(18065,2335.277100,47.797600,800.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(14665,2100.629639,2611.791016,800.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(14593,2142.706543,2829.364502,900.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(9316,2577.143555,-422.789795,797.878113,4.000000,0.000000,271.324005);
CreateDynamicObject(5772,2548.223633,-422.065399,800.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(14794,1334.312012,297.098206,900.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2816.859863,2665.360840,811.462830,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2821.015137,2742.855957,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(18022,-2157.183594,-2458.745117,700.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(19543,603.890198,99.316704,800.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(19543,603.890198,99.316704,1200.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(19543,603.890198,99.316704,1600.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(19543,603.890198,99.316704,2000.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(19538,1475.482056,751.234314,850.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(18028,2314.784180,-1640.690918,870.000000,0.000000,0.000000,180.000000);
CreateDynamicObject(19538,-2056.799805,-1323.901245,850.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(19543,1099.004517,-927.569641,1000.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(19536,2174.345703,-4456.424805,100.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(11700,2221.771729,-4446.992188,100.170097,0.000000,10.000000,90.000000);
CreateDynamicObject(19532,2173.673828,-4453.407715,100.007896,0.000000,0.000000,90.000000);
CreateDynamicObject(3594,2214.778809,-4445.676758,100.777496,-3.000000,0.000000,306.325287);
CreateDynamicObject(12957,2171.784180,-4465.282227,100.672699,0.000000,0.000000,31.906200);
CreateDynamicObject(17030,2122.181885,-4485.295410,98.873734,0.000000,0.000000,10.067629);
CreateDynamicObject(17030,2161.567871,-4512.107910,98.873734,0.000000,0.000000,22.906469);
CreateDynamicObject(17030,2128.968750,-4417.190918,98.152382,0.000000,0.000000,267.335052);
CreateDynamicObject(17030,2162.120605,-4392.889648,97.215530,0.000000,0.000000,263.801453);
CreateDynamicObject(698,2162.418213,-4482.411133,104.962349,0.000000,0.000000,17.867720);
CreateDynamicObject(698,2206.009277,-4475.169434,104.962349,0.000000,0.000000,280.020752);
CreateDynamicObject(698,2100.430176,-4478.070313,104.962349,0.000000,0.000000,319.225739);
CreateDynamicObject(698,2161.313965,-4438.134277,104.962349,0.000000,0.000000,62.044491);
CreateDynamicObject(698,2184.239258,-4426.349121,104.962349,0.000000,0.000000,185.338135);
CreateDynamicObject(698,2206.273438,-4425.582520,104.962349,0.000000,0.000000,185.338135);
CreateDynamicObject(19632,2206.116699,-4464.686523,100.133797,0.000000,0.000000,0.000000);
CreateDynamicObject(19793,2206.129150,-4464.855469,100.082901,0.000000,0.000000,0.000000);
CreateDynamicObject(19793,2206.133789,-4464.698730,100.082901,0.000000,0.000000,0.000000);
CreateDynamicObject(19793,2206.128906,-4464.511230,100.082901,0.000000,0.000000,0.000000);
CreateDynamicObject(18566,2202.763184,-4466.092285,98.158699,90.000000,90.000000,15.827500);
CreateDynamicObject(371,2202.052979,-4463.621582,100.206856,-25.000000,0.000000,111.091202);
CreateDynamicObject(355,2202.371094,-4464.134766,100.234612,-55.000000,-90.000000,90.000000);
CreateDynamicObject(874,2186.505615,-4471.463867,101.021584,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2194.952393,-4477.120605,100.913498,0.000000,0.000000,90.000000);
CreateDynamicObject(874,2213.265869,-4467.698242,100.913498,0.000000,0.000000,90.000000);
CreateDynamicObject(874,2156.377197,-4468.657227,100.510490,0.000000,0.000000,90.000000);
CreateDynamicObject(874,2199.051025,-4440.573242,100.510490,0.000000,0.000000,232.776428);
CreateDynamicObject(874,2172.838623,-4439.367188,100.510498,0.000000,0.000000,90.000000);
CreateDynamicObject(874,2145.824463,-4439.747559,100.510498,0.000000,0.000000,90.000000);
CreateDynamicObject(874,2228.134521,-4439.407715,100.510498,0.000000,0.000000,90.000000);
CreateDynamicObject(874,2192.898438,-4453.244629,99.074898,0.000000,0.000000,90.000000);
CreateDynamicObject(874,2173.385986,-4446.151855,98.974899,0.000000,0.000000,90.000000);
CreateDynamicObject(874,2163.544922,-4453.317871,99.074898,0.000000,0.000000,90.000000);
CreateDynamicObject(19559,2203.839600,-4464.915527,99.993713,-90.000000,0.000000,325.956085);
CreateDynamicObject(11719,2205.285400,-4464.013184,99.977798,0.000000,0.000000,224.638474);
CreateDynamicObject(1487,2203.021240,-4466.418457,100.187302,0.000000,0.000000,0.000000);
CreateDynamicObject(883,2185.802490,-4473.206543,99.997543,0.000000,0.000000,0.000000);
CreateDynamicObject(883,2191.098389,-4443.999512,99.997543,0.000000,0.000000,0.000000);
CreateDynamicObject(885,2197.089600,-4477.198730,100.002609,0.000000,0.000000,0.000000);
CreateDynamicObject(18690,2213.588379,-4446.665039,99.012947,0.000000,0.000000,0.000000);
CreateDynamicObject(18689,2206.082275,-4465.029785,99.001350,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2192.616943,-4465.785645,100.101044,0.000000,0.000000,59.299995);
CreateDynamicObject(18698,2225.007813,-4447.656738,100.415611,0.000000,0.000000,0.000000);
CreateDynamicObject(18691,2214.364746,-4445.121094,97.722099,0.000000,0.000000,0.000000);
CreateDynamicObject(18698,2224.625488,-4451.450684,100.605568,0.000000,0.000000,0.000000);
CreateDynamicObject(18698,2225.971436,-4447.109375,100.299355,0.000000,0.000000,0.000000);
CreateDynamicObject(18727,2206.139160,-4464.682617,98.616074,0.000000,0.000000,0.000000);
CreateDynamicObject(19299,2103.534180,-4454.228516,128.697403,0.000000,0.000000,0.000000);
CreateDynamicObject(19378,2248.933105,-4431.291504,100.459999,0.000000,90.000000,0.000000);
CreateDynamicObject(19452,2248.587891,-4427.403809,102.194138,0.000000,0.000000,90.000000);
CreateDynamicObject(19327,2249.691650,-4427.509766,102.614021,0.000000,0.000000,0.000000);
CreateDynamicObject(1839,2250.304932,-4428.001465,101.237053,0.000000,0.000000,57.299992);
CreateDynamicObject(19993,2249.818604,-4428.226563,101.435013,0.000000,0.000000,0.000000);
CreateDynamicObject(338,2250.389160,-4428.123535,101.062088,0.000000,0.000000,0.000000);
CreateDynamicObject(19182,2249.934570,-4428.035156,101.681221,92.399986,-37.800011,0.000000);
CreateDynamicObject(19182,2249.934570,-4428.035156,201.681213,92.399986,-37.800011,0.000000);
CreateDynamicObject(2205,2248.910400,-4428.041016,100.544777,0.000000,0.000000,0.000000);
CreateDynamicObject(1720,2249.272217,-4428.702148,100.529228,0.000000,0.000000,139.400024);
CreateDynamicObject(2828,2249.522705,-4427.769531,101.479691,0.000000,0.000000,156.999863);
CreateDynamicObject(19942,2249.626221,-4427.643066,101.586655,0.000000,0.000000,0.000000);
CreateDynamicObject(19896,2250.046143,-4428.331055,101.493164,0.000000,0.000000,13.799999);
CreateDynamicObject(19625,2249.713867,-4428.267578,101.496094,-24.099998,0.000000,97.900024);
CreateDynamicObject(2853,2248.791016,-4427.616211,101.477859,0.000000,0.000000,0.000000);
CreateDynamicObject(346,2249.068359,-4428.239746,101.524055,-85.999893,-19.500000,1.299999);
CreateDynamicObject(1486,2250.553223,-4428.412598,101.619789,0.000000,0.000000,11.700003);
CreateDynamicObject(2196,2249.635498,-4427.609863,101.486382,0.000000,0.000000,-35.500000);
CreateDynamicObject(19995,2249.240234,-4428.270996,101.495674,2.099995,90.699989,79.400024);
CreateDynamicObject(2069,2251.143799,-4428.135742,100.605659,0.000000,0.000000,0.000000);
CreateDynamicObject(19543,-377.700043,-1425.964111,800.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(18849,3153.191895,3926.979248,-300.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(19379,-1468.028198,1878.182617,900.000000,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,627.744629,-427.971802,1200.009766,0.000000,90.000000,0.000000);
CreateDynamicObject(19379,629.361084,-503.020691,1200.000000,0.000000,90.000000,0.000000);
CreateDynamicObject(19378,1293.349731,-1799.860107,2501.858643,0.000000,90.000000,0.000000);
CreateDynamicObject(14709,-1519.410767,1952.467407,1610.404907,0.000000,0.000000,0.000000);
CreateDynamicObject(19380,190.879700,1821.383179,1216.566528,0.000000,90.000000,0.000000);
CreateDynamicObject(11692,199.330002,1943.790039,18.200001,0.000000,0.000000,0.000000,  -1,  -1,  -1, 400.0, 400.0,  -1, 1);
CreateDynamicObject(19905,118.889999,1844.959961,16.520000,0.000000,-0.200000,90.410004);
CreateDynamicObject(19312,191.139999,1870.040039,21.480000,0.000000,0.000000,0.000000);
CreateDynamicObject(8251,213.919998,1888.369995,20.320000,0.000000,0.000000,90.000000);
CreateDynamicObject(18248,94.430000,1990.489990,25.139999,0.000000,0.000000,42.419998);
vorota=CreateDynamicObject(10671,212.600006,1875.630005,13.970000,0.000000,0.000000,90.000000);
CreateDynamicObject(1579,323.378876,1827.451782,6.940700,0.000000,0.000000,0.000000);
CreateDynamicObject(19289,1572.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19290,1571.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19291,1570.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(18718,1569.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19292,1568.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19293,1567.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19294,1566.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(18715,1565.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19289,1564.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19290,1563.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19291,1562.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(18718,1561.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19292,1560.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19293,1559.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19294,1558.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(18728,1557.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19289,1556.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19290,1555.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19291,1554.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(18718,1553.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19292,1552.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19293,1551.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19294,1550.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(18718,1549.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(18718,1548.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(18728,1569.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(345,1572.778198,-2656.704834,13.055200,90.000000,0.000000,0.000000);
CreateDynamicObject(18716,1568.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(18718,1568.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19298,1568.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(19297,1568.778198,-2656.704834,13.055200,0.000000,0.000000,0.000000);
CreateDynamicObject(4238,116.809998,1941.420044,21.629999,0.000000,0.000000,210.190002);
CreateDynamicObject(4238,135.320007,1941.479980,25.840000,0.000000,0.000000,210.190002);
CreateDynamicObject(4238,285.732605,1843.810059,20.413900,0.000000,0.000000,120.322800);
CreateDynamicObject(4238,285.797363,1821.206055,24.569370,0.000000,0.000000,120.322777);

obj=CreateDynamicObject(19353,313.847504,1836.865112,8.407900,0.000000,0.000000,90.000000);
SetDynamicObjectMaterialText(obj,0,"Эта работа нужна для получения\n{ff0000}РЕСПИРАТОРА\n{000000}А не для заработка денег\nПолучишь респиратор - беги на поверхность!\nТам собирай лут и продавай в бункер.\nТак заработаешь бабосики.",OBJECT_MATERIAL_SIZE_256x128,"Arial", 13,  1, 0x000000FF,  0, 1);

obj=CreateDynamicObject(19353,245.348587,1838.580933,8.370800,0.000000,0.000000,90.000000);
SetDynamicObjectMaterialText(obj,0,"{ff0000}ВНИМАНИЕ! МОШЕННИКИ!\n{ffffff}Покупайте вещи только через\n{ff0000}ТОРГ или у Иваныча!\n{ffffff}Не переводите деньги\nнезнакомым мародёрам",OBJECT_MATERIAL_SIZE_256x128,"Arial", 20,  1, 0xFFFFFFFF,  0,  1);


CreateDynamicObject(12957,-11.260000,-31.620001,2.740000,0.000000,0.000000,-54.779999);
CreateDynamicObject(874,30.330000,-15.090000,1.520000,0.000000,0.000000,0.000000);
CreateDynamicObject(765,25.230000,24.889999,2.080000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,-41.625889,-8.816970,2.104590,0.000000,0.000000,0.000000);
CreateDynamicObject(1355,-48.587730,-10.638590,2.547700,0.000000,60.000000,-68.819946);
CreateDynamicObject(1327,-49.032299,-9.485600,2.104400,0.000000,90.000000,0.000000);
CreateDynamicObject(854,-47.390499,-15.867700,2.333300,0.000000,0.000000,0.000000);
CreateDynamicObject(13367,48.619999,10.570000,11.830000,13.140000,0.000000,32.619999);
CreateDynamicObject(3374,-43.839668,27.906441,3.563710,0.000000,0.000000,337.161255);
CreateDynamicObject(874,-4.540000,-52.110001,2.040000,0.000000,0.000000,0.000000);
CreateDynamicObject(3374,-41.998909,31.557671,3.563710,0.000000,0.000000,337.161255);
CreateDynamicObject(937,-38.594330,36.525650,2.519100,0.000000,0.000000,71.586197);
CreateDynamicObject(944,-37.905460,39.627419,2.834200,0.000000,0.000000,250.688965);
CreateDynamicObject(874,-52.653301,-17.761700,1.988600,0.000000,0.000000,-43.860001);
CreateDynamicObject(3374,-47.564949,29.399111,3.563710,0.000000,0.000000,337.161255);
CreateDynamicObject(1431,-37.769909,42.326382,2.112620,0.000000,0.000000,0.000000);
CreateDynamicObject(2589,-46.176430,34.544369,11.397810,0.000000,0.000000,0.000000);
CreateDynamicObject(2589,-45.217388,37.348721,11.397810,0.000000,0.000000,0.000000);
CreateDynamicObject(3374,-51.348652,31.079691,3.563710,0.000000,0.000000,337.161255);
CreateDynamicObject(2589,-44.345501,39.684319,11.397810,0.000000,0.000000,0.000000);
CreateDynamicObject(1431,-37.913639,47.678371,5.998010,0.000000,0.000000,59.609402);
CreateDynamicObject(2589,-43.354431,42.367050,11.397810,0.000000,0.000000,0.000000);
CreateDynamicObject(1431,-36.861179,49.760330,5.998010,0.000000,0.000000,66.554047);
CreateDynamicObject(2589,-42.423420,45.389191,11.397810,0.000000,0.000000,0.000000);
CreateDynamicObject(2589,-41.286919,48.615742,11.397810,0.000000,0.000000,0.000000);
CreateDynamicObject(3374,-45.166599,53.018379,3.563710,0.000000,0.000000,341.599060);
CreateDynamicObject(874,-76.061043,5.517360,2.109410,0.000000,0.000000,47.939991);
CreateDynamicObject(851,-46.368999,79.083801,2.343900,0.000000,0.000000,0.000000);
CreateDynamicObject(874,-43.317799,85.025101,1.900100,0.000000,0.000000,54.299999);
CreateDynamicObject(13367,-71.819000,65.594101,12.389400,3.141600,14.000000,-46.464901);
obj=CreateDynamicObject(19993,-104.619904,6.437700,5.121100,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,1453,"break_farm","CJ_HAY");
CreateDynamicObject(12957,90.510002,54.450001,0.250000,0.000000,0.000000,-30.660000);
CreateDynamicObject(874,-103.982903,-23.865200,1.967200,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19993,-96.602402,-54.016499,9.997400,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,1453,"break_farm","CJ_HAY");
CreateDynamicObject(734,59.680000,97.889999,1.380000,0.000000,0.000000,-19.980000);
CreateDynamicObject(874,-55.679699,101.645401,1.839700,0.000000,0.000000,44.820000);
CreateDynamicObject(1292,-43.041500,108.156998,2.530200,0.000000,90.000000,-235.199966);
CreateDynamicObject(3374,-50.350201,109.036003,2.080900,360.458405,90.000000,-2.783800);
CreateDynamicObject(2670,-48.222580,111.311707,2.194700,0.000000,0.000000,-55.439991);
CreateDynamicObject(2237,-50.010700,112.038200,2.232600,270.000000,90.000000,-48.119999);
CreateDynamicObject(1558,-52.994701,113.034798,2.573300,0.000000,0.000000,-27.540001);
CreateDynamicObject(874,82.290001,108.269997,1.060000,0.000000,0.000000,-43.259998);
CreateDynamicObject(849,101.320000,102.089996,1.370000,0.000000,0.000000,-57.900002);
CreateDynamicObject(3363,-113.091637,89.707100,1.891960,0.000000,0.000000,46.483170);
CreateDynamicObject(874,-58.812351,132.487640,1.850200,0.000000,0.000000,-155.340042);
CreateDynamicObject(1257,-52.776402,135.486496,3.029400,0.000000,90.000000,78.480003);
CreateDynamicObject(874,25.510000,144.960007,0.870000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,-45.113701,141.664505,1.850200,0.000000,0.000000,-42.779999);
CreateDynamicObject(3593,-128.190002,75.989998,2.590000,0.000000,0.000000,12.600000);
CreateDynamicObject(874,123.070000,86.790001,0.890000,0.000000,0.000000,22.680000);
CreateDynamicObject(12922,-32.089710,147.176224,2.249100,270.141602,0.000000,-176.050598);
CreateDynamicObject(874,-136.976303,-65.044601,2.161700,0.000000,0.000000,-123.660004);
obj=CreateDynamicObject(19993,-143.541595,-51.472542,4.921300,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,1453,"break_farm","CJ_HAY");
CreateDynamicObject(3276,-32.115631,157.926270,1.580300,90.183296,-1.788000,-148.406006);
CreateDynamicObject(874,-39.680939,159.137970,1.253700,0.000000,0.000000,0.000000);
CreateDynamicObject(874,149.889999,-70.870003,0.420000,0.000000,0.000000,76.080002);
CreateDynamicObject(765,-133.729996,106.449997,2.060000,0.000000,0.000000,0.000000);
CreateDynamicObject(734,-84.669998,-154.139999,1.840000,0.000000,0.000000,0.000000);
CreateDynamicObject(734,15.970000,-175.149994,-0.580000,0.000000,0.000000,0.000000);
CreateDynamicObject(765,151.520004,99.180000,1.900000,0.000000,0.000000,75.540001);
CreateDynamicObject(1440,160.720001,100.279999,3.110000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,184.149994,-50.029999,0.420000,0.000000,0.000000,0.000000);
CreateDynamicObject(1327,166.259995,96.570000,3.270000,-0.020000,35.000000,65.339996);
CreateDynamicObject(874,-121.709999,-150.529999,2.040000,0.000000,0.000000,-47.459999);
CreateDynamicObject(874,157.960007,113.099998,2.250000,0.000000,0.000000,41.520000);
CreateDynamicObject(3594,171.759995,91.870003,3.050000,0.000000,0.000000,-125.580002);
CreateDynamicObject(1327,-146.130005,131.600006,2.650000,0.000000,90.000000,0.000000);
CreateDynamicObject(16302,171.139999,103.519997,3.230000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,190.229996,64.290001,0.610000,0.000000,0.000000,-5.580000);
CreateDynamicObject(2228,-140.500000,144.160004,3.290000,10.000000,0.000000,126.419998);
CreateDynamicObject(12957,-140.919998,146.919998,3.470000,0.000000,0.000000,27.420000);
CreateDynamicObject(874,120.050003,-166.020004,0.450000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,-29.240000,-203.000000,0.360000,0.000000,0.000000,50.400002);
CreateDynamicObject(1327,128.789993,-161.309998,0.420000,0.000000,90.000000,0.000000);
CreateDynamicObject(1327,134.300003,-157.229996,0.420000,0.000000,90.000000,0.000000);
CreateDynamicObject(3276,44.240002,-210.429993,0.600000,90.860001,0.000000,-139.080002);
CreateDynamicObject(874,-161.440002,146.360001,3.720000,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,54.549999,-211.100006,0.950000,0.000000,0.000000,39.840000);
CreateDynamicObject(874,-123.050003,-186.399994,0.530000,0.000000,0.000000,30.180000);
obj=CreateDynamicObject(19993,171.437195,-152.799896,5.759300,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,1453,"break_farm","CJ_HAY");
CreateDynamicObject(874,229.000000,-18.690001,0.260000,0.000000,0.000000,-53.099998);
CreateDynamicObject(765,-225.929993,44.970001,1.770000,0.000000,0.000000,0.000000);
CreateDynamicObject(1292,-229.699997,45.540001,2.160000,0.000000,90.000000,-160.619995);
CreateDynamicObject(1294,227.029999,-66.110001,0.710000,87.860001,90.000000,-46.930000);
CreateDynamicObject(874,-235.130005,62.049999,1.320000,0.000000,0.000000,0.000000);
CreateDynamicObject(1308,240.220001,41.360001,1.450000,0.140000,90.000000,-219.639999);
CreateDynamicObject(874,181.639999,-166.250000,-0.040000,0.000000,0.000000,-13.620000);
CreateDynamicObject(3594,-167.330002,-181.330002,1.580000,0.000000,0.000000,26.639999);
CreateDynamicObject(3593,234.429993,-77.290001,0.890000,0.000000,0.000000,-38.160000);
CreateDynamicObject(3593,240.567627,-56.084656,1.048544,0.000000,0.000000,-10.199999);
CreateDynamicObject(1219,240.155151,-60.121407,1.215041,22.100000,0.000000,-5.000000);
CreateDynamicObject(1355,243.665009,-53.904537,0.766586,0.000000,0.000000,91.199997);
CreateDynamicObject(2673,245.740219,-43.729069,0.666830,0.000000,0.000000,-146.300018);
CreateDynamicObject(1355,244.552536,-55.892742,0.766586,0.000000,0.000000,90.699989);
CreateDynamicObject(2673,244.132523,-57.729435,0.666830,0.000000,0.000000,56.799923);
obj=CreateDynamicObject(2670,245.259796,-53.582005,0.669699,0.000000,0.000000,-31.800009);
SetDynamicObjectMaterial(obj,2,65535,"none","none",16777215);
CreateDynamicObject(16367,-224.639999,113.099998,2.870000,0.000000,0.000000,86.220001);
CreateDynamicObject(1429,246.039230,-52.762928,0.816303,89.200043,-12.200001,-0.600002);
CreateDynamicObject(1355,245.381042,-56.076298,0.766586,0.000000,0.000000,0.000000);
CreateDynamicObject(2673,247.132095,-49.738045,0.666830,0.000000,0.000000,157.499985);
CreateDynamicObject(1440,246.932724,-51.064838,1.082533,0.000000,0.000000,178.399948);
CreateDynamicObject(2673,245.004440,-61.146580,0.666830,0.000000,0.000000,140.199921);
obj=CreateDynamicObject(2670,246.825256,-54.716324,0.669699,0.000000,0.000000,-156.199997);
SetDynamicObjectMaterial(obj,3,65535,"none","none",16777215);
SetDynamicObjectMaterial(obj,2,65535,"none","none",16777215);
SetDynamicObjectMaterial(obj,1,65535,"none","none",16777215);
CreateDynamicObject(2120,247.188950,-53.111809,0.953647,1.700000,85.899994,-65.700073);
CreateDynamicObject(1265,248.313538,-50.447433,0.976008,0.000000,0.000000,119.900017);
obj=CreateDynamicObject(2670,247.000687,-58.038029,0.669699,0.000000,0.000000,-156.199997);
SetDynamicObjectMaterial(obj,0,65535,"none","none",-16777217);
CreateDynamicObject(933,251.008148,-42.946335,0.578227,0.000000,0.000000,0.000000);
CreateDynamicObject(1440,249.761627,-51.143856,1.082533,0.000000,0.000000,178.399948);
CreateDynamicObject(1219,249.517899,-53.697544,1.866576,-91.600029,0.000000,-90.299934);
CreateDynamicObject(2673,249.584702,-57.018726,0.666830,0.000000,0.000000,20.399963);
CreateDynamicObject(1450,251.232269,-50.307037,1.145468,0.000000,0.000000,-173.200073);
obj=CreateDynamicObject(12845,249.921906,-56.539101,2.664099,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,5,955,"cj_ext_vend","CJ_SPRUNK_DIRTY",0);
SetDynamicObjectMaterial(obj,4,19480,"signsurf","sign",0);
SetDynamicObjectMaterial(obj,3,6993,"vgncircir","gasstopwall1_128",-3342337);
SetDynamicObjectMaterial(obj,2,12923,"sw_block05","sw_woodslats1",0);
CreateDynamicObject(1220,250.403412,-55.180466,0.892425,0.000000,0.000000,0.000000);
CreateDynamicObject(1349,248.372406,-63.968529,0.941920,-85.199974,25.099998,0.000000);
CreateDynamicObject(1265,252.282867,-50.101192,0.976008,0.000000,0.000000,123.800003);
CreateDynamicObject(1220,251.543396,-55.180466,0.892425,0.000000,0.000000,0.000000);
CreateDynamicObject(1440,252.550568,-51.221760,1.082533,0.000000,0.000000,178.399948);
CreateDynamicObject(874,149.970001,-209.839996,0.220000,0.000000,0.000000,46.619999);
CreateDynamicObject(2673,253.290604,-50.114693,0.666830,0.000000,0.000000,86.500000);
CreateDynamicObject(1265,246.277832,-79.318192,0.959096,0.000000,-0.299999,158.399994);
CreateDynamicObject(2673,252.749435,-59.816280,0.666830,0.000000,0.000000,0.000000);
CreateDynamicObject(2673,253.733780,-56.126461,0.666830,0.000000,0.000000,20.399963);
CreateDynamicObject(1299,256.299805,-43.202808,0.089943,0.000000,0.000000,0.000000);
CreateDynamicObject(1265,255.732162,-46.665421,0.976008,0.000000,-0.299999,158.399994);
CreateDynamicObject(1265,256.181274,-45.841732,0.893129,0.000000,-0.299999,170.799957);
obj=CreateDynamicObject(2670,253.861038,-57.847534,0.669699,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,65535,"none","none",-16777217);
obj=CreateDynamicObject(2670,252.780380,-62.593056,0.669699,0.000000,0.000000,-156.199997);
SetDynamicObjectMaterial(obj,0,65535,"none","none",-16777217);
obj=CreateDynamicObject(19327,255.098907,-52.329014,2.429201,0.000000,-89.099991,0.000000);
SetDynamicObjectMaterial(obj,0,17577,"ganton02_lae2","greenbot2_LAe2",0);
CreateDynamicObject(1333,247.786545,-80.789558,1.132534,-87.299995,0.000000,-2.200000);
obj=CreateDynamicObject(2670,255.126907,-54.206043,0.669699,0.000000,0.000000,144.300018);
SetDynamicObjectMaterial(obj,0,65535,"none","none",-16777217);
CreateDynamicObject(1265,248.729019,-79.320694,0.947158,0.000000,-0.299999,-142.699982);
obj=CreateDynamicObject(1415,257.308411,-45.681595,0.709650,0.000000,0.000000,-90.000023);
SetDynamicObjectMaterial(obj,0,65535,"none","none",-16777217);
CreateDynamicObject(1265,257.293640,-47.673145,1.115848,0.000000,-0.299999,170.799957);
obj=CreateDynamicObject(1415,257.308411,-47.961590,0.709650,0.000000,0.000000,-90.000023);
SetDynamicObjectMaterial(obj,0,65535,"none","none",16777215);
CreateDynamicObject(1265,257.282135,-48.238602,0.965431,0.000000,-0.299999,170.799957);
obj=CreateDynamicObject(19327,254.549377,-61.839001,4.312133,0.000000,6.299998,0.000000);
SetDynamicObjectMaterial(obj,0,2420,"cj_ff_acc1","CJ_OPEN",0);
CreateDynamicObject(2673,255.297562,-60.055729,0.666830,0.000000,0.000000,86.500000);
CreateDynamicObject(3594,260.254089,-41.792133,1.651697,0.000000,0.000000,0.000000);
CreateDynamicObject(2673,256.226685,-63.538910,0.666830,0.000000,0.000000,86.500000);
obj=CreateDynamicObject(19327,256.659729,-61.859024,2.426524,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,4212,"nitewin_lan","neonwin1",0);
CreateDynamicObject(1300,256.770691,-62.459816,0.924977,-90.300011,162.499878,0.299999);
CreateDynamicObject(874,-200.850006,-174.110001,0.930000,0.000000,0.000000,20.340000);
CreateDynamicObject(3594,261.792145,-64.393356,1.143164,0.199999,0.000000,79.599998);
CreateDynamicObject(3594,181.960007,-200.940002,1.060000,0.000000,0.000000,-116.160004);
CreateDynamicObject(874,-269.799988,76.879997,-0.040000,0.000000,0.000000,-8.580000);
CreateDynamicObject(3593,-29.232000,-282.787292,4.762700,0.000000,0.000000,-132.779999);
CreateDynamicObject(874,-236.889999,157.429993,2.110000,0.000000,0.000000,-38.040001);
CreateDynamicObject(2977,-93.781769,-271.114838,15.699499,0.000000,0.000000,0.000000);
CreateDynamicObject(2977,-99.890106,-270.021973,15.433341,0.000000,0.000000,0.000000);
CreateDynamicObject(2977,-96.603477,-271.519714,15.780241,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19993,286.178986,40.774799,4.240200,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,1453,"break_farm","CJ_HAY",0);
CreateDynamicObject(2977,-104.039932,-269.773193,15.374622,0.000000,0.000000,0.000000);
CreateDynamicObject(2977,-98.754349,-272.428864,15.962249,0.000000,0.000000,0.000000);
CreateDynamicObject(2977,-95.846931,-273.508392,16.178091,0.000000,0.000000,0.000000);
CreateDynamicObject(2977,-101.382164,-272.189972,15.914453,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,-290.779999,7.150000,0.520000,0.000000,0.000000,39.660000);
CreateDynamicObject(2977,-106.637306,-270.811035,15.638782,0.000000,0.000000,0.000000);
CreateDynamicObject(2977,-103.429657,-272.210541,15.918615,0.000000,0.000000,0.000000);
CreateDynamicObject(2977,-105.107819,-271.763275,15.829172,0.000000,0.000000,0.000000);
CreateDynamicObject(734,292.750305,34.269199,1.495700,0.000000,0.000000,-64.320000);
CreateDynamicObject(874,-193.357117,224.319901,10.540000,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,-194.953003,224.173401,11.740000,0.000000,0.000000,186.776901);
CreateDynamicObject(1222,192.006195,-227.139008,1.016500,0.000000,0.000000,0.000000);
CreateDynamicObject(1441,193.861618,-226.030243,1.413200,0.000000,0.000000,90.000000);
CreateDynamicObject(1308,188.765411,-231.179642,0.567900,40.000000,0.000000,45.000000);
CreateDynamicObject(1431,196.933060,-224.943909,1.280820,0.000000,0.000000,0.000000);
CreateDynamicObject(1222,191.883896,-229.883606,0.996500,0.000000,90.000000,35.832100);
CreateDynamicObject(1498,192.892151,-229.148697,0.775800,0.000000,0.000000,90.000000);
CreateDynamicObject(2685,277.872101,1863.715088,9.628494,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(11707,278.310394,1863.675293,9.128833,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,2,18757,"vcinteriors","dts_elevator_ceiling",0);
SetDynamicObjectMaterial(obj,1,18757,"vcinteriors","dts_elevator_ceiling",0);
SetDynamicObjectMaterial(obj,0,18757,"vcinteriors","dts_elevator_ceiling",0);
CreateDynamicObject(2523,277.379211,1863.230103,7.739999,0.000000,0.000000,0.399995);
obj=CreateDynamicObject(1800,277.753357,1863.301514,7.650000,0.000000,0.000000,-90.699974);
SetDynamicObjectMaterial(obj,1,19513,"whitephone","whitephone",0);
CreateDynamicObject(2844,279.600037,1862.610352,8.409998,0.000000,0.000000,0.000000);
CreateDynamicObject(2690,273.410004,1864.380005,9.029999,0.000000,0.000000,180.000000);
obj=CreateDynamicObject(1800,277.771454,1858.230591,7.650000,0.000000,0.000000,-90.699974);
SetDynamicObjectMaterial(obj,1,19513,"whitephone","whitephone",0);
CreateDynamicObject(2709,272.559998,1863.349976,9.770000,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(2146,279.809998,1864.739990,8.239999,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,1,18757,"vcinteriors","dts_elevator_ceiling",0);
CreateDynamicObject(11738,274.258545,1857.048584,9.699444,0.000000,0.000000,-77.999977);
obj=CreateDynamicObject(19327,281.238098,1859.302856,9.678538,0.000000,0.000000,-89.899963);
SetDynamicObjectMaterial(obj,0,14599,"paperchasebits","sign_firstaid",0);
CreateDynamicObject(2709,272.089996,1864.430054,9.739999,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(2164,272.410004,1864.280029,7.760000,0.000000,0.000000,180.000000);
SetDynamicObjectMaterial(obj,1,19853,"mihouse1","yellowwall1",0);
obj=CreateDynamicObject(2163,273.709961,1857.199951,9.380000,0.000000,0.000000,-89.900063);
SetDynamicObjectMaterial(obj,0,19853,"mihouse1","yellowwall1",0);
obj=CreateDynamicObject(2200,271.170013,1863.619995,7.760000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,19853,"mihouse1","yellowwall1",0);
CreateDynamicObject(19836,273.245178,1856.484863,8.678116,0.000000,0.000000,0.000000);
CreateDynamicObject(19836,272.985352,1856.314819,8.678116,0.000000,0.000000,-89.899986);
obj=CreateDynamicObject(2200,274.060211,1855.770386,7.760000,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,1,19853,"mihouse1","yellowwall1",0);
CreateDynamicObject(1369,271.440002,1866.119995,8.359999,0.000000,0.000000,90.000000);
CreateDynamicObject(11716,272.833344,1855.706909,8.649344,0.000000,0.000000,-58.999969);
CreateDynamicObject(11716,272.931305,1855.544434,8.649344,0.000000,0.000000,-81.199928);
obj=CreateDynamicObject(2146,282.359985,1865.900024,8.239999,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,18757,"vcinteriors","dts_elevator_ceiling",0);
CreateDynamicObject(3394,273.140289,1855.249756,7.750000,0.000000,0.000000,0.000000);
CreateDynamicObject(11736,272.843567,1854.499512,8.676493,0.000000,0.000000,-13.800002);
obj=CreateDynamicObject(19372,268.737793,1864.054199,9.093159,0.000000,0.000000,90.199959);
SetDynamicObjectMaterial(obj,0,13598,"destructo","sjmfnce",0);
CreateDynamicObject(874,276.060120,1856.322144,16.603960,0.000000,0.000000,350.660004);
CreateDynamicObject(734,271.242737,1864.820557,15.980000,0.000000,0.000000,320.714233);
obj=CreateDynamicObject(2200,274.060211,1853.560059,7.760000,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,1,19853,"mihouse1","yellowwall1",0);
obj=CreateDynamicObject(19456,273.823517,1853.386475,8.714750,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,3653,"beachapts_lax","eastwall4_LAe2",0);
obj=CreateDynamicObject(19903,280.907928,1854.254517,7.642773,0.000000,0.000000,178.799927);
SetDynamicObjectMaterial(obj,4,18757,"vcinteriors","dts_elevator_ceiling",0);
SetDynamicObjectMaterial(obj,1,18757,"vcinteriors","dts_elevator_ceiling",0);
obj=CreateDynamicObject(1800,277.709320,1853.139282,7.650000,0.000000,0.000000,-90.699974);
SetDynamicObjectMaterial(obj,1,19513,"whitephone","whitephone",0);
CreateDynamicObject(3383,269.200134,1855.659424,7.750000,0.000000,0.000000,180.000000);
CreateDynamicObject(2897,269.149963,1855.159058,9.069999,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(2894,266.725128,1862.900635,8.528741,0.000000,0.000000,-80.800041);
SetDynamicObjectMaterial(obj,0,17511,"stadium_lae2","ticketsnprice_lae2",0);
CreateDynamicObject(19944,271.202179,1870.129517,8.707261,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(2146,271.189911,1870.119629,8.239999,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,18757,"vcinteriors","dts_elevator_ceiling",0);
obj=CreateDynamicObject(1999,266.670532,1862.942261,7.724274,0.000000,0.000000,-90.299995);
SetDynamicObjectMaterial(obj,2,18835,"mickytextures","whiteforletters",0);
SetDynamicObjectMaterial(obj,1,18996,"mattextures","sampwhite",0);
CreateDynamicObject(3383,269.180084,1854.549683,7.760000,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19327,271.801575,1852.338135,9.678538,0.000000,0.000000,179.900116);
SetDynamicObjectMaterial(obj,0,16640,"a51","a51_monitors",0);
obj=CreateDynamicObject(1806,266.193298,1858.474854,7.750000,0.000000,0.000000,150.000000);
SetDynamicObjectMaterial(obj,1,19853,"mihouse1","yellowwall1",0);
SetDynamicObjectMaterial(obj,0,19058,"xmasboxes","silk8-128x128",0);
obj=CreateDynamicObject(19327,265.648712,1863.738647,9.308531,0.000000,0.000000,0.000027);
SetDynamicObjectMaterial(obj,0,14842,"genintintpolicea","cop_notice",0);
obj=CreateDynamicObject(1806,265.324615,1863.111572,7.750000,0.000000,0.000000,-122.900009);
SetDynamicObjectMaterial(obj,1,19853,"mihouse1","yellowwall1",0);
SetDynamicObjectMaterial(obj,0,19058,"xmasboxes","silk8-128x128",0);
CreateDynamicObject(8843,285.750000,1869.349976,7.760000,0.000000,0.000000,-90.000000);
CreateDynamicObject(11738,264.452820,1862.026123,9.213241,0.000000,0.000000,93.900047);
CreateDynamicObject(19998,264.464996,1862.755371,8.836600,0.000000,0.000000,0.000000);
CreateDynamicObject(11738,264.422791,1862.034302,8.773239,0.000000,0.000000,0.000000);
CreateDynamicObject(19998,264.464996,1862.865479,8.836600,0.000000,0.000000,0.000000);
CreateDynamicObject(19998,264.464996,1862.975586,8.836600,0.000000,0.000000,0.000000);
CreateDynamicObject(11738,264.422791,1862.464600,8.773239,0.000000,0.000000,93.900047);
CreateDynamicObject(1644,264.382782,1861.120239,8.858551,90.700020,85.299995,0.000000);
CreateDynamicObject(2709,264.380066,1860.689575,9.300002,0.000000,0.000000,0.000000);
CreateDynamicObject(1644,264.395935,1863.346558,9.315814,90.700020,39.999996,0.000000);
CreateDynamicObject(11736,264.404816,1860.275879,8.746495,0.000000,0.000000,2.599999);
CreateDynamicObject(19823,264.293793,1863.324463,8.712648,0.000000,0.000000,90.099976);
obj=CreateDynamicObject(2164,264.221191,1862.277344,7.760000,0.000000,0.000000,90.399940);
SetDynamicObjectMaterial(obj,1,19853,"mihouse1","yellowwall1",0);
SetDynamicObjectMaterial(obj,0,7979,"vegasairprtland","blackshadow3",0);
CreateDynamicObject(3397,264.830109,1857.819946,7.760000,0.000000,0.000000,180.000000);
obj=CreateDynamicObject(2164,264.233337,1860.526367,7.760000,0.000000,0.000000,90.399940);
SetDynamicObjectMaterial(obj,1,19853,"mihouse1","yellowwall1",0);
CreateDynamicObject(1721,276.525269,1874.529419,7.743508,0.000000,0.000000,-177.799942);
obj=CreateDynamicObject(19327,282.883789,1873.096924,9.308536,0.000000,0.000000,-89.899963);
SetDynamicObjectMaterial(obj,0,14853,"gen_pol_vegas","mp_cop_pinboard",0);
CreateDynamicObject(1721,277.195282,1874.556519,7.743508,0.000000,0.000000,-177.799942);
CreateDynamicObject(1721,277.884979,1874.583496,7.743508,0.000000,0.000000,-177.799942);
CreateDynamicObject(11727,263.502106,1862.476685,10.914500,0.000000,0.000000,-90.000000);
CreateDynamicObject(1721,278.594452,1874.610352,7.743508,0.000000,0.000000,-177.799942);
CreateDynamicObject(1721,279.293427,1874.636353,7.743508,0.000000,0.000000,-177.799942);
obj=CreateDynamicObject(2163,263.839996,1857.319946,9.380000,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,0,19853,"mihouse1","yellowwall1",0);
CreateDynamicObject(1721,280.002686,1874.662964,7.743508,0.000000,0.000000,-177.799942);
CreateDynamicObject(1721,280.692108,1874.689209,7.743508,0.000000,0.000000,-177.799942);
CreateDynamicObject(11727,263.512085,1857.489014,10.914500,0.000000,0.000000,-90.000000);
CreateDynamicObject(3395,264.863892,1854.259155,7.759999,0.000000,0.000000,-178.900101);
CreateDynamicObject(11727,263.498413,1867.753540,10.914500,0.000000,0.000000,-90.000000);
CreateDynamicObject(3594,265.140015,1855.979980,17.190001,0.000000,0.000000,45.000000);
CreateDynamicObject(1487,261.869995,1859.920044,8.739999,0.000000,90.000000,55.000000);
CreateDynamicObject(1668,261.820007,1864.750000,8.840000,0.000000,0.000000,0.000000);
CreateDynamicObject(1509,261.450012,1860.380005,8.859999,0.000000,0.000000,-55.000000);
CreateDynamicObject(1487,261.220001,1859.719971,8.859999,0.000000,0.000000,55.000000);

obj=CreateDynamicObject(16152,246.4547, 1866.6406, 7.7700,0.000000,0.000000,0.000000,-1,-1,-1,50,50,-1,1);
SetDynamicObjectMaterial(obj,3,6351,"rodeo02_law2","woodboards1",0);
SetDynamicObjectMaterial(obj,0,14569,"traidman","chinese8",0);

obj=CreateDynamicObject(16152,261.700012,1857.739990,7.750000,0.000000,0.000000,0.000000,-1,-1,-1,50,50,-1,1);
SetDynamicObjectMaterial(obj,3,6351,"rodeo02_law2","woodboards1",0);
SetDynamicObjectMaterial(obj,0,14569,"traidman","chinese8",0);
CreateDynamicObject(1510,261.350006,1864.699951,8.699999,0.000000,0.000000,0.000000);
CreateDynamicObject(2353,261.910004,1866.819946,8.739999,-25.500000,23.000000,76.470001);
CreateDynamicObject(1667,261.279999,1864.979980,8.779999,0.000000,0.000000,0.000000);
CreateDynamicObject(19167,260.829987,1860.069946,8.680000,0.000000,0.000000,45.000000);
CreateDynamicObject(1510,260.720001,1862.380005,8.699999,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(16152,261.709991,1867.030029,7.750000,0.000000,0.000000,0.000000,-1,-1,-1,50,50,-1,1);
SetDynamicObjectMaterial(obj,3,6351,"rodeo02_law2","woodboards1",0);
SetDynamicObjectMaterial(obj,0,14569,"traidman","chinese8",0);
CreateDynamicObject(874,290.959991,1859.910034,16.608000,0.000000,0.000000,350.660004);
CreateDynamicObject(1509,261.170013,1857.489990,8.859999,0.000000,0.000000,90.000000);
CreateDynamicObject(11727,263.507294,1852.338257,10.914500,0.000000,0.000000,-90.000000);
CreateDynamicObject(1544,261.450012,1867.280029,8.680000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,263.220001,1857.050049,17.987801,0.000000,0.000000,347.019989);
CreateDynamicObject(8843,291.450012,1855.449951,6.840000,0.000000,0.000000,-90.000000);
CreateDynamicObject(1510,260.290009,1860.020020,8.699999,0.000000,0.000000,0.000000);
CreateDynamicObject(1512,261.829987,1869.209961,8.859999,0.000000,0.000000,45.000000);
CreateDynamicObject(2218,261.989990,1869.520020,8.739999,-25.500000,23.000000,76.470001);
CreateDynamicObject(1512,260.000000,1860.199951,8.859999,0.000000,0.000000,45.000000);
CreateDynamicObject(1509,260.230011,1857.979980,8.859999,0.000000,0.000000,-15.000000);
CreateDynamicObject(2220,261.390015,1869.109985,8.739999,-25.500000,23.000000,76.470001);
obj=CreateDynamicObject(16152,259.850006,1860.069946,7.750000,0.000000,0.000000,180.000000,-1,-1,-1,50,50,-1,1);
SetDynamicObjectMaterial(obj,3,6351,"rodeo02_law2","woodboards1",0);
SetDynamicObjectMaterial(obj,0,14569,"traidman","chinese8",0);
CreateDynamicObject(3594,263.570007,1854.800049,18.240000,-5.000000,3.000000,96.279999);
CreateDynamicObject(1546,260.489990,1867.290039,8.760000,0.000000,0.000000,0.000000);
CreateDynamicObject(2350,262.459991,1852.000000,8.079999,0.000000,0.000000,45.000000);
CreateDynamicObject(1544,259.950012,1866.699951,8.680000,0.000000,0.000000,95.000000);
CreateDynamicObject(1543,259.989990,1867.260010,8.680000,0.000000,0.000000,-95.000000);
CreateDynamicObject(3594,262.720001,1853.770020,17.190001,0.000000,0.000000,-130.000000);
CreateDynamicObject(1543,259.540009,1857.439941,8.680000,0.000000,0.000000,-95.000000);
obj=CreateDynamicObject(19429,260.670013,1854.170044,8.560000,90.000000,90.000000,0.000000);
SetDynamicObjectMaterial(obj,0,18800,"mroadhelix1","road1-3",0);
CreateDynamicObject(1458,270.619995,1876.790039,16.860001,0.000000,0.000000,205.759995);
CreateDynamicObject(2644,261.290009,1852.630005,8.170000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,279.220001,1878.280029,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(2350,260.320007,1853.050049,8.079999,0.000000,0.000000,-45.000000);
obj=CreateDynamicObject(16152,259.850006,1869.359985,7.750000,0.000000,0.000000,180.000000,-1,-1,-1,50,50,-1,1);
SetDynamicObjectMaterial(obj,3,6351,"rodeo02_law2","woodboards1",0);
SetDynamicObjectMaterial(obj,0,14569,"traidman","chinese8",0);
CreateDynamicObject(874,290.910004,1872.109985,16.505989,0.000000,0.000000,350.660004);
CreateDynamicObject(2644,261.239990,1850.750000,8.170000,0.000000,0.000000,0.000000);
CreateDynamicObject(11727,260.141113,1872.808960,10.914500,0.000000,0.000000,0.000000);
CreateDynamicObject(2674,257.440002,1856.300049,7.769999,0.000000,0.000000,0.000000);
CreateDynamicObject(2350,260.140015,1850.290039,8.079999,0.000000,0.000000,15.000000);
CreateDynamicObject(874,290.989990,1848.910034,16.505989,0.000000,0.000000,350.660004);
CreateDynamicObject(3286,278.700012,1841.459961,21.150000,0.000000,0.000000,180.000000);
CreateDynamicObject(3594,289.250000,1879.930054,17.209999,0.000000,0.000000,25.000000);
CreateDynamicObject(2611,256.949188,1847.901978,9.563400,0.000000,2.000000,-90.000000);
CreateDynamicObject(3095,268.970001,1883.760010,16.080000,0.000000,0.000000,0.000000);
CreateDynamicObject(1544,252.559998,1864.589966,8.680000,0.000000,0.000000,95.000000);
CreateDynamicObject(1487,252.619995,1866.439941,8.859999,0.000000,0.000000,55.000000);
obj=CreateDynamicObject(16152,252.589996,1866.729980,7.769999,0.000000,0.000000,0.000000,-1,-1,-1,50,50,-1,1);
SetDynamicObjectMaterial(obj,3,6351,"rodeo02_law2","woodboards1",0);
SetDynamicObjectMaterial(obj,0,14569,"traidman","chinese8",0);
CreateDynamicObject(1487,252.529999,1867.050049,8.859999,0.000000,0.000000,0.000000);
CreateDynamicObject(1543,252.059998,1864.140015,8.680000,0.000000,0.000000,-95.000000);
CreateDynamicObject(2848,252.070007,1866.699951,8.699999,0.000000,0.000000,90.000000);
CreateDynamicObject(11727,255.904602,1875.735596,11.621500,0.000000,0.000000,-90.000000);
obj=CreateDynamicObject(19429,251.559998,1863.170044,8.560000,90.000000,90.000000,0.000000);
SetDynamicObjectMaterial(obj,0,18800,"mroadhelix1","road1-3",0);
CreateDynamicObject(11714,256.977692,1845.547119,9.006799,0.000000,0.000000,0.000000);
CreateDynamicObject(1543,251.250000,1864.630005,8.680000,0.000000,0.000000,0.000000);
CreateDynamicObject(11727,255.899796,1845.634766,10.837800,0.000000,0.000000,-90.000000);
obj=CreateDynamicObject(19451,257.078491,1843.943237,8.894700,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,19517,"noncolored","gen_white",0);
CreateDynamicObject(1546,251.259995,1869.209961,8.779999,0.000000,0.000000,0.000000);
CreateDynamicObject(1546,251.110001,1868.719971,8.779999,0.000000,0.000000,0.000000);
CreateDynamicObject(19435,284.309814,1836.252563,8.596899,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(16152,250.729996,1869.069946,7.769999,0.000000,0.000000,180.000000,-1,-1,-1,50,50,-1,1);
SetDynamicObjectMaterial(obj,3,6351,"rodeo02_law2","woodboards1",0);
SetDynamicObjectMaterial(obj,0,14569,"traidman","chinese8",0);
CreateDynamicObject(11727,285.292297,1836.151001,9.257100,0.000000,0.000000,0.000000);
CreateDynamicObject(3286,278.670013,1837.239990,21.150000,0.000000,0.000000,180.000000);
obj=CreateDynamicObject(19429,251.539993,1872.650024,8.560000,90.000000,90.000000,0.000000);
SetDynamicObjectMaterial(obj,0,18800,"mroadhelix1","road1-3",0);
obj=CreateDynamicObject(19327,287.024109,1836.139771,8.484255,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,2047,"cj_ammo_posters","CJ_Coltposter",0);
CreateDynamicObject(19435,283.416901,1835.070313,6.938499,0.000000,90.000000,90.000000);
obj=CreateDynamicObject(3031,284.291290,1835.131592,8.480520,0.000000,0.000000,298.281311);
SetDynamicObjectMaterial(obj,0,13295,"ce_terminal","cabin3",0);
CreateDynamicObject(874,263.480011,1837.699951,16.199900,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(19475,283.469452,1834.268555,8.407266,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,2059,"cj_ammo2","CJ_gunbook2",0);
CreateDynamicObject(874,291.100006,1838.290039,16.608000,0.000000,0.000000,350.660004);
CreateDynamicObject(11727,288.928894,1836.151001,9.257100,0.000000,0.000000,0.000000);
CreateDynamicObject(19816,283.600677,1834.309204,7.299799,0.000000,0.000000,0.000000);
CreateDynamicObject(19621,286.575012,1835.173340,8.030599,0.000000,0.000000,-25.000000);
CreateDynamicObject(3594,292.670013,1883.930054,17.209999,0.000000,0.000000,180.000000);
CreateDynamicObject(1328,255.368195,1842.661499,8.276399,0.000000,0.000000,0.000000);
CreateDynamicObject(19816,283.599640,1834.127930,7.299799,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(1359,255.342194,1842.638184,8.326900,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,65535,"none","none",16777215);
CreateDynamicObject(19942,285.827789,1834.677734,8.031399,0.000000,0.000000,25.000000);
CreateDynamicObject(11727,283.449005,1833.919067,9.257100,0.000000,0.000000,90.000000);
CreateDynamicObject(1242,287.180328,1835.114868,8.093000,0.000000,0.000000,219.629700);
obj=CreateDynamicObject(937,286.493011,1834.862305,7.456200,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,3979,"civic01_lan","sl_laglasswall1",0);
SetDynamicObjectMaterial(obj,0,4828,"airport3_las","brwall_128",0);
CreateDynamicObject(19816,283.570251,1833.911865,7.299799,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19893,286.118195,1834.597168,7.930399,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,14599,"paperchasebits","ab_blueprint3",0);
CreateDynamicObject(19463,289.996277,1836.244873,8.596870,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(19475,283.469452,1833.728027,8.407267,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,2059,"cj_ammo2","CJ_gunbook1",0);
obj=CreateDynamicObject(1242,287.674194,1835.108398,8.093000,0.000000,0.000000,219.629700);
SetDynamicObjectMaterial(obj,0,18028,"cj_bar2","GB_nastybar02",0);
CreateDynamicObject(2674,247.800003,1861.390015,7.769999,0.000000,0.000000,90.000000);
CreateDynamicObject(19816,283.590759,1833.710693,7.299799,0.000000,0.000000,0.000000);
CreateDynamicObject(3017,287.227112,1834.543701,7.942999,0.000000,0.000000,0.000000);
CreateDynamicObject(1650,283.851715,1833.347534,7.343900,0.000000,0.000000,248.475296);
obj=CreateDynamicObject(937,288.381989,1834.862305,7.456200,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,3979,"civic01_lan","sl_laglasswall1",0);
SetDynamicObjectMaterial(obj,0,4828,"airport3_las","brwall_128",0);
CreateDynamicObject(3013,288.834503,1834.900757,8.063699,0.000000,0.000000,50.000000);
obj=CreateDynamicObject(19475,254.308365,1842.205322,9.838030,0.000000,0.000000,89.999992);
//SetDynamicObjectMaterialText(0,"?????? ??????????
 //?????? ? ???????",120,"Calibri",50,0,-1442840576,-1427839772,1);
obj=CreateDynamicObject(19475,254.308365,1842.205322,9.148029,0.000000,0.000000,89.999992);
//SetDynamicObjectMaterialText(0,"????????? ????????
 //?????? ??????!
// ?????????? ? ?????????.",120,"Calibri",40,0,-1442840576,-1427839772,1);
obj=CreateDynamicObject(19475,254.308365,1842.205322,8.478027,0.000000,0.000000,89.999992);
//SetDynamicObjectMaterialText(0,"????? ?????!
// ??????",120,"Calibri",50,0,-1442840576,-1427839772,1);
CreateDynamicObject(19348,290.380493,1835.301025,8.682900,0.000000,180.000000,0.000000);
CreateDynamicObject(19631,288.464203,1834.423462,7.970099,-1.000000,90.000000,45.000000);
CreateDynamicObject(19514,290.398987,1835.255127,8.663599,-25.000000,-90.000000,202.910706);
CreateDynamicObject(19515,290.407104,1835.266724,8.347200,0.000000,-90.000000,202.910706);
CreateDynamicObject(3014,283.831757,1832.797974,7.241600,0.000000,0.000000,-90.000000);
CreateDynamicObject(19348,290.380493,1835.301025,6.960700,0.000000,0.000000,0.000000);
CreateDynamicObject(355,283.786102,1832.724365,7.775000,-25.000000,-90.000000,90.000000);
CreateDynamicObject(19472,290.450012,1835.146362,8.583600,0.000000,0.000000,296.081085);
CreateDynamicObject(3594,289.459991,1887.780029,17.209999,0.000000,0.000000,-25.000000);
CreateDynamicObject(2985,291.634003,1835.638550,7.038000,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19475,253.498383,1842.205322,9.828036,0.000000,0.000000,89.999992);
//SetDynamicObjectMaterialText(0,"?????
// ?????? ????????
// ??????",120,"Calibri",43,0,-1442840576,-1427839772,1);
CreateDynamicObject(11727,292.737915,1836.151001,9.257069,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19475,253.498383,1842.205322,9.138031,0.000000,0.000000,89.999992);
//SetDynamicObjectMaterialText(0,"?????? ?????
// ????????!
// ????? ???????? ? ???????",120,"Calibri",43,0,-1442840576,-1427839772,1);
CreateDynamicObject(19435,283.452911,1832.379395,6.938499,0.000000,90.000000,90.000000);
obj=CreateDynamicObject(19475,253.498398,1842.205322,8.478027,0.000000,0.000000,89.999992);
//SetDynamicObjectMaterialText(0,"?????? ??????!
// ??????? ? ????????",120,"Calibri",50,0,-1442840576,-1427839772,1);
CreateDynamicObject(3014,289.731018,1834.344849,7.241600,0.000000,0.000000,-90.000000);
CreateDynamicObject(874,250.419998,1874.599976,18.740999,0.000000,0.000000,326.309998);
CreateDynamicObject(1224,250.389999,1877.270020,8.359999,0.000000,0.000000,0.000000);


obj=CreateDynamicObject(3077,252.942505,1842.146851,9.428000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,18773,"tunnelsections","stonewall4",16777215);
//SetDynamicObjectMaterialText(obj,0,"{FFFFFF}????? ???????:
//{FF8000} TheEnd",90,"Impact",25,0,-1,0,1);

obj=CreateDynamicObject(3077,252.942505,1842.136841,9.428000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,18773,"tunnelsections","stonewall4",16777215);
SetDynamicObjectMaterial(obj,0,19962,"samproadsigns","streetsign",0);
CreateDynamicObject(19815,283.457611,1831.779907,8.792300,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(3077,252.950699,1842.158203,7.212399,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,18773,"tunnelsections","stonewall4",0);
CreateDynamicObject(1544,246.619995,1868.709961,8.680000,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(936,288.740509,1833.488770,7.456299,0.000000,0.000000,-90.000000);
SetDynamicObjectMaterial(obj,1,3979,"civic01_lan","sl_laglasswall1",0);
SetDynamicObjectMaterial(obj,0,4828,"airport3_las","brwall_128",0);
obj=CreateDynamicObject(19475,252.588379,1842.205322,9.828034,0.000000,0.000000,89.999992);
//SetDynamicObjectMaterialText(0,"?????????!
// ?????????? ?????????? ??????!
 //???????? ????, ???? ?????????!",120,"Calibri",43,0,-1442840576,-1427839772,1);
CreateDynamicObject(3594,249.889999,1873.500000,20.049999,0.000000,0.000000,352.670013);
CreateDynamicObject(19843,288.781616,1833.337158,7.930099,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19475,252.588364,1842.205322,9.118030,0.000000,0.000000,89.999992);
//SetDynamicObjectMaterialText(0,"????
// ??????
// ???????? ??????? ??????!",120,"Calibri",40,0,-1442840576,-1427839772,1);
obj=CreateDynamicObject(19475,252.588470,1842.205322,8.478027,0.000000,0.000000,89.999992);
//SetDynamicObjectMaterialText(0,"????? ???????
// ???? ??????.
// ????",120,"Calibri",45,0,-1442840576,-1427839772,1);
CreateDynamicObject(19812,284.027008,1831.740479,7.442920,0.000000,0.000000,95.722076);
CreateDynamicObject(19463,283.333405,1831.500854,8.596899,0.000000,0.000000,0.000000);
CreateDynamicObject(1544,246.529999,1869.209961,8.680000,0.000000,0.000000,-95.000000);
obj=CreateDynamicObject(19429,245.589996,1863.089966,8.560000,90.000000,90.000000,0.000000);
SetDynamicObjectMaterial(obj,0,18800,"mroadhelix1","road1-3",0);
CreateDynamicObject(2830,246.000000,1868.949951,8.699999,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(19475,251.718414,1842.205322,9.818034,0.000000,0.000000,89.999992);
//SetDynamicObjectMaterialText(0,"???? ???????
// ??????",120,"Calibri",50,0,-1442840576,-1427839772,1);
obj=CreateDynamicObject(19475,251.718353,1842.205322,9.118030,0.000000,0.000000,89.999992);
//SetDynamicObjectMaterialText(0,"?? ????? ????!
// ?????? ??????????
// ? ????????!",120,"Calibri",40,0,-1442840576,-1427839772,1);
obj=CreateDynamicObject(19475,251.718414,1842.205322,8.478027,0.000000,0.000000,89.999992);
//SetDynamicObjectMaterialText(0,"?????????!
// ????? ? ?????????!",120,"Calibri",55,0,-1442840576,-1427839772,1);
CreateDynamicObject(19812,284.026215,1830.968018,7.442900,0.000000,0.000000,0.000000);
CreateDynamicObject(18644,288.719086,1832.437134,7.950590,0.000000,87.499985,11.899999);
CreateDynamicObject(19995,288.422546,1832.167847,7.950900,0.000000,90.000000,0.000000);
CreateDynamicObject(11729,294.503693,1835.345093,7.038499,0.000000,0.000000,-90.000000);
CreateDynamicObject(1544,244.910004,1866.459961,8.680000,0.000000,0.000000,95.000000);
CreateDynamicObject(1224,248.470001,1877.209961,8.359999,0.000000,0.000000,15.000000);
CreateDynamicObject(19627,288.501190,1831.871582,7.949999,0.000000,0.000000,25.000000);
CreateDynamicObject(18659,255.899307,1837.321899,5.390600,7.000000,0.000000,0.000000);
CreateDynamicObject(2350,244.559998,1858.060059,8.079999,0.000000,0.000000,0.000000);
CreateDynamicObject(1487,245.199997,1869.229980,8.859999,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19377,289.498688,1831.991821,10.440400,0.000000,90.000000,0.000000);
SetDynamicObjectMaterial(obj,0,4726,"libhelipad_lan2","helipad_basepanel",0);
CreateDynamicObject(2036,288.679199,1831.685913,7.940000,0.000000,0.000000,-105.000000);
obj=CreateDynamicObject(936,288.740204,1831.707642,7.456200,0.000000,0.000000,-90.000000);
SetDynamicObjectMaterial(obj,1,3979,"civic01_lan","sl_laglasswall1",0);
SetDynamicObjectMaterial(obj,0,4828,"airport3_las","brwall_128",0);
CreateDynamicObject(3014,283.806824,1830.149902,7.241600,0.000000,0.000000,-90.000000);
CreateDynamicObject(19435,294.862640,1834.881714,8.596899,0.000000,0.000000,0.000000);
CreateDynamicObject(18661,255.899307,1837.141846,4.950600,-7.000000,0.000000,0.000000);
CreateDynamicObject(2350,244.160004,1859.119995,8.079999,0.000000,0.000000,45.000000);
CreateDynamicObject(11729,294.503723,1834.582520,7.038499,0.000000,0.000000,-90.000000);
CreateDynamicObject(18644,289.141144,1831.463135,7.940599,0.000000,89.500015,-42.000000);
obj=CreateDynamicObject(19429,245.630005,1872.430054,8.560000,90.000000,90.000000,0.000000);
SetDynamicObjectMaterial(obj,0,18800,"mroadhelix1","road1-3",0);
CreateDynamicObject(1327,273.890015,1829.670044,16.469999,0.000000,90.000000,0.000000);
CreateDynamicObject(11727,283.449005,1829.547729,9.257100,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(16152,244.600006,1869.010010,7.769999,0.000000,0.000000,180.000000);
SetDynamicObjectMaterial(obj,3,6351,"rodeo02_law2","woodboards1",0);
SetDynamicObjectMaterial(obj,0,14569,"traidman","chinese8",0);
CreateDynamicObject(2033,288.968506,1831.166870,7.930300,0.000000,0.000000,45.000000);
CreateDynamicObject(1509,243.710007,1858.859985,8.920000,0.000000,0.000000,75.000000);
CreateDynamicObject(2745,254.921738,1837.302124,4.232359,0.000000,0.000000,303.638458);
CreateDynamicObject(874,278.109985,1894.000000,17.010000,0.000000,0.000000,350.660004);
obj=CreateDynamicObject(18644,288.401611,1830.815430,7.950600,0.000000,97.500000,130.000000);
SetDynamicObjectMaterial(obj,0,3820,"boxhses_sfsx","ws_painted_doors2",0);
CreateDynamicObject(1544,243.809998,1856.839966,8.720000,0.000000,0.000000,75.000000);
CreateDynamicObject(1509,243.580002,1858.619995,8.920000,0.000000,0.000000,180.000000);
obj=CreateDynamicObject(3027,288.453705,1830.761841,7.962999,83.000000,0.000000,39.307701);
SetDynamicObjectMaterial(obj,0,14577,"casinovault01","vaultFloor",0);
obj=CreateDynamicObject(3027,288.453705,1830.761841,7.959000,83.000000,0.000000,39.307701);
SetDynamicObjectMaterial(obj,0,14577,"casinovault01","vaultFloor",0);
CreateDynamicObject(2858,244.839996,1871.300049,8.699999,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(3027,288.461700,1830.745850,7.960000,83.000000,0.000000,39.307701);
SetDynamicObjectMaterial(obj,0,14577,"casinovault01","vaultFloor",0);
CreateDynamicObject(1520,243.690002,1857.199951,8.760000,0.000000,0.000000,75.000000);
obj=CreateDynamicObject(3027,288.489990,1830.721802,7.969999,83.000000,0.000000,39.307701);
SetDynamicObjectMaterial(obj,0,14577,"casinovault01","vaultFloor",0);
obj=CreateDynamicObject(3027,288.493713,1830.713745,7.967000,83.000000,0.000000,39.307701);
SetDynamicObjectMaterial(obj,0,14577,"casinovault01","vaultFloor",0);
CreateDynamicObject(3015,283.734100,1829.321045,7.141600,0.000000,0.000000,-90.000000);
obj=CreateDynamicObject(3027,288.522003,1830.681763,7.975999,83.000000,0.000000,39.307701);
SetDynamicObjectMaterial(obj,0,14577,"casinovault01","vaultFloor",0);
obj=CreateDynamicObject(3027,288.520599,1830.678589,7.969999,83.000000,0.000000,39.307701);
SetDynamicObjectMaterial(obj,0,14577,"casinovault01","vaultFloor",0);
CreateDynamicObject(11544,248.854401,1843.528442,6.739200,0.000000,0.000000,0.000000);
CreateDynamicObject(1886,243.699997,1857.329956,12.819999,25.000000,0.000000,44.669998);
CreateDynamicObject(1886,243.419998,1862.650024,12.800000,25.000000,0.000000,90.589996);
obj=CreateDynamicObject(1510,288.585999,1830.587891,7.936600,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,13295,"ce_terminal","cabin3",0);
CreateDynamicObject(1224,246.779999,1876.719971,8.359999,0.000000,0.000000,0.000000);
CreateDynamicObject(18673,288.600372,1830.581055,6.398499,0.000000,0.000000,0.000000);
CreateDynamicObject(19435,283.466797,1828.926270,6.938499,0.000000,90.000000,90.000000);
CreateDynamicObject(3095,248.718094,1843.004028,7.752999,0.000000,180.000000,0.000000);
obj=CreateDynamicObject(19411,242.940002,1861.199951,9.430000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,5267,"lashops91_las2","laspowrec2",0);
CreateDynamicObject(1224,245.619995,1875.020020,8.359999,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,290.579987,1831.760010,17.209999,0.000000,0.000000,25.000000);
CreateDynamicObject(1224,245.919998,1876.359985,9.550000,0.000000,0.000000,317.320007);
CreateDynamicObject(350,288.433777,1829.858765,7.930500,90.000000,0.000000,75.000000);
obj=CreateDynamicObject(936,288.740509,1829.917603,7.456399,0.000000,0.000000,-90.000000);
SetDynamicObjectMaterial(obj,1,3979,"civic01_lan","sl_laglasswall1",0);
SetDynamicObjectMaterial(obj,0,4828,"airport3_las","brwall_128",0);
CreateDynamicObject(1224,242.562622,1863.960571,11.039999,0.000000,0.000000,6.989999);
CreateDynamicObject(19897,285.849792,1828.899780,7.951099,0.000000,0.000000,-45.000000);
CreateDynamicObject(1543,243.520004,1852.880005,8.720000,0.000000,0.000000,75.000000);
CreateDynamicObject(1543,243.589996,1852.599976,8.720000,0.000000,0.000000,0.000000);
CreateDynamicObject(18635,286.422028,1828.892944,7.910600,90.000000,90.000000,-15.000000);
obj=CreateDynamicObject(19429,247.250000,1843.939941,8.560000,90.000000,90.000000,90.000000);
SetDynamicObjectMaterial(obj,0,18800,"mroadhelix1","road1-3",0);
CreateDynamicObject(2044,288.681091,1829.574219,7.950399,0.000000,0.000000,180.000000);
obj=CreateDynamicObject(16151,242.750000,1855.770020,8.090000,0.000000,0.000000,180.000000);
SetDynamicObjectMaterial(obj,7,5267,"lashops91_las2","laspowrec2",0);
SetDynamicObjectMaterial(obj,5,18642,"taser1","metalshinydented1",0);
SetDynamicObjectMaterial(obj,3,14533,"pleas_dome","club_zeb_SFW2",0);
obj=CreateDynamicObject(19438,242.210007,1861.229980,11.090000,0.000000,90.000000,90.000000);
SetDynamicObjectMaterial(obj,0,5267,"lashops91_las2","laspowrec2",0);
CreateDynamicObject(19624,286.445435,1828.775757,8.028900,-90.000000,0.000000,348.697723);
obj=CreateDynamicObject(19438,242.229996,1859.530029,9.430000,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,0,5267,"lashops91_las2","laspowrec2",0);
CreateDynamicObject(1544,246.350006,1845.199951,8.680000,0.000000,0.000000,75.000000);
obj=CreateDynamicObject(19451,256.009399,1834.318604,5.198699,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,19517,"noncolored","gen_white",0);
CreateDynamicObject(19627,286.448486,1828.592285,8.133000,0.000000,0.000000,-30.000000);
CreateDynamicObject(11714,255.921997,1834.375854,4.948200,0.000000,0.000000,180.000000);
CreateDynamicObject(19472,287.342438,1828.853271,7.969799,0.000000,-110.000000,348.269562);
CreateDynamicObject(2044,288.523987,1829.262451,7.950399,0.000000,0.000000,35.000000);
obj=CreateDynamicObject(976,242.929993,1862.849976,1.730000,0.000000,-90.000000,90.000000);
SetDynamicObjectMaterial(obj,2,18757,"vcinteriors","dt_office_gls_text",0);
CreateDynamicObject(19627,287.065613,1828.730347,7.949999,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(937,286.493011,1828.487549,7.456200,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,3979,"civic01_lan","sl_laglasswall1",0);
SetDynamicObjectMaterial(obj,0,4828,"airport3_las","brwall_128",0);
CreateDynamicObject(368,287.789795,1828.851318,8.050800,0.000000,90.000000,-20.000000);
CreateDynamicObject(19627,286.970520,1828.505371,7.949999,0.000000,0.000000,45.000000);
CreateDynamicObject(368,288.068420,1828.726074,8.050800,0.000000,90.000000,120.000000);
CreateDynamicObject(1224,245.089996,1877.010010,8.359999,0.000000,0.000000,0.000000);
CreateDynamicObject(2007,241.500000,1862.300049,9.140000,0.000000,0.000000,0.000000);
CreateDynamicObject(1544,245.720001,1844.920044,8.680000,0.000000,0.000000,0.000000);
CreateDynamicObject(2007,241.500000,1862.300049,7.739999,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19365,241.440002,1862.890015,9.430000,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,0,5267,"lashops91_las2","laspowrec2",0);
obj=CreateDynamicObject(19394,241.619995,1857.839966,9.430000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,5267,"lashops91_las2","laspowrec2",0);
CreateDynamicObject(3461,283.760010,1827.780029,16.070000,0.000000,0.000000,0.000000);
CreateDynamicObject(18644,287.242096,1828.178711,7.940600,0.000000,90.000000,-22.000000);
obj=CreateDynamicObject(1495,241.660004,1857.109985,7.760000,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,2,18757,"vcinteriors","dt_officewall3",0);
obj=CreateDynamicObject(937,288.381989,1828.487549,7.456200,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,3979,"civic01_lan","sl_laglasswall1",0);
SetDynamicObjectMaterial(obj,0,4828,"airport3_las","brwall_128",0);
CreateDynamicObject(2057,288.033386,1828.223267,8.090499,0.000000,0.000000,-20.000000);
//obj=CreateDynamicObject(19327,241.753235,1855.273315,10.423039,0.000000,0.000000,90.000000);
//SetDynamicObjectMaterialText(0,"10:57",80,"Fixedsys",20,0,-8323328,0,1);
CreateDynamicObject(1362,283.750000,1827.780029,17.230000,0.000000,0.000000,0.000000);
CreateDynamicObject(2316,242.059998,1853.560059,9.949999,0.000000,0.000000,90.000000);
CreateDynamicObject(1551,242.330002,1852.430054,8.960000,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(1790,241.677109,1855.268433,10.401802,90.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,0,19129,"dancefloors","plastic5-small",0);
CreateDynamicObject(8843,297.769989,1833.270020,6.840000,0.000000,0.000000,180.000000);
obj=CreateDynamicObject(19365,241.619995,1854.630005,9.430000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,5267,"lashops91_las2","laspowrec2",0);
CreateDynamicObject(11544,248.845200,1840.002075,4.024099,0.000000,0.000000,0.000000);
CreateDynamicObject(1224,240.899994,1864.060059,11.039999,0.000000,0.000000,351.100006);
CreateDynamicObject(3015,289.604797,1828.180420,7.141600,0.000000,0.000000,-50.000000);
CreateDynamicObject(2007,240.509995,1862.300049,9.140000,0.000000,0.000000,0.000000);
CreateDynamicObject(2007,240.509995,1862.300049,7.739999,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19327,248.956894,1838.292114,12.593894,0.000000,0.000000,0.000000);
SetDynamicObjectMaterialText(obj,0,"БАР",50,"Ariel",40,1,-1048576,0,1);
CreateDynamicObject(2612,241.750000,1851.199951,9.859999,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(19365,240.169998,1861.229980,11.100000,0.000000,90.000000,90.000000);
SetDynamicObjectMaterial(obj,0,5267,"lashops91_las2","laspowrec2",0);
obj=CreateDynamicObject(19365,241.619995,1851.420044,9.430000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,5267,"lashops91_las2","laspowrec2",0);
CreateDynamicObject(1438,240.089996,1859.579956,11.180000,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(19365,240.080002,1858.560059,11.109999,0.000000,90.000000,90.000000);
SetDynamicObjectMaterial(obj,0,5267,"lashops91_las2","laspowrec2",0);
obj=CreateDynamicObject(16152,243.699997,1844.939941,7.769999,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,3,6351,"rodeo02_law2","woodboards1",0);
SetDynamicObjectMaterial(obj,0,14569,"traidman","chinese8",0);
CreateDynamicObject(8843,313.540009,1861.699951,6.840000,0.000000,0.000000,180.000000);
CreateDynamicObject(2007,239.500000,1862.300049,9.130000,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19365,240.080002,1855.060059,11.109999,0.000000,90.000000,90.000000);
SetDynamicObjectMaterial(obj,0,5267,"lashops91_las2","laspowrec2",0);
CreateDynamicObject(2007,239.500000,1862.300049,7.739999,0.000000,0.000000,0.000000);
CreateDynamicObject(348,239.419998,1858.880005,8.710000,90.000000,90.000000,180.000000);
CreateDynamicObject(874,290.880005,1895.579956,16.505989,0.000000,0.000000,350.660004);
CreateDynamicObject(19143,303.091644,1835.315552,9.946299,0.000000,0.000000,230.861603);
CreateDynamicObject(874,251.089996,1835.000000,16.205990,0.000000,0.000000,90.000000);
CreateDynamicObject(2310,239.449997,1856.560059,8.239999,0.000000,0.000000,0.000000);
CreateDynamicObject(2007,239.029999,1861.800049,9.130000,0.000000,0.000000,90.000000);
CreateDynamicObject(2007,239.029999,1860.800049,9.130000,0.000000,0.000000,90.000000);
CreateDynamicObject(2007,239.039993,1861.800049,7.739999,0.000000,0.000000,90.000000);
CreateDynamicObject(2007,239.029999,1859.800049,9.130000,0.000000,0.000000,90.000000);
CreateDynamicObject(2007,239.039993,1860.800049,7.739999,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(19453,250.129501,1835.722046,3.458836,37.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,19517,"noncolored","gen_white",0);
obj=CreateDynamicObject(941,304.113190,1836.261597,6.380199,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,16322,"a51_stores","dish_panel_a",0);
SetDynamicObjectMaterial(obj,0,14652,"ab_trukstpa","CJ_WOOD6",0);
CreateDynamicObject(2007,239.029999,1859.800049,7.739999,0.000000,0.000000,90.000000);
CreateDynamicObject(936,239.100006,1858.280029,8.220000,0.000000,0.000000,90.000000);
CreateDynamicObject(1829,239.100006,1857.819946,9.170000,0.000000,0.000000,90.000000);
CreateDynamicObject(2386,238.910004,1858.979980,8.800000,0.000000,0.000000,90.000000);
CreateDynamicObject(2386,238.899994,1858.520020,8.800000,0.000000,0.000000,90.000000);
CreateDynamicObject(2185,239.029999,1857.219971,7.760000,0.000000,0.000000,-90.000000);
obj=CreateDynamicObject(19365,240.080002,1851.569946,11.109999,0.000000,90.000000,90.000000);
SetDynamicObjectMaterial(obj,0,5267,"lashops91_las2","laspowrec2",0);
CreateDynamicObject(874,250.630005,1887.959961,18.740999,0.000000,0.000000,342.549988);
obj=CreateDynamicObject(2653,301.188934,1832.943726,6.392000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,16640,"a51","airvent_gz",0);
CreateDynamicObject(19435,294.873169,1828.285156,8.596899,0.000000,0.000000,0.000000);
CreateDynamicObject(1310,238.550003,1857.829956,9.750000,0.000000,0.000000,90.000000);
CreateDynamicObject(2310,238.919998,1854.949951,8.239999,0.000000,0.000000,180.000000);
CreateDynamicObject(11711,293.218201,1827.177856,9.683899,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19394,240.110001,1849.900024,9.430000,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,0,5267,"lashops91_las2","laspowrec2",0);
obj=CreateDynamicObject(19365,238.229996,1862.890015,9.430000,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,0,5267,"lashops91_las2","laspowrec2",0);
CreateDynamicObject(19435,293.203644,1827.047852,8.596899,0.000000,0.000000,90.000000);
CreateDynamicObject(1569,292.576813,1826.672241,6.889100,0.000000,0.000000,0.000000);
CreateDynamicObject(1569,294.005096,1827.134277,7.030099,0.000000,0.000000,180.000000);
CreateDynamicObject(11727,238.571594,1869.285400,12.937200,0.000000,0.000000,90.000000);
CreateDynamicObject(1551,241.160004,1845.339966,8.920000,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(1495,239.330002,1849.880005,7.719999,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,2,18757,"vcinteriors","dt_officewall3",0);
obj=CreateDynamicObject(936,306.483032,1836.241577,6.380169,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,16322,"a51_stores","dish_panel_a",0);
SetDynamicObjectMaterial(obj,0,14652,"ab_trukstpa","CJ_WOOD6",0);
obj=CreateDynamicObject(19453,247.547806,1835.737915,3.470872,37.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,19517,"noncolored","gen_white",0);
CreateDynamicObject(11711,238.593002,1872.304810,12.829799,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(941,303.655701,1832.800415,6.380199,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,16322,"a51_stores","dish_panel_a",0);
SetDynamicObjectMaterial(obj,0,14652,"ab_trukstpa","CJ_WOOD6",0);
obj=CreateDynamicObject(16152,241.360001,1843.089966,7.769999,0.000000,0.000000,-90.000000);
SetDynamicObjectMaterial(obj,3,6351,"rodeo02_law2","woodboards1",0);
SetDynamicObjectMaterial(obj,0,14569,"traidman","chinese8",0);
CreateDynamicObject(3280,263.688202,1824.226685,3.703100,0.000000,0.000000,0.000000);
CreateDynamicObject(11727,241.294006,1880.899048,12.937200,0.000000,0.000000,0.000000);
CreateDynamicObject(975,236.413406,1862.686646,14.458300,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(941,303.658905,1831.612061,6.380199,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,16322,"a51_stores","dish_panel_a",0);
SetDynamicObjectMaterial(obj,0,14652,"ab_trukstpa","CJ_WOOD6",0);
CreateDynamicObject(11727,238.564697,1875.730103,12.937200,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(941,308.364197,1836.281616,6.380199,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,16322,"a51_stores","dish_panel_a",0);
SetDynamicObjectMaterial(obj,0,14652,"ab_trukstpa","CJ_WOOD6",0);
CreateDynamicObject(734,236.520004,1860.859985,19.120001,0.000000,0.000000,29.990000);
CreateDynamicObject(11727,238.578400,1845.755249,10.837800,0.000000,0.000000,90.000000);
CreateDynamicObject(1299,239.169998,1879.140015,10.899999,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(941,306.014404,1832.800903,6.380199,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,16322,"a51_stores","dish_panel_a",0);
SetDynamicObjectMaterial(obj,0,14652,"ab_trukstpa","CJ_WOOD6",0);
CreateDynamicObject(19436,300.651001,1827.856201,8.146860,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19359,242.085297,1838.587158,4.662700,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,0,19517,"noncolored","gen_white",0);
CreateDynamicObject(11714,242.086700,1838.458862,4.947000,0.000000,0.000000,-90.000000);
obj=CreateDynamicObject(943,301.376709,1827.936035,6.690400,0.000000,0.000000,180.000000);
SetDynamicObjectMaterial(obj,0,16640,"a51","a51_panels1",0);
CreateDynamicObject(19143,303.147308,1828.882324,9.946299,0.000000,0.000000,317.527496);
obj=CreateDynamicObject(941,306.014404,1831.612061,6.380199,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,16322,"a51_stores","dish_panel_a",0);
SetDynamicObjectMaterial(obj,0,14652,"ab_trukstpa","CJ_WOOD6",0);
CreateDynamicObject(19143,311.114685,1836.926270,7.822159,20.000000,0.000000,180.000000);
CreateDynamicObject(8843,313.279999,1839.630005,6.740000,0.000000,0.000000,90.000000);
CreateDynamicObject(3593,247.070007,1831.349976,17.110001,0.000000,0.000000,44.820000);
obj=CreateDynamicObject(941,308.371948,1832.800903,6.380199,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,16322,"a51_stores","dish_panel_a",0);
SetDynamicObjectMaterial(obj,0,14652,"ab_trukstpa","CJ_WOOD6",0);
CreateDynamicObject(19622,302.263306,1826.645386,6.670000,10.000000,0.000000,0.000000);
obj=CreateDynamicObject(941,308.371887,1831.612061,6.380199,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,16322,"a51_stores","dish_panel_a",0);
SetDynamicObjectMaterial(obj,0,14652,"ab_trukstpa","CJ_WOOD6",0);
obj=CreateDynamicObject(1498,302.620789,1826.486938,5.948900,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,65535,"none","none",-1);
CreateDynamicObject(19313,285.649994,1820.979980,23.889999,0.000000,0.000000,90.000000);
CreateDynamicObject(2843,312.115509,1835.396118,6.521299,0.000000,0.000000,0.000000);
CreateDynamicObject(11711,304.086212,1826.549316,8.648400,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(1438,312.843292,1835.474976,5.973599,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,14612,"ab_abattoir_box","ab_boxStack2",0);
CreateDynamicObject(874,279.299988,1906.380005,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(874,238.889999,1885.660034,17.964100,0.000000,0.000000,350.660004);
CreateDynamicObject(19463,305.191101,1826.371582,7.665800,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(1498,305.580688,1826.526855,5.948900,0.000000,0.000000,180.000000);
SetDynamicObjectMaterial(obj,0,65535,"none","none",-1);
CreateDynamicObject(19826,305.804413,1826.548950,7.130700,0.000000,0.000000,180.000000);
CreateDynamicObject(8843,282.630005,1816.459961,3.730000,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(19475,306.384613,1826.541748,7.194623,-0.799909,-0.200000,90.200005);
SetDynamicObjectMaterial(obj,0,2047,"cj_ammo_posters","CJ_TARGET1",0);
CreateDynamicObject(874,251.199997,1899.239990,18.741030,0.000000,0.000000,342.549988);

obj=CreateDynamicObject(19475,306.935730,1826.540894,7.842378,-0.799909,-0.200000,90.200005);
SetDynamicObjectMaterial(obj,0,14415,"carter_block_2","mp_carter_statue",0);
CreateDynamicObject(19805,307.215393,1826.569092,7.568500,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19475,307.239868,1826.541748,7.219127,-1.299909,-0.700000,90.599998);
SetDynamicObjectMaterial(obj,0,14489,"carlspics","AH_picture2",0);
obj=CreateDynamicObject(19475,307.513916,1826.535156,7.534855,-178.999969,0.000000,90.599998);
SetDynamicObjectMaterial(obj,0,3017,"arch_plx","arch_plans",0);
CreateDynamicObject(19143,316.376129,1836.923218,7.822159,20.000000,0.000000,180.000000);
obj=CreateDynamicObject(1438,315.553925,1835.643555,5.973609,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,14612,"ab_abattoir_box","ab_boxStack2",0);
obj=CreateDynamicObject(19475,307.861328,1826.538330,7.801538,2.800000,0.000000,90.599998);
SetDynamicObjectMaterial(obj,0,18064,"ab_sfammuunits","gun_targeta",0);
obj=CreateDynamicObject(19475,307.984802,1826.540161,7.268990,-2.600001,0.000000,90.599998);
SetDynamicObjectMaterial(obj,0,18064,"ab_sfammuunits","gun_targetb",0);
CreateDynamicObject(3594,232.479996,1877.060059,17.080000,0.000000,0.000000,25.000000);
CreateDynamicObject(3461,283.679993,1814.910034,16.070000,0.000000,0.000000,0.000000);
CreateDynamicObject(1362,283.690002,1814.920044,17.230000,0.000000,0.000000,0.000000);
CreateDynamicObject(11735,316.500397,1835.234619,6.580699,0.000000,90.000000,0.000000);
obj=CreateDynamicObject(1438,317.410034,1835.261719,5.973599,0.000000,0.000000,-90.000000);
SetDynamicObjectMaterial(obj,0,14612,"ab_abattoir_box","ab_boxStack2",0);
obj=CreateDynamicObject(934,311.553955,1827.421143,7.203499,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,0,16640,"a51","a51_panels1",0);
CreateDynamicObject(3280,299.464905,1818.584106,3.701100,0.000000,0.000000,0.000000);
CreateDynamicObject(8843,248.805603,1821.490723,3.730000,0.000000,0.000000,0.000000);
CreateDynamicObject(8843,266.600006,1813.430054,3.730000,0.000000,0.000000,27.740000);
CreateDynamicObject(2714,287.657196,1813.327148,6.962299,0.000000,8.000000,180.000000);
CreateDynamicObject(2657,286.390686,1812.892944,5.085499,0.000000,0.000000,180.000000);
CreateDynamicObject(19859,286.791595,1812.860962,4.960400,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19456,287.468994,1812.760498,5.055500,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,0,16640,"a51","concretegroundl1_256",0);
obj=CreateDynamicObject(2972,313.476532,1827.498169,6.906864,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,16640,"a51","vent01_64",0);
SetDynamicObjectMaterial(obj,0,2215,"chick_tray","strawroof_cb",-16764058);
CreateDynamicObject(2656,288.754791,1812.873047,5.085499,0.000000,0.000000,180.000000);
obj=CreateDynamicObject(2972,313.476532,1827.097656,6.906864,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,16640,"a51","vent01_64",0);
SetDynamicObjectMaterial(obj,0,2215,"chick_tray","strawroof_cb",-16764058);
obj=CreateDynamicObject(1698,313.707336,1827.337158,6.281530,-93.999969,-168.299988,102.599998);
SetDynamicObjectMaterial(obj,0,19598,"sfbuilding1","darkwood1",0);
CreateDynamicObject(2411,320.232208,1836.048096,6.125101,-83.800011,92.800018,-0.399999);
CreateDynamicObject(2411,319.893860,1835.409668,6.125099,-98.999992,77.000023,134.422348);
CreateDynamicObject(734,266.260010,1911.209961,16.639999,0.000000,0.000000,88.669998);
CreateDynamicObject(1431,225.649994,1864.729980,12.750000,0.000000,0.000000,259.989990);
CreateDynamicObject(923,225.490005,1862.219971,12.989999,0.000000,0.000000,92.199997);
obj=CreateDynamicObject(2972,313.486420,1825.907471,6.906864,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,16640,"a51","vent01_64",0);
SetDynamicObjectMaterial(obj,0,16640,"a51","vent01_64",0);
CreateDynamicObject(2371,320.941498,1835.831177,5.974199,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(1698,315.125397,1827.431763,6.796999,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,0,19598,"sfbuilding1","darkwood1",0);
CreateDynamicObject(19463,314.316711,1826.371582,7.665800,0.000000,0.000000,90.000000);
CreateDynamicObject(11727,226.289795,1872.399658,15.448200,0.000000,0.000000,-90.000000);
CreateDynamicObject(874,236.529999,1896.540039,16.308001,0.000000,0.000000,158.600006);
CreateDynamicObject(874,274.380005,1808.310059,16.308001,0.000000,0.000000,-90.000000);
CreateDynamicObject(2371,323.666290,1835.804810,5.974199,0.000000,0.000000,100.000000);
CreateDynamicObject(933,227.529999,1883.310059,16.610001,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(1698,318.431396,1827.431763,6.796999,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,0,19598,"sfbuilding1","darkwood1",0);
CreateDynamicObject(933,227.860001,1884.410034,17.540001,0.000000,90.000000,90.000000);
obj=CreateDynamicObject(19604,318.762299,1825.628540,6.928493,0.000000,0.000000,90.100037);
SetDynamicObjectMaterial(obj,0,13659,"8bars","barrier",0);
CreateDynamicObject(1358,228.169998,1888.630005,17.840000,0.000000,0.000000,271.609985);
CreateDynamicObject(19143,326.959656,1835.848999,9.946299,0.000000,0.000000,121.522141);
obj=CreateDynamicObject(1698,321.731598,1827.431763,6.796969,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,0,19598,"sfbuilding1","darkwood1",0);
CreateDynamicObject(3066,246.156403,1814.281616,17.667299,0.000000,0.000000,-90.000000);
obj=CreateDynamicObject(943,327.996185,1835.449341,6.690400,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,16640,"a51","a51_panels1",0);
CreateDynamicObject(18260,222.699997,1880.969971,18.200001,0.000000,0.000000,60.310001);
CreateDynamicObject(933,228.190002,1892.829956,16.610001,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,279.190002,1804.219971,17.230000,0.000000,0.000000,130.929993);
CreateDynamicObject(3594,279.190002,1804.219971,17.719999,180.000000,0.000000,123.300003);
obj=CreateDynamicObject(1698,323.344421,1827.399170,6.395439,-89.899963,22.100018,113.100052);
SetDynamicObjectMaterial(obj,0,19598,"sfbuilding1","darkwood1",0);
obj=CreateDynamicObject(2972,323.516296,1827.528198,6.906864,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,16640,"a51","vent01_64",0);
SetDynamicObjectMaterial(obj,0,2215,"chick_tray","strawroof_cb",-16764058);
CreateDynamicObject(3594,279.190002,1804.219971,18.820000,0.000000,0.000000,312.890015);
CreateDynamicObject(3594,279.190002,1804.219971,19.790001,0.000000,0.000000,123.300003);
obj=CreateDynamicObject(2972,323.526306,1827.047729,6.906864,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,16640,"a51","vent01_64",0);
SetDynamicObjectMaterial(obj,0,2215,"chick_tray","strawroof_cb",-16764058);
CreateDynamicObject(1217,224.169998,1887.810059,17.020000,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(2972,323.516296,1825.907471,6.906864,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,16640,"a51","vent01_64",0);
SetDynamicObjectMaterial(obj,0,16640,"a51","vent01_64",0);
CreateDynamicObject(19463,323.958099,1826.371582,7.665800,0.000000,0.000000,90.000000);
CreateDynamicObject(3287,219.110001,1871.349976,21.219999,0.000000,0.000000,91.000000);
CreateDynamicObject(1217,224.380005,1889.089966,17.020000,0.000000,0.000000,0.000000);
CreateDynamicObject(19143,326.545105,1829.174316,9.946299,0.000000,0.000000,71.133369);
CreateDynamicObject(11700,218.301300,1874.330688,12.135100,0.000000,0.000000,312.726593);
obj=CreateDynamicObject(934,325.418976,1827.391846,7.203519,0.000000,0.000000,-90.000000);
SetDynamicObjectMaterial(obj,0,16640,"a51","a51_panels1",0);
CreateDynamicObject(925,225.229996,1891.400024,17.680000,0.000000,0.000000,90.000000);
CreateDynamicObject(920,328.262085,1831.358887,7.565596,0.000000,0.000000,-90.000000);
CreateDynamicObject(874,217.100006,1859.430054,19.680000,0.000000,0.000000,71.269997);
CreateDynamicObject(19463,328.709015,1831.326904,7.665800,0.000000,0.000000,0.000000);
CreateDynamicObject(8615,250.406097,1807.505981,4.820000,0.000000,0.000000,180.000000);
obj=CreateDynamicObject(2653,328.205109,1830.200562,6.392000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,16640,"a51","airvent_gz",0);
CreateDynamicObject(944,221.369995,1885.890015,17.510000,0.000000,0.000000,44.820000);
CreateDynamicObject(874,337.059998,1860.750000,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(920,328.261230,1829.386353,7.565593,0.000000,0.000000,-90.000000);
CreateDynamicObject(925,225.240005,1894.310059,17.680000,0.000000,0.000000,90.000000);
CreateDynamicObject(695,336.899994,1857.949951,21.420000,0.000000,0.000000,-296.390015);
CreateDynamicObject(874,291.440002,1802.369995,16.505989,0.000000,0.000000,350.660004);
CreateDynamicObject(874,246.100006,1808.520020,16.709999,0.000000,0.000000,90.000000);
CreateDynamicObject(11727,216.276703,1873.945190,15.926300,0.000000,0.000000,352.595001);
obj=CreateDynamicObject(19327,247.628876,1806.763184,9.434295,0.000000,0.000000,180.000000);
SetDynamicObjectMaterialText(obj,0,"РАДАР",80,"Ariel",40,1,-1048576,0,1);
CreateDynamicObject(11727,216.320007,1875.939941,16.020000,0.000000,0.000000,180.000000);
CreateDynamicObject(925,227.600006,1899.900024,17.680000,0.000000,0.000000,90.000000);
CreateDynamicObject(19124,216.899796,1880.452271,12.576700,0.000000,180.000000,0.000000);
CreateDynamicObject(874,236.660004,1909.859985,16.308001,0.000000,0.000000,163.550003);
CreateDynamicObject(11711,213.836502,1874.214844,15.864000,0.000000,0.000000,-5.000000);
CreateDynamicObject(19124,214.899704,1880.452271,12.576700,0.000000,180.000000,0.000000);
CreateDynamicObject(11727,213.759995,1875.939941,16.020000,0.000000,0.000000,180.000000);
CreateDynamicObject(3461,224.639999,1900.170044,16.090000,0.000000,0.000000,0.000000);
CreateDynamicObject(1362,224.630005,1900.109985,17.230000,0.000000,0.000000,0.000000);
CreateDynamicObject(11727,225.809998,1901.739990,20.040001,0.000000,0.000000,180.000000);
CreateDynamicObject(3066,231.550293,1814.251099,17.667299,0.000000,0.000000,90.000000);
CreateDynamicObject(19124,212.804901,1880.452271,12.576700,0.000000,180.000000,0.000000);
CreateDynamicObject(11727,211.398300,1874.545166,15.926300,0.000000,0.000000,352.595001);
CreateDynamicObject(735,234.919998,1809.780029,14.500000,0.000000,0.000000,159.649994);
CreateDynamicObject(11727,211.259995,1875.939941,16.020000,0.000000,0.000000,180.000000);
obj=CreateDynamicObject(2590,220.677185,1824.039673,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,220.612396,1824.039795,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,220.707474,1823.603760,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,220.819305,1823.077637,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
CreateDynamicObject(11700,221.414581,1901.191406,14.870330,0.000000,0.000000,0.000000);
CreateDynamicObject(19967,221.407501,1901.233398,14.946300,0.000000,0.000000,180.000000);
obj=CreateDynamicObject(2590,220.923279,1822.222778,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,220.541382,1822.755005,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,219.871445,1823.651489,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
CreateDynamicObject(11700,209.365005,1874.723755,12.135100,0.000000,0.000000,0.000000);
CreateDynamicObject(19124,210.730301,1880.452271,12.576700,0.000000,180.000000,0.000000);
CreateDynamicObject(3286,243.740005,1920.839966,21.150000,0.000000,0.000000,-45.000000);
obj=CreateDynamicObject(2590,218.962540,1824.446045,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.957581,1824.445923,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,220.109512,1822.696411,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,219.931076,1822.719604,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,219.944977,1822.694458,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,219.572372,1823.027466,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,219.510773,1822.652954,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.996857,1823.404785,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,219.412369,1822.706177,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,219.281815,1822.850098,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,220.147079,1821.598633,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.981186,1823.272583,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,219.344009,1822.733643,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,219.420197,1822.618164,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.963135,1823.255249,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.963089,1823.255249,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.961807,1823.255005,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,219.357544,1822.638916,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.794434,1823.404785,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,219.925095,1821.677124,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,219.300613,1822.436890,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,219.800156,1821.673828,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.538040,1823.448120,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,219.194809,1822.357178,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.965942,1822.656006,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.962463,1822.653320,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,219.072906,1822.374390,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
CreateDynamicObject(1685,207.910004,1873.540039,12.869999,0.000000,0.000000,0.000000);
CreateDynamicObject(874,345.489990,1853.010010,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(874,338.859985,1830.949951,17.010000,0.000000,0.000000,350.660004);
obj=CreateDynamicObject(2590,219.556458,1821.424316,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.569717,1822.786011,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.548065,1822.771851,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.896561,1821.958740,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
CreateDynamicObject(922,206.589996,1858.300049,13.020000,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(2590,219.181396,1821.387695,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.681061,1822.026978,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.524521,1821.963379,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.442886,1822.079468,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.428452,1822.090332,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.513016,1821.952271,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.683289,1821.406372,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
CreateDynamicObject(19868,287.989990,1792.280029,16.650000,90.000000,0.000000,15.000000);
CreateDynamicObject(3287,206.240005,1871.130005,21.219999,0.000000,0.000000,91.000000);
CreateDynamicObject(3799,206.919998,1879.630005,16.510000,0.000000,0.000000,0.000000);
CreateDynamicObject(695,338.739990,1824.180054,21.420000,0.000000,0.000000,-206.389999);
CreateDynamicObject(3799,206.139999,1881.189941,18.740000,0.000000,0.000000,30.320000);
CreateDynamicObject(874,346.220001,1885.079956,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(874,235.710007,1922.890015,16.100950,0.000000,0.000000,209.479996);
CreateDynamicObject(3286,239.550003,1924.829956,21.150000,0.000000,0.000000,-45.000000);
CreateDynamicObject(3799,202.589996,1859.469971,12.010000,0.000000,0.000000,0.000000);
CreateDynamicObject(735,347.739990,1883.609985,16.120001,0.000000,0.000000,1.500000);
CreateDynamicObject(3799,205.289993,1883.000000,16.510000,0.000000,0.000000,34.480000);
CreateDynamicObject(1431,201.500000,1864.130005,12.750000,0.000000,0.000000,268.329987);
CreateDynamicObject(18757,201.843399,1869.500488,14.018400,0.000000,0.000000,0.000000);
CreateDynamicObject(18756,201.847107,1869.569824,14.018400,0.000000,0.000000,0.000000);
CreateDynamicObject(3799,204.070007,1886.609985,16.510000,0.000000,0.000000,5.980000);
CreateDynamicObject(1327,201.009995,1880.709961,17.389999,25.000000,15.000000,0.000000);
obj=CreateDynamicObject(18758,198.031693,1869.491455,13.598199,0.000000,0.000000,180.000000);
SetDynamicObjectMaterial(obj,1,16640,"a51","a51_wall1",0);
SetDynamicObjectMaterial(obj,0,16640,"a51","sm_conc_hatch",0);
CreateDynamicObject(874,269.459991,1782.650024,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(3271,292.980011,1939.969971,16.360001,0.000000,0.000000,161.039993);
CreateDynamicObject(874,196.820007,1859.270020,19.780001,0.000000,0.000000,67.790001);
CreateDynamicObject(18260,203.690002,1894.650024,18.200001,0.000000,0.000000,269.799988);
CreateDynamicObject(933,197.410004,1875.800049,16.590000,0.000000,2.000000,0.000000);
CreateDynamicObject(11700,206.081024,1901.217041,14.870330,0.000000,0.000000,0.000000);
CreateDynamicObject(19967,206.079071,1901.235229,14.946300,0.000000,0.000000,180.000000);
CreateDynamicObject(19905,204.240005,1824.020020,16.450001,0.000000,0.000000,180.000000);
CreateDynamicObject(17055,198.300003,1886.270020,18.990000,0.000000,0.000000,270.940002);
CreateDynamicObject(734,253.389999,1942.260010,16.400000,0.000000,0.000000,25.389999);
CreateDynamicObject(11727,201.990005,1901.739990,20.040001,0.000000,0.000000,180.000000);
CreateDynamicObject(17055,198.309998,1894.530029,18.990000,0.000000,0.000000,270.940002);
CreateDynamicObject(1217,200.139999,1899.810059,17.030001,0.000000,0.000000,0.000000);
CreateDynamicObject(734,190.550003,1871.109985,16.340000,0.000000,0.000000,300.390015);
CreateDynamicObject(888,194.820007,1901.069946,16.580000,0.000000,0.000000,0.000000);
CreateDynamicObject(1682,216.039993,1930.670044,28.680000,0.000000,0.000000,127.750000);
CreateDynamicObject(3461,185.169998,1831.500000,16.070000,0.000000,0.000000,0.000000);
CreateDynamicObject(1362,185.149994,1831.530029,17.230000,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,186.460007,1899.949951,17.100000,0.000000,0.000000,75.000000);
CreateDynamicObject(19905,206.669998,1931.170044,16.450001,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,366.500000,1902.859985,16.889999,0.000000,0.000000,145.070007);
CreateDynamicObject(1075,183.145859,1825.944946,17.129000,0.000000,0.000000,180.000000);
CreateDynamicObject(735,310.089996,1766.939941,15.630000,0.000000,0.000000,190.070007);
CreateDynamicObject(874,232.279999,1770.550049,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(1075,183.148499,1822.390015,17.129000,0.000000,0.000000,180.000000);
CreateDynamicObject(874,311.980011,1766.369995,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(19906,179.417999,1832.084717,19.869801,0.000000,0.000000,0.000000);
CreateDynamicObject(735,188.940002,1807.280029,14.580000,0.000000,0.000000,59.650002);
CreateDynamicObject(19872,178.912125,1827.918701,16.443489,0.000000,0.000000,90.000000);
CreateDynamicObject(874,365.369995,1914.800049,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(695,363.950012,1916.430054,21.420000,0.000000,0.000000,-296.390015);
CreateDynamicObject(874,222.080002,1772.530029,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(19872,178.902802,1820.726074,16.443501,0.000000,0.000000,90.000000);
CreateDynamicObject(1738,180.529694,1816.926392,17.154301,0.000000,0.000000,0.000000);
CreateDynamicObject(874,171.550003,1875.290039,20.299999,0.000000,0.000000,0.000000);
CreateDynamicObject(1217,179.729996,1907.829956,17.420000,0.000000,0.000000,70.000000);
CreateDynamicObject(1217,178.779999,1906.770020,17.420000,0.000000,0.000000,0.000000);
CreateDynamicObject(1217,178.850006,1908.140015,17.379999,90.000000,0.000000,0.000000);
CreateDynamicObject(852,187.770004,1925.119995,16.639999,0.000000,0.000000,-90.000000);
CreateDynamicObject(695,231.220001,1762.420044,21.410000,0.000000,0.000000,190.000000);
CreateDynamicObject(851,187.369995,1926.810059,16.980000,0.000000,0.000000,-90.000000);
CreateDynamicObject(2064,194.059998,1935.319946,22.860001,0.000000,0.000000,208.240005);
CreateDynamicObject(874,362.570007,1934.420044,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(734,170.639999,1900.079956,15.830000,0.000000,0.000000,253.339996);
CreateDynamicObject(695,360.119995,1937.000000,21.420000,0.000000,0.000000,-296.390015);
CreateDynamicObject(874,370.630005,1924.160034,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(874,163.740005,1857.140015,17.469999,0.000000,0.000000,115.330002);
CreateDynamicObject(18609,172.080002,1906.250000,18.170000,0.000000,0.000000,272.010010);
CreateDynamicObject(18609,171.830002,1907.660034,17.490000,0.000000,180.000000,268.190002);
CreateDynamicObject(18609,172.039993,1908.849976,18.170000,0.000000,0.000000,272.010010);
CreateDynamicObject(933,186.660004,1933.670044,16.690001,0.000000,2.000000,0.000000);
CreateDynamicObject(874,167.789993,1900.709961,18.280001,0.000000,0.000000,90.000000);
CreateDynamicObject(1738,169.035904,1816.926392,17.154301,0.000000,0.000000,0.000000);
CreateDynamicObject(19905,166.119995,1824.040039,16.450001,0.000000,0.000000,180.000000);
CreateDynamicObject(695,202.029999,1771.069946,21.410000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,159.979996,1887.449951,17.879999,0.000000,0.000000,115.739998);
CreateDynamicObject(874,204.789993,1766.140015,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(735,180.179993,1933.000000,15.950000,0.000000,0.000000,313.604828);
CreateDynamicObject(874,163.910004,1902.900024,17.879999,0.000000,0.000000,115.739998);
CreateDynamicObject(874,371.250000,1936.550049,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(16121,235.940002,1746.920044,15.420000,0.000000,0.000000,251.479996);
CreateDynamicObject(1073,157.631012,1831.550171,17.116699,0.000000,0.000000,-90.000000);
CreateDynamicObject(874,195.389999,1769.520020,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(1358,154.050003,1871.319946,17.820000,0.000000,0.000000,-8.000000);
CreateDynamicObject(19589,154.050003,1874.699951,16.930000,0.000000,0.000000,5.000000);
CreateDynamicObject(1073,156.551285,1831.514160,17.116699,0.000000,0.000000,-90.000000);
CreateDynamicObject(1738,160.196396,1816.926392,17.154301,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,153.770004,1883.880005,17.500000,0.000000,0.000000,9.000000);
CreateDynamicObject(3054,153.660004,1885.560059,19.889999,0.000000,0.000000,0.000000);
CreateDynamicObject(16317,357.119995,1959.910034,16.379999,0.000000,0.000000,0.000000);
CreateDynamicObject(1450,154.470001,1896.310059,18.090000,0.000000,0.000000,0.000000);
CreateDynamicObject(1217,157.309998,1905.319946,18.120001,0.000000,0.000000,45.000000);
CreateDynamicObject(1217,157.389999,1906.599976,18.139999,0.000000,0.000000,0.000000);
CreateDynamicObject(735,157.898499,1813.801025,14.580000,0.000000,0.000000,199.649994);
CreateDynamicObject(19906,152.510406,1831.760986,21.764900,0.000000,0.000000,0.000000);
CreateDynamicObject(1448,153.100006,1895.859985,17.549999,0.000000,0.000000,45.000000);
CreateDynamicObject(874,170.110001,1933.569946,17.050461,0.000000,0.000000,183.345062);
CreateDynamicObject(910,157.020004,1908.839966,18.930000,0.000000,0.000000,92.550003);
CreateDynamicObject(735,157.210007,1812.290039,14.580000,0.000000,0.000000,199.649994);
CreateDynamicObject(1368,153.551102,1817.177002,17.332100,0.000000,0.000000,180.000000);
CreateDynamicObject(2690,148.962402,1831.592651,17.867300,0.000000,0.000000,0.000000);
CreateDynamicObject(1075,148.733505,1832.356079,17.120399,0.000000,0.000000,90.000000);
CreateDynamicObject(11699,148.676193,1832.177856,16.636499,0.000000,0.000000,180.000000);
CreateDynamicObject(19900,148.847595,1830.684326,16.647200,0.000000,0.000000,0.000000);
CreateDynamicObject(11743,148.822296,1830.642456,17.521099,0.000000,0.000000,80.000000);
CreateDynamicObject(19900,148.847595,1830.037354,16.647200,0.000000,0.000000,0.000000);
CreateDynamicObject(18977,148.809998,1830.099976,17.620001,0.000000,-25.000000,-15.000000);
CreateDynamicObject(19900,148.847595,1829.398804,16.647200,0.000000,0.000000,0.000000);
CreateDynamicObject(18978,148.800003,1829.729980,17.620001,0.000000,-25.000000,-15.000000);
CreateDynamicObject(18979,148.789993,1829.380005,17.620001,0.000000,-25.000000,15.000000);
CreateDynamicObject(19627,148.930618,1828.653931,17.531401,0.000000,0.000000,-40.000000);
CreateDynamicObject(19900,148.847595,1828.753174,16.647200,0.000000,0.000000,0.000000);
CreateDynamicObject(18645,148.830002,1829.020020,17.620001,0.000000,-25.000000,15.000000);
CreateDynamicObject(19900,148.847595,1828.111206,16.647200,0.000000,0.000000,0.000000);
CreateDynamicObject(1518,149.138306,1827.285156,18.170000,0.000000,0.000000,86.655296);
CreateDynamicObject(19815,148.537598,1829.719238,18.681700,0.000000,0.000000,90.000000);
CreateDynamicObject(1575,148.823013,1828.103149,17.500799,0.000000,0.000000,0.000000);
CreateDynamicObject(19615,149.072693,1827.299683,18.726000,0.000000,0.000000,-90.000000);
CreateDynamicObject(19624,149.213852,1826.565063,18.000999,-90.000000,0.000000,-90.000000);
CreateDynamicObject(19621,149.252899,1826.092773,17.990801,0.000000,0.000000,0.000000);
CreateDynamicObject(19899,148.958099,1826.500122,16.647200,0.000000,0.000000,0.000000);
CreateDynamicObject(19615,149.050797,1826.599243,18.726000,0.000000,0.000000,-90.000000);
CreateDynamicObject(19621,149.323868,1825.398560,17.990801,0.000000,0.000000,-105.000000);
CreateDynamicObject(1650,149.126328,1826.377319,19.476000,0.000000,0.000000,29.086599);
CreateDynamicObject(1650,149.105621,1826.012451,19.476000,0.000000,0.000000,29.086599);
CreateDynamicObject(19621,149.055496,1825.815918,17.990801,0.000000,0.000000,45.000000);
CreateDynamicObject(1650,149.167007,1825.634277,19.476000,0.000000,0.000000,29.086599);
CreateDynamicObject(1578,148.955200,1825.919312,18.261499,0.000000,0.000000,0.000000);
CreateDynamicObject(1578,148.955200,1825.919312,18.727501,0.000000,0.000000,0.000000);
CreateDynamicObject(1579,148.990067,1825.473389,18.261480,0.000000,0.000000,0.000000);
CreateDynamicObject(1577,148.918900,1825.501465,18.727501,0.000000,0.000000,0.000000);
CreateDynamicObject(1738,151.510742,1816.926392,17.154270,0.000000,0.000000,0.000000);
CreateDynamicObject(19900,148.847595,1824.883667,16.647200,0.000000,0.000000,0.000000);
CreateDynamicObject(19873,148.861237,1825.008667,17.579599,0.000000,0.000000,0.000000);
CreateDynamicObject(19627,148.899002,1824.432373,17.531401,0.000000,0.000000,0.000000);
CreateDynamicObject(19900,148.847595,1824.245605,16.647200,0.000000,0.000000,0.000000);
CreateDynamicObject(19627,148.856140,1824.175293,17.531401,0.000000,0.000000,70.000000);
CreateDynamicObject(19900,148.847595,1823.608276,16.647200,0.000000,0.000000,0.000000);
CreateDynamicObject(19631,148.805206,1823.282593,17.551500,0.000000,90.000000,15.000000);
CreateDynamicObject(19900,148.847595,1822.969727,16.647200,0.000000,0.000000,0.000000);
CreateDynamicObject(19900,148.847595,1822.328247,16.647200,0.000000,0.000000,0.000000);
CreateDynamicObject(19815,148.537598,1823.571289,18.681700,0.000000,0.000000,90.000000);
CreateDynamicObject(11729,148.868607,1821.328857,16.626699,0.000000,0.000000,90.000000);
CreateDynamicObject(11729,148.845657,1820.552246,16.626699,0.000000,0.000000,90.000000);
CreateDynamicObject(1074,149.821945,1816.922119,17.132200,0.000000,0.000000,90.000000);
CreateDynamicObject(11729,148.840744,1819.709106,16.626699,0.000000,0.000000,90.000000);
CreateDynamicObject(11729,148.843918,1818.778198,16.626699,0.000000,0.000000,90.000000);
CreateDynamicObject(11729,148.868607,1817.760010,16.626699,0.000000,0.000000,90.000000);
CreateDynamicObject(19817,144.779999,1826.780029,16.360001,0.000000,0.000000,181.050003);
CreateDynamicObject(735,281.630005,1725.000000,15.460000,0.000000,0.000000,90.070000);
CreateDynamicObject(1217,158.160004,1931.680054,18.209999,0.000000,0.000000,0.000000);
CreateDynamicObject(19900,143.190002,1822.329956,16.610001,0.000000,0.000000,0.000000);
CreateDynamicObject(1440,141.080002,1893.079956,17.850000,0.000000,0.000000,0.000000);
CreateDynamicObject(3066,160.000900,1938.711304,19.016001,0.000000,0.000000,90.000000);
CreateDynamicObject(19907,142.009995,1902.530029,17.639999,0.000000,0.000000,-90.000000);
CreateDynamicObject(11459,191.699997,1974.479980,16.629999,0.000000,0.000000,0.000000);
CreateDynamicObject(734,217.449997,1990.910034,16.400000,0.000000,0.000000,97.010002);
CreateDynamicObject(11458,183.750000,1969.670044,16.969999,0.000000,0.000000,0.000000);
CreateDynamicObject(874,152.619995,1933.060059,18.079000,0.000000,0.000000,356.220001);
CreateDynamicObject(874,141.399994,1810.260010,17.001789,0.000000,0.000000,77.949997);
CreateDynamicObject(1439,134.210007,1893.290039,17.410000,0.000000,0.000000,1.730000);
CreateDynamicObject(11457,222.649994,1998.180054,16.290001,0.000000,2.000000,90.000000);
CreateDynamicObject(874,350.769989,1989.530029,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(16121,186.289993,1743.420044,15.720000,0.000000,0.000000,234.699997);
CreateDynamicObject(1438,130.679993,1892.550049,17.250000,0.000000,0.000000,0.000000);
CreateDynamicObject(11457,241.639999,2007.069946,16.180000,0.000000,0.000000,182.820007);
CreateDynamicObject(3461,126.099998,1864.109985,16.200001,0.000000,0.000000,0.000000);
CreateDynamicObject(1362,126.110001,1864.119995,17.389999,0.000000,0.000000,0.000000);
CreateDynamicObject(1448,129.119995,1892.020020,17.350000,2.000000,2.000000,-49.310001);
CreateDynamicObject(13591,131.039993,1820.869995,16.920000,0.000000,0.000000,0.000000);
CreateDynamicObject(933,123.599998,1864.209961,16.750000,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,124.000000,1859.489990,23.250000,0.000000,0.000000,14.000000);
CreateDynamicObject(874,342.570007,2000.939941,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(933,121.919998,1863.619995,17.650000,0.000000,90.000000,92.610001);
CreateDynamicObject(3461,142.639999,1939.979980,17.730000,0.000000,0.000000,0.000000);
CreateDynamicObject(1362,142.649994,1939.989990,18.879999,0.000000,0.000000,0.000000);
CreateDynamicObject(952,126.720001,1903.300049,18.850000,0.000000,0.000000,178.949997);
CreateDynamicObject(695,355.750000,1996.459961,21.420000,0.000000,0.000000,296.390015);
CreateDynamicObject(734,150.869995,1955.239990,16.549999,0.000000,0.000000,312.720001);
CreateDynamicObject(874,126.300003,1809.869995,16.689600,0.000000,0.000000,77.949997);
CreateDynamicObject(735,408.179993,1953.540039,15.250000,0.000000,0.000000,248.759995);
CreateDynamicObject(2890,114.849998,1865.069946,16.780001,0.000000,0.000000,90.000000);
CreateDynamicObject(3593,154.800003,1968.349976,19.160000,0.000000,45.000000,15.000000);
CreateDynamicObject(3594,125.718048,1802.321899,17.047199,0.000000,0.000000,84.812103);
CreateDynamicObject(19313,135.149994,1941.380005,24.750000,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,152.809998,1968.489990,18.700001,0.000000,0.000000,15.000000);
CreateDynamicObject(3461,127.639999,1939.920044,17.910000,0.000000,0.000000,0.000000);
CreateDynamicObject(1362,127.660004,1939.910034,18.900000,0.000000,0.000000,0.000000);
CreateDynamicObject(854,122.559998,1929.859985,18.360001,0.000000,0.000000,0.000000);
CreateDynamicObject(734,106.089996,1865.189941,15.830000,0.000000,0.000000,201.039993);
CreateDynamicObject(874,105.660004,1877.280029,16.289431,0.000000,0.000000,352.369995);
CreateDynamicObject(734,162.850006,1993.650024,16.549999,0.000000,0.000000,1.500000);
CreateDynamicObject(735,249.149994,2034.479980,15.640000,0.000000,-5.000000,146.139999);
CreateDynamicObject(11457,155.130005,1989.250000,17.639999,0.000000,2.000000,0.000000);
CreateDynamicObject(3594,99.009399,1877.776367,17.347200,0.000000,0.000000,0.000000);
CreateDynamicObject(874,120.440002,1953.670044,17.709999,0.000000,0.000000,352.369995);
CreateDynamicObject(12957,153.809998,1998.650024,18.730000,0.000000,0.000000,37.689999);
CreateDynamicObject(851,103.239998,1926.229980,17.670000,0.000000,0.000000,0.000000);
CreateDynamicObject(1217,99.029999,1916.050049,17.650000,0.000000,0.000000,0.000000);
CreateDynamicObject(1217,98.620003,1917.160034,17.650000,0.000000,0.000000,0.000000);
CreateDynamicObject(13591,92.980003,1898.469971,17.150000,0.000000,-2.000000,75.510002);
CreateDynamicObject(735,108.540001,1777.239990,14.070000,0.000000,0.000000,173.910004);
CreateDynamicObject(874,109.349998,1774.329956,17.629999,0.000000,0.000000,0.000000);
CreateDynamicObject(735,114.570000,1959.729980,16.950001,0.000000,0.000000,152.029999);
obj=CreateDynamicObject(19313,96.760002,1921.930054,20.420000,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj,1,18020,"genintintfastb2","cj_burgerwood",0);
CreateDynamicObject(1365,99.379997,1930.430054,18.420000,0.000000,0.000000,90.000000);
CreateDynamicObject(1327,102.400002,1938.349976,17.360001,0.000000,88.000000,0.000000);
CreateDynamicObject(11700,142.736771,1998.573486,18.274500,0.000000,0.000000,0.000000);
CreateDynamicObject(874,162.896225,2017.209595,17.953960,0.000000,0.000000,0.000000);
CreateDynamicObject(874,155.139999,2013.420044,17.752960,0.000000,0.000000,0.000000);
CreateDynamicObject(695,114.750000,1750.050049,21.100000,0.000000,0.000000,2.460000);
CreateDynamicObject(874,101.260002,1774.170044,17.629999,0.000000,0.000000,0.000000);
CreateDynamicObject(874,114.720001,1744.000000,17.629999,0.000000,0.000000,0.000000);
CreateDynamicObject(874,95.029999,1775.750000,17.629999,0.000000,0.000000,0.000000);
CreateDynamicObject(735,126.559998,1701.619995,15.460000,0.000000,0.000000,38.070000);
CreateDynamicObject(874,97.169998,1749.589966,17.629999,0.000000,0.000000,0.000000);
CreateDynamicObject(735,81.709999,1871.000000,15.670000,0.000000,0.000000,152.029999);
CreateDynamicObject(874,83.860001,1759.199951,17.629999,0.000000,0.000000,0.000000);
CreateDynamicObject(841,337.269989,1826.540039,16.719999,0.000000,360.000000,300.000000);
CreateDynamicObject(734,504.355286,1691.994629,10.766800,0.000000,0.000000,-91.199997);
CreateDynamicObject(19843,-1.260100,-2.841300,-0.274800,90.000000,90.000000,180.000000);
CreateDynamicObject(11727,-0.868300,5.883500,0.507100,0.000000,0.000000,180.000000);
CreateDynamicObject(19143,-1.286420,-5.536070,1.830500,0.000000,0.000000,121.541603);
CreateDynamicObject(19843,-1.232500,0.803000,1.294800,90.000000,90.000000,180.000000);
CreateDynamicObject(19843,-1.260100,-3.885000,-0.274800,90.000000,90.000000,180.000000);
CreateDynamicObject(18659,1.347900,1.715700,0.526300,-5.000000,0.000000,180.000000);
CreateDynamicObject(19143,1.290410,-5.549650,1.830500,0.000000,0.000000,236.339325);
CreateDynamicObject(18660,-1.340000,-0.998300,0.672400,5.000000,0.000000,0.000000);
CreateDynamicObject(3042,-0.016860,-2.586150,1.722170,0.000000,0.000000,0.000000);
CreateDynamicObject(11727,0.856700,5.883500,0.507100,0.000000,0.000000,180.000000);
CreateDynamicObject(19601,-0.007200,6.065600,-0.100000,0.000000,0.000000,180.000000);
CreateDynamicObject(18661,1.303600,-0.722500,0.486300,5.000000,0.000000,180.000000);
CreateDynamicObject(1593,1.365000,-3.394900,-0.491400,0.000000,90.000000,0.000000);
CreateDynamicObject(1593,-1.402100,-3.362200,-0.491400,0.000000,90.000000,180.000000);
CreateDynamicObject(1428,0.007400,-5.717300,0.868600,13.000000,0.000000,0.000000);
CreateDynamicObject(1593,-0.036100,-5.930000,-0.491400,0.000000,90.000000,-90.000000);
CreateDynamicObject(19843,1.248700,-2.887500,-0.267400,90.000000,90.000000,0.000000);
CreateDynamicObject(19843,1.248700,-3.934100,-0.267400,90.000000,90.000000,0.000000);
CreateDynamicObject(19843,1.225700,-0.218400,1.294800,90.000000,90.000000,0.000000);
CreateDynamicObject(3030,-0.019900,-3.732940,0.895700,0.000000,0.000000,0.000000);
CreateDynamicObject(19843,1.225700,-1.191600,1.294800,90.000000,90.000000,0.000000);
CreateDynamicObject(967,92.940002,1917.910034,17.760000,271.000000,90.000000,229.100006);
CreateDynamicObject(1358,99.379997,1936.650024,18.500000,0.000000,0.000000,90.000000);
CreateDynamicObject(3594,111.970001,1964.329956,18.350000,0.000000,0.000000,-45.000000);
CreateDynamicObject(874,71.959999,1899.839966,16.822611,0.000000,0.000000,0.000000);
CreateDynamicObject(734,86.900002,1940.589966,16.549999,0.000000,0.000000,5.110000);
CreateDynamicObject(11447,113.250000,1977.209961,18.010000,0.000000,-3.000000,0.000000);
CreateDynamicObject(3594,125.150002,1991.790039,19.070000,0.000000,0.000000,75.000000);
CreateDynamicObject(11447,114.760002,1985.329956,17.990000,-3.000000,0.000000,90.000000);
CreateDynamicObject(11442,82.669998,1949.060059,16.830000,0.000000,-3.000000,0.000000);
CreateDynamicObject(11457,93.790001,1966.689941,16.740000,0.000000,-3.000000,0.000000);
CreateDynamicObject(3594,111.610001,1990.930054,18.490000,0.000000,0.000000,323.170013);
CreateDynamicObject(874,156.220001,2028.189941,17.753981,0.000000,0.000000,75.000000);
CreateDynamicObject(734,106.949997,2003.579956,16.549999,0.000000,0.000000,312.720001);
CreateDynamicObject(2906,106.209999,2002.849976,17.990000,-55.000000,0.000000,-155.000000);
CreateDynamicObject(2907,106.040001,2003.010010,17.910000,-90.000000,0.000000,125.000000);
CreateDynamicObject(2905,105.750000,2002.770020,17.799999,0.000000,90.000000,112.029999);
CreateDynamicObject(2908,105.959999,2003.020020,18.450001,-90.000000,0.000000,19.290001);
CreateDynamicObject(2905,105.629997,2003.000000,17.799999,0.000000,90.000000,112.029999);
CreateDynamicObject(874,112.959999,2013.180054,17.650949,0.000000,0.000000,15.000000);
CreateDynamicObject(874,116.120003,2022.760010,17.753981,0.000000,0.000000,15.000000);
CreateDynamicObject(874,100.220001,2016.530029,17.650949,0.000000,0.000000,15.000000);
CreateDynamicObject(11457,49.830002,1931.189941,16.170000,0.000000,0.000000,90.000000);
CreateDynamicObject(874,67.830002,1985.530029,18.049999,0.000000,0.000000,0.000000);
CreateDynamicObject(695,47.189999,1880.270020,21.139999,0.000000,0.000000,20.040001);
CreateDynamicObject(874,103.269997,2028.750000,17.648001,0.000000,0.000000,15.000000);
CreateDynamicObject(874,40.669998,1913.609985,17.219900,0.000000,0.000000,0.000000);
CreateDynamicObject(874,58.410000,1988.489990,17.139950,0.000000,0.000000,0.000000);
CreateDynamicObject(790,46.139999,1977.430054,21.639999,0.000000,0.000000,0.000000);
CreateDynamicObject(695,35.779999,1861.670044,21.219999,0.000000,0.000000,312.380005);
CreateDynamicObject(720,219.720001,2067.050049,10.650000,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,17.110001,1879.140015,17.120001,0.000000,0.000000,25.740000);
CreateDynamicObject(735,150.669998,2075.060059,16.889999,0.000000,0.000000,152.029999);
CreateDynamicObject(16121,28.090000,1828.959961,15.880000,0.000000,0.000000,50.570000);
CreateDynamicObject(874,252.330002,2073.830078,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(1950,214.293076,1932.201538,16.950001,0.000000,360.000000,250.000000);
CreateDynamicObject(874,444.857452,1625.822754,14.947700,-1.740000,4.860000,-10.800000);
CreateDynamicObject(3594,448.173401,1626.277344,16.150600,2.280000,0.600000,83.519997);
CreateDynamicObject(874,485.300812,1650.827515,14.553700,0.000000,0.000000,52.380001);
CreateDynamicObject(874,495.272095,1654.185791,13.553700,0.000000,0.000000,0.000000);
CreateDynamicObject(1308,400.554810,1593.923218,16.813801,0.858400,90.000000,-1.343900);
CreateDynamicObject(874,575.506287,1797.538452,12.735400,0.000000,0.000000,-20.760000);
CreateDynamicObject(851,575.752625,1785.331787,12.439500,0.000000,0.000000,2.220000);
CreateDynamicObject(1355,540.976868,1694.383667,10.053600,0.000000,10.000000,-148.620041);
CreateDynamicObject(16305,544.090088,1696.777954,10.979500,0.000000,0.000000,0.000000);
CreateDynamicObject(850,577.703125,1781.555298,12.377800,0.000000,0.000000,172.679901);
CreateDynamicObject(850,576.477722,1764.762451,11.337800,6.000000,0.000000,10.880000);
CreateDynamicObject(3594,577.239685,1766.874268,11.920300,8.020000,0.000000,-299.291290);
CreateDynamicObject(874,550.697021,1698.249146,9.363400,0.000000,0.000000,0.000000);
CreateDynamicObject(1328,526.508179,1649.542236,10.029600,0.000000,90.000000,-122.760002);
CreateDynamicObject(874,529.354980,1649.629883,9.522030,0.000000,0.000000,0.000000);
CreateDynamicObject(874,401.187195,1578.492188,16.276699,0.000000,0.000000,-52.380001);
CreateDynamicObject(1327,575.885681,1700.808105,7.870500,0.000000,90.000000,0.000000);
CreateDynamicObject(735,449.546906,1584.415161,6.705400,0.000000,0.000000,22.740000);
CreateDynamicObject(734,452.630890,1575.220459,8.585600,0.000000,0.000000,-50.279999);
CreateDynamicObject(1308,606.425781,1730.059204,5.621300,96.858398,90.000000,64.054001);
CreateDynamicObject(3594,584.517212,1678.237793,6.572400,0.000000,0.000000,0.000000);
CreateDynamicObject(1686,606.096069,1701.896362,6.179700,356.858398,30.000000,-132.227783);
CreateDynamicObject(874,627.229370,1744.155762,4.896500,0.000000,0.000000,86.459999);
CreateDynamicObject(1686,610.336548,1698.436768,6.179700,356.858398,90.000000,-208.547668);
CreateDynamicObject(874,388.176117,1554.185181,13.852240,0.000000,0.000000,0.000000);
CreateDynamicObject(874,613.750427,1698.704224,6.262900,0.000000,0.000000,0.000000);
CreateDynamicObject(11700,630.259216,1734.174683,4.486160,-10.000000,15.000000,254.516724);
CreateDynamicObject(1220,571.694519,1634.066162,6.305600,0.000000,0.000000,-66.780006);
CreateDynamicObject(874,650.366821,1804.216797,5.235000,0.000000,0.000000,-21.660000);
CreateDynamicObject(1220,572.677612,1632.989380,6.305600,0.000000,0.000000,-20.160000);
CreateDynamicObject(874,576.822571,1634.861450,6.776000,0.000000,0.000000,0.000000);
CreateDynamicObject(1220,579.621277,1637.226807,6.325600,0.000000,0.000000,0.000000);
CreateDynamicObject(874,654.280334,1813.212402,4.455020,0.000000,0.000000,-77.339996);
CreateDynamicObject(1327,580.498413,1634.704956,5.870500,0.000000,90.000000,0.000000);
CreateDynamicObject(853,653.545776,1752.145264,5.033200,2.400000,0.000000,0.000000);
CreateDynamicObject(1308,655.388428,1751.654907,4.533100,3.102900,88.005096,-122.689598);
CreateDynamicObject(1686,625.147766,1676.830811,6.179700,356.858398,90.000000,-12.167800);
CreateDynamicObject(2674,665.389587,1775.952637,5.554300,3.000000,0.000000,216.720001);
CreateDynamicObject(874,670.199829,1832.658203,4.190850,0.000000,0.000000,0.000000);
CreateDynamicObject(1219,670.456665,1834.362549,4.447200,30.000000,0.000000,0.000000);
CreateDynamicObject(1219,670.640015,1836.005981,4.327200,0.000000,0.000000,0.000000);
CreateDynamicObject(1349,651.663208,1719.992188,6.542600,90.000000,0.000000,92.801033);
CreateDynamicObject(734,590.194763,1626.974609,6.229230,0.000000,0.000000,0.000000);
CreateDynamicObject(1308,655.126343,1937.107910,4.594700,90.745796,-0.015600,55.351391);
CreateDynamicObject(874,658.366394,1724.756836,5.984940,0.000000,0.000000,0.000000);
CreateDynamicObject(2943,640.165222,1687.284546,6.262700,0.000000,90.000000,173.160004);
CreateDynamicObject(1440,655.436523,1715.912598,6.562600,0.000000,0.000000,0.000000);
CreateDynamicObject(765,669.852356,1907.439087,4.693800,0.000000,90.000000,128.880005);
CreateDynamicObject(1349,663.447266,1725.873535,6.542600,0.000000,0.000000,0.000000);
CreateDynamicObject(874,683.237915,1814.157715,4.785600,0.000000,0.000000,58.799999);
CreateDynamicObject(1299,685.498352,1824.408325,4.287770,0.000000,0.000000,0.000000);
CreateDynamicObject(1264,686.130127,1824.723145,5.902800,0.000000,0.000000,285.073914);
CreateDynamicObject(1338,674.620789,1747.735840,6.359000,-7.000000,0.000000,29.400000);
CreateDynamicObject(1264,686.918030,1826.738892,4.477900,0.000000,0.000000,0.000000);
CreateDynamicObject(18451,652.818787,1691.015015,6.285900,0.000000,0.000000,-25.680000);
CreateDynamicObject(1345,690.363098,1824.390259,4.922500,0.000000,0.000000,0.000000);
CreateDynamicObject(1468,654.315735,1691.713013,7.026300,30.141600,0.000000,-31.604799);
CreateDynamicObject(734,686.202698,1773.470215,5.458200,10.000000,0.000000,93.059921);
CreateDynamicObject(961,694.040527,1849.433838,5.270400,0.000000,180.000000,33.540001);
CreateDynamicObject(734,691.637634,1883.356201,4.523800,0.000000,0.000000,0.000000);
CreateDynamicObject(2676,667.217590,1700.717651,6.403600,0.000000,0.000000,0.000000);
CreateDynamicObject(1344,668.359619,1702.007446,6.655310,90.080002,0.000000,-8.340010);
CreateDynamicObject(926,699.607788,1836.220825,4.723300,1.060000,3.000000,-170.160004);
CreateDynamicObject(734,654.483826,1676.520874,5.089200,0.000000,10.000000,-188.520004);
CreateDynamicObject(1468,668.101074,1697.630005,7.406300,20.858400,0.000000,34.264400);
CreateDynamicObject(854,700.959412,1836.603394,4.830600,-4.674000,0.000000,110.399963);
CreateDynamicObject(747,691.860535,1906.111938,4.963000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,707.688171,1853.771973,5.597200,0.000000,0.000000,22.139999);
CreateDynamicObject(735,559.824280,1578.121704,-0.240600,0.000000,0.000000,223.739944);
CreateDynamicObject(849,688.867798,1948.822388,4.792700,0.000000,0.000000,1.666800);
CreateDynamicObject(683,685.357117,1697.788452,3.849100,0.000000,0.000000,-17.820000);
CreateDynamicObject(3593,698.718689,1933.985962,4.987200,0.000000,0.000000,-62.099998);
CreateDynamicObject(926,700.778625,1934.121460,5.653400,0.000000,8.000000,-22.980000);
CreateDynamicObject(1230,700.697937,1935.580200,5.798200,0.000000,0.000000,0.000000);
CreateDynamicObject(874,661.205139,2014.480835,7.833410,0.000000,0.000000,0.000000);
CreateDynamicObject(3419,602.361023,1589.060547,4.412700,0.000000,0.000000,17.580021);
CreateDynamicObject(3244,729.541504,1879.057495,6.655600,92.141602,90.000000,-124.636398);
CreateDynamicObject(874,711.498718,1947.142822,6.128700,0.000000,0.000000,65.580002);
CreateDynamicObject(874,602.795715,1582.960327,4.133410,0.000000,0.000000,16.259991);
CreateDynamicObject(1218,431.304901,1535.548584,10.946100,0.000000,0.000000,-44.820000);
CreateDynamicObject(874,629.052368,1600.392334,7.040210,0.000000,0.000000,0.000000);
CreateDynamicObject(918,434.506104,1534.805420,10.786900,0.000000,0.000000,-37.320000);
CreateDynamicObject(669,709.250427,1960.368652,4.413100,356.858398,10.000000,3.141600);
obj=CreateDynamicObject(19993,699.543396,1980.559204,7.618300,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,1453,"break_farm","CJ_HAY",0);
CreateDynamicObject(1438,433.076691,1533.985352,10.461400,0.000000,0.000000,53.700001);
CreateDynamicObject(1218,429.911957,1533.792480,10.946100,0.000000,0.000000,-199.919983);
CreateDynamicObject(3593,647.940979,1612.412598,6.394100,0.000000,0.000000,0.000000);
CreateDynamicObject(1327,645.370789,1610.046143,6.140000,0.000000,90.000000,0.000000);
CreateDynamicObject(3286,416.481689,1534.668945,13.620000,30.000000,0.000000,-144.600204);
CreateDynamicObject(874,370.700012,2115.899902,17.010000,0.000000,0.000000,350.660004);
CreateDynamicObject(3286,425.354065,1533.201294,15.120000,0.000000,0.000000,1.320000);
CreateDynamicObject(734,489.160187,1535.732178,-0.200700,0.000000,0.000000,160.980011);
CreateDynamicObject(874,650.676147,1611.074951,5.502090,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,646.548584,1606.736450,6.340000,0.000000,0.000000,94.019997);
CreateDynamicObject(874,426.476013,1531.306396,10.486800,0.000000,0.000000,-104.939987);
CreateDynamicObject(1327,653.136414,1610.824097,5.438000,0.000000,90.000000,0.000000);
CreateDynamicObject(874,738.319824,1915.066895,5.108900,0.000000,0.000000,82.080002);
CreateDynamicObject(874,607.741333,1572.097046,4.133410,0.000000,0.000000,-76.620003);
CreateDynamicObject(3593,653.722473,1605.942871,6.064500,0.000000,180.000000,-49.680000);
CreateDynamicObject(850,431.179291,1528.347168,10.585900,0.000000,0.000000,-32.520000);
CreateDynamicObject(16370,429.765015,1526.589844,11.400000,0.000000,0.000000,270.779968);
CreateDynamicObject(866,445.977600,1525.260376,7.791000,0.000000,0.000000,-21.840000);
CreateDynamicObject(773,755.869629,1752.324341,3.673100,0.000000,10.000000,-145.199997);
CreateDynamicObject(3865,627.270203,1569.700806,6.431100,0.000000,0.000000,-39.660000);
CreateDynamicObject(874,630.746277,1570.179932,4.986840,0.000000,0.000000,0.000000);
CreateDynamicObject(1440,670.620789,1599.789673,5.301700,0.000000,0.000000,-49.560001);
CreateDynamicObject(866,441.857086,1522.895142,8.730960,0.000000,0.000000,48.840000);
CreateDynamicObject(3414,670.804321,1596.854736,6.960000,0.000000,0.000000,-53.040001);
CreateDynamicObject(3502,634.229980,1563.900513,5.521370,0.000000,0.000000,35.220001);
CreateDynamicObject(1412,488.027130,1520.087524,1.239900,0.000000,0.000000,0.000000);
CreateDynamicObject(1413,493.232605,1520.137939,1.217600,0.000000,0.000000,2.820000);
CreateDynamicObject(735,654.693054,1573.772827,5.206200,0.000000,0.000000,-96.120003);
CreateDynamicObject(735,779.104919,1804.259644,2.659200,0.000000,0.000000,-103.800003);
CreateDynamicObject(1447,485.290985,1517.441528,1.080000,0.000000,0.000000,-91.080002);
CreateDynamicObject(874,425.722534,1521.712524,10.489880,0.000000,0.000000,54.240009);
CreateDynamicObject(695,531.149719,1520.566528,5.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(2943,776.845581,1880.962158,4.554000,0.000000,20.000000,91.980003);
CreateDynamicObject(850,432.812714,1519.390137,10.587000,0.000000,0.000000,0.000000);
CreateDynamicObject(3244,720.977539,1629.057739,1.000000,30.000000,0.000000,-157.156403);
CreateDynamicObject(874,782.530884,1861.822876,4.309400,0.000000,0.000000,0.000000);
CreateDynamicObject(866,445.068787,1517.144653,8.730960,0.000000,0.000000,0.000000);
CreateDynamicObject(1308,756.245178,1944.895142,4.726340,356.890686,90.112801,27.166201);
CreateDynamicObject(1440,780.063354,1890.639404,4.573100,0.000000,0.000000,-102.839996);
CreateDynamicObject(850,435.751434,1517.482178,10.587000,0.000000,0.000000,57.960041);
CreateDynamicObject(874,493.184021,1512.871094,-0.107000,0.000000,0.000000,27.900000);
CreateDynamicObject(3337,793.970703,1834.730835,3.974200,-2.163600,90.000000,-90.709099);
CreateDynamicObject(918,494.291870,1511.015869,0.315400,0.000000,0.000000,-27.480000);
CreateDynamicObject(765,800.101074,1832.560791,3.334600,0.000000,0.000000,0.000000);
CreateDynamicObject(918,492.691620,1510.255249,0.315400,0.000000,0.000000,-27.480000);
CreateDynamicObject(1225,491.590240,1509.990601,0.375600,0.000000,0.000000,-28.920000);
CreateDynamicObject(866,439.048584,1516.023926,9.231000,0.000000,0.000000,48.840000);
CreateDynamicObject(1440,668.823975,2059.052490,12.194400,6.780000,0.420000,0.000000);
CreateDynamicObject(18451,791.670776,1899.273682,4.585900,0.000000,0.000000,-38.160000);
CreateDynamicObject(18262,786.590881,1932.337280,6.042800,30.000000,0.000000,38.820000);
CreateDynamicObject(874,789.395142,1930.441895,5.215800,0.000000,0.000000,-21.000000);
CreateDynamicObject(874,805.146790,1722.025513,5.002200,0.000000,0.000000,0.000000);
CreateDynamicObject(734,695.062317,1564.167236,5.013500,0.000000,0.000000,-36.480000);
CreateDynamicObject(874,821.030518,1764.814209,2.949640,0.000000,0.000000,0.000000);
CreateDynamicObject(874,798.989929,1679.405396,5.081700,0.000000,0.000000,67.620003);
CreateDynamicObject(3593,821.801941,1702.989014,4.611000,0.000000,0.000000,45.419998);
CreateDynamicObject(735,471.931305,1506.556519,-0.524800,0.000000,0.000000,0.000000);
CreateDynamicObject(3419,493.060303,1501.817017,0.040000,0.060000,0.000000,0.300000);
CreateDynamicObject(3594,827.232178,1708.937378,5.118900,0.000000,0.000000,-10.080000);
CreateDynamicObject(874,814.854004,1950.957642,6.013000,0.000000,0.000000,0.000000);
CreateDynamicObject(1308,808.098877,1970.129150,7.367000,356.890686,90.112801,-47.293781);
CreateDynamicObject(734,862.533325,1833.768066,8.988560,0.000000,0.000000,0.000000);
CreateDynamicObject(1440,494.337402,1499.576050,0.513700,0.000000,0.000000,-88.139999);
CreateDynamicObject(874,485.588287,1498.748901,-0.003560,0.000000,0.000000,18.240000);
CreateDynamicObject(866,494.470093,1494.420288,-0.065400,0.000000,0.000000,75.180000);
CreateDynamicObject(866,491.198853,1493.189575,-0.065400,0.000000,0.000000,17.400000);
CreateDynamicObject(866,493.427551,1491.765625,-0.065400,0.000000,0.000000,75.180000);
CreateDynamicObject(874,880.573914,1873.900391,10.126310,0.000000,0.000000,337.322845);
CreateDynamicObject(874,888.091919,1856.150391,10.532350,0.000000,0.000000,0.000000);
CreateDynamicObject(18451,881.820557,1888.154419,10.107400,0.000000,0.000000,151.162033);
CreateDynamicObject(690,578.218079,1460.392456,4.000000,0.000000,0.000000,-108.959999);
CreateDynamicObject(3244,888.065918,1876.496826,13.955100,94.500000,0.000000,23.667200);
CreateDynamicObject(874,851.044678,1558.936157,16.988529,0.000000,0.000000,0.000000);
CreateDynamicObject(874,890.066772,1887.312500,10.540510,0.000000,0.000000,351.326813);
CreateDynamicObject(3594,799.692993,1496.880005,18.400299,0.000000,0.000000,-229.200043);
CreateDynamicObject(3460,909.636414,1850.609253,9.905600,356.858398,90.000000,7.129200);
CreateDynamicObject(1575,654.539978,1715.660034,6.230000,0.000000,360.000000,300.000000);
CreateDynamicObject(2891,663.419983,1726.530029,6.190000,0.000000,360.000000,300.000000);
CreateDynamicObject(645,945.721741,1745.620605,7.390600,356.858398,30.000000,158.700211);
CreateDynamicObject(1950,647.105103,1703.331177,6.292188,0.000000,360.000000,250.000000);
CreateDynamicObject(2768,647.105103,1703.331177,6.292188,0.000000,360.000000,250.000000);
CreateDynamicObject(874,958.302979,1741.277588,8.454400,0.000000,0.000000,0.000000);
CreateDynamicObject(2671,663.830017,1708.650024,798.380005,0.000000,0.000000,180.000000);
CreateDynamicObject(1349,662.159973,1708.300049,798.750000,-90.000000,0.000000,303.179993);
CreateDynamicObject(928,664.890015,1710.670044,798.609985,0.000000,0.000000,0.000000);
CreateDynamicObject(1950,665.619995,1710.010010,798.770020,0.000000,360.000000,300.000000);
CreateDynamicObject(2412,661.640015,1710.239990,798.150024,0.000000,95.000000,45.000000);
CreateDynamicObject(928,664.919983,1711.520020,798.630005,0.000000,0.000000,97.000000);
CreateDynamicObject(2676,662.179993,1706.969971,798.469971,0.000000,0.000000,0.000000);
CreateDynamicObject(1849,665.580017,1707.119995,798.369995,0.000000,0.000000,90.000000);
CreateDynamicObject(1849,665.580017,1712.109985,798.369995,0.000000,0.000000,90.000000);
CreateDynamicObject(2671,662.690002,1706.069946,798.380005,0.000000,0.000000,45.000000);
CreateDynamicObject(1561,661.270020,1712.109985,798.369995,0.000000,0.000000,90.000000);
CreateDynamicObject(1349,661.969971,1705.890015,798.929993,0.000000,0.000000,-90.000000);
CreateDynamicObject(2671,663.700012,1712.989990,798.380005,0.000000,0.000000,90.000000);
CreateDynamicObject(1349,666.650024,1712.430054,798.929993,0.000000,0.000000,287.000000);
CreateDynamicObject(1672,665.700012,1713.150024,798.770020,0.000000,360.000000,300.000000);
CreateDynamicObject(1561,661.260010,1713.609985,798.369995,0.000000,0.000000,90.000000);
CreateDynamicObject(2671,664.359985,1704.670044,798.380005,0.000000,0.000000,90.000000);
CreateDynamicObject(1885,662.679993,1714.180054,798.349976,0.000000,0.000000,90.000000);
CreateDynamicObject(1842,668.549988,1708.890015,798.830017,0.000000,0.000000,90.000000);
CreateDynamicObject(1264,668.190002,1711.439941,798.799988,0.000000,0.000000,75.000000);
CreateDynamicObject(1349,661.989990,1704.439941,798.929993,0.000000,0.000000,-90.000000);
CreateDynamicObject(2671,667.549988,1706.369995,798.380005,0.000000,0.000000,131.089996);
CreateDynamicObject(1986,661.780029,1714.250000,798.250000,0.000000,0.000000,0.000000);
CreateDynamicObject(1842,668.549988,1711.849976,798.830017,0.000000,0.000000,90.000000);
CreateDynamicObject(1264,668.349976,1712.589966,798.799988,0.000000,0.000000,75.000000);
CreateDynamicObject(841,668.580017,1712.520020,799.229980,0.000000,360.000000,300.000000);
CreateDynamicObject(1349,662.000000,1703.010010,798.929993,0.000000,0.000000,-90.000000);
CreateDynamicObject(2671,667.770020,1704.189941,798.380005,0.000000,0.000000,0.000000);
CreateDynamicObject(19592,664.429993,1702.400024,798.869995,0.000000,0.000000,290.410004);
CreateDynamicObject(19570,664.409973,1702.290039,798.369995,0.000000,360.000000,300.000000);
CreateDynamicObject(1842,668.549988,1714.839966,798.830017,0.000000,0.000000,90.000000);
CreateDynamicObject(2671,669.929993,1705.729980,798.380005,0.000000,0.000000,180.000000);
CreateDynamicObject(1513,662.640015,1717.300049,799.570007,0.000000,0.000000,90.000000);
CreateDynamicObject(1849,664.219971,1701.680054,798.369995,0.000000,0.000000,180.000000);
CreateDynamicObject(1984,662.820007,1717.219971,798.349976,0.000000,0.000000,-90.000000);
CreateDynamicObject(1849,665.580017,1717.079956,798.369995,0.000000,0.000000,90.000000);
CreateDynamicObject(2671,667.260010,1716.469971,798.380005,0.000000,0.000000,90.000000);
CreateDynamicObject(19579,671.520020,1708.449951,798.770020,0.000000,360.000000,300.000000);
CreateDynamicObject(1575,671.570007,1710.819946,798.770020,0.000000,360.000000,300.000000);
CreateDynamicObject(1849,671.669983,1707.119995,798.369995,0.000000,0.000000,-90.000000);
CreateDynamicObject(1849,671.669983,1712.109985,798.369995,0.000000,0.000000,-90.000000);
CreateDynamicObject(1575,671.500000,1705.880005,798.770020,0.000000,360.000000,300.000000);
CreateDynamicObject(1950,667.909973,1701.839966,798.770020,0.000000,360.000000,300.000000);
CreateDynamicObject(19897,671.590027,1713.180054,798.770020,0.000000,360.000000,300.000000);
CreateDynamicObject(19587,671.169983,1704.459961,798.750000,90.000000,0.000000,313.519989);
CreateDynamicObject(1973,662.859985,1718.750000,799.099976,0.000000,0.000000,90.000000);
CreateDynamicObject(1338,670.669983,1703.319946,799.049988,0.000000,0.000000,15.000000);
CreateDynamicObject(11736,663.640015,1718.839966,798.369995,0.000000,360.000000,300.000000);
CreateDynamicObject(1849,669.210022,1701.680054,798.369995,0.000000,0.000000,180.000000);
CreateDynamicObject(19897,666.479980,1718.640015,798.369995,0.000000,360.000000,300.000000);
CreateDynamicObject(2769,669.739990,1701.839966,798.770020,0.000000,360.000000,300.000000);
CreateDynamicObject(1513,663.380005,1719.609985,798.500000,-90.000000,90.000000,127.059998);
CreateDynamicObject(1349,670.150024,1717.589966,798.750000,-90.000000,0.000000,75.000000);
CreateDynamicObject(2671,664.559998,1720.459961,798.380005,0.000000,0.000000,0.000000);
CreateDynamicObject(1264,661.909973,1720.550049,798.669983,0.000000,0.000000,45.000000);
CreateDynamicObject(1849,671.669983,1717.099976,798.369995,0.000000,0.000000,-90.000000);
CreateDynamicObject(1264,662.770020,1720.839966,798.669983,0.000000,0.000000,75.000000);
CreateDynamicObject(1264,662.150024,1721.469971,798.669983,0.000000,0.000000,0.000000);
CreateDynamicObject(1850,668.150024,1720.859985,798.750000,-90.000000,-90.000000,119.860001);
CreateDynamicObject(1672,662.789978,1722.530029,798.719971,0.000000,360.000000,300.000000);
CreateDynamicObject(1849,664.219971,1722.609985,798.369995,0.000000,0.000000,0.000000);
CreateDynamicObject(19576,665.849976,1722.530029,798.729980,0.000000,360.000000,300.000000);
CreateDynamicObject(1575,671.210022,1720.780029,798.369995,0.000000,360.000000,300.000000);
CreateDynamicObject(11748,669.059998,1722.479980,798.729980,0.000000,360.000000,300.000000);
CreateDynamicObject(1849,669.210022,1722.630005,798.369995,0.000000,0.000000,0.000000);
CreateDynamicObject(19576,670.880005,1722.459961,798.729980,0.000000,360.000000,300.000000);
CreateDynamicObject(1230,422.741058,1518.140259,10.909000,0.000000,0.000000,-117.960022);
CreateDynamicObject(735,595.336670,1417.312744,9.197800,0.000000,0.000000,-80.220001);
CreateDynamicObject(926,421.472504,1518.344360,10.749900,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,429.652405,1508.468018,10.842000,0.000000,0.000000,68.339996);
CreateDynamicObject(1230,421.576813,1517.062622,10.909000,0.000000,0.000000,-34.200001);
CreateDynamicObject(1440,418.931793,1518.721680,10.963200,0.000000,0.000000,133.440002);
CreateDynamicObject(3594,496.083710,1449.981323,3.576700,0.000000,0.000000,-179.699905);
CreateDynamicObject(866,485.476318,1456.597778,3.217500,0.000000,0.000000,-43.740002);
CreateDynamicObject(1449,414.885406,1520.206421,10.968700,0.000000,0.000000,91.980003);
CreateDynamicObject(866,482.715485,1455.981934,3.217500,0.000000,0.000000,-43.740002);
CreateDynamicObject(866,480.770508,1452.583618,3.217500,0.000000,0.000000,-43.740002);
CreateDynamicObject(874,504.601196,1435.405029,3.433140,0.000000,0.000000,0.000000);
CreateDynamicObject(1431,487.281006,1446.681396,3.342900,0.000000,0.000000,-92.519997);
CreateDynamicObject(874,770.385132,1412.367920,18.623770,0.000000,0.000000,0.000000);
CreateDynamicObject(874,424.400604,1506.081299,10.322900,0.000000,0.000000,56.520000);
CreateDynamicObject(3403,484.007446,1447.448730,6.056700,0.000000,0.000000,-269.879761);
CreateDynamicObject(874,489.968140,1443.093628,2.836500,0.000000,0.000000,-143.580002);
CreateDynamicObject(3594,496.709412,1438.050659,3.156700,0.000000,0.000000,-231.119904);
CreateDynamicObject(1431,487.246613,1444.423218,3.322900,0.000000,0.000000,-92.519997);
CreateDynamicObject(3594,426.282837,1502.286255,10.863200,0.000000,0.000000,181.020035);
CreateDynamicObject(1438,484.538910,1445.088623,2.931000,0.000000,0.000000,47.160000);
CreateDynamicObject(1448,484.432343,1442.389771,4.386900,0.000000,0.000000,-35.880001);
CreateDynamicObject(944,483.817963,1442.328125,3.747600,0.000000,0.000000,0.000000);
CreateDynamicObject(19473,686.030029,1694.900024,4.390000,0.000000,360.000000,300.000000);
CreateDynamicObject(926,483.022888,1442.512329,4.547100,0.000000,0.000000,37.320000);
CreateDynamicObject(3593,967.574036,1716.833130,8.002000,0.000000,0.000000,43.200001);
CreateDynamicObject(874,982.742432,1741.744751,8.454400,0.000000,0.000000,-85.260033);
CreateDynamicObject(874,975.719116,1780.775879,8.454400,0.000000,0.000000,-190.380020);
CreateDynamicObject(888,931.266418,1869.638550,9.770700,0.000000,0.000000,-63.360001);
CreateDynamicObject(1250,999.184998,1761.079956,10.291600,183.141602,90.000000,-66.458397);
CreateDynamicObject(1251,1002.777161,1761.497314,9.953600,3.081600,0.000000,101.361603);
CreateDynamicObject(3460,953.118896,1856.858398,9.943100,180.141602,90.000000,303.479889);
CreateDynamicObject(3460,1002.549683,1785.328857,10.185600,9.381600,90.000000,-42.769199);
CreateDynamicObject(1327,905.697021,1905.971436,9.629100,0.000000,90.000000,0.000000);
CreateDynamicObject(1299,899.944519,1910.845337,10.247600,0.000000,0.000000,0.000000);
CreateDynamicObject(1357,904.220093,1912.081543,10.057100,0.000000,0.000000,-148.440033);
CreateDynamicObject(816,940.208252,1883.669678,10.067400,0.000000,0.000000,0.000000);
CreateDynamicObject(1357,904.899963,1912.977173,10.057100,0.000000,20.000000,44.220009);
CreateDynamicObject(821,942.664673,1888.531372,8.646900,0.000000,0.000000,0.000000);
CreateDynamicObject(18451,942.851196,1888.819580,10.107400,0.000000,0.000000,55.439999);
CreateDynamicObject(735,905.586670,1410.614746,11.829800,0.000000,0.000000,-25.259991);
CreateDynamicObject(874,1010.727966,1814.591431,10.384700,0.000000,0.000000,22.379999);
CreateDynamicObject(3514,1038.966797,1809.075928,10.092200,90.098396,0.000000,137.809097);
CreateDynamicObject(1343,1019.791382,1841.966797,10.374000,0.000000,90.000000,-51.240002);
CreateDynamicObject(2672,1021.989319,1839.506470,10.434200,0.000000,0.000000,0.000000);
CreateDynamicObject(12957,1015.347717,1849.667114,10.518000,0.000000,0.000000,0.000000);
CreateDynamicObject(692,908.508911,1941.877319,9.814620,0.000000,0.000000,0.000000);
CreateDynamicObject(2906,1028.342285,1844.317749,11.421400,-120.000000,90.000000,0.000000);
CreateDynamicObject(1369,1028.243774,1844.586792,11.015700,0.000000,0.000000,278.936310);
CreateDynamicObject(2907,1028.275146,1844.568726,11.381400,-75.000000,0.000000,90.000000);
CreateDynamicObject(2908,1028.347412,1844.599854,11.887400,-90.000000,0.000000,0.000000);
CreateDynamicObject(2906,1028.385742,1844.891602,11.461400,-50.000000,-90.000000,0.000000);
CreateDynamicObject(1486,1028.461548,1845.067383,11.172400,70.000000,0.000000,-90.000000);
CreateDynamicObject(1292,1010.472229,1871.086304,10.000800,0.000000,90.000000,-36.720001);
CreateDynamicObject(821,1001.743774,1886.981567,9.125000,0.000000,0.000000,0.000000);
CreateDynamicObject(8302,929.790833,1947.057617,10.083100,0.000000,0.000000,73.619957);
CreateDynamicObject(874,909.734680,1970.375854,9.588700,0.000000,0.000000,0.000000);
CreateDynamicObject(874,909.034973,1970.915771,10.068700,0.000000,0.000000,0.000000);
CreateDynamicObject(1951,825.349976,1707.890015,4.530000,0.000000,360.000000,300.000000);
CreateDynamicObject(765,928.048889,1964.688599,9.764600,0.000000,0.000000,-123.419998);
CreateDynamicObject(692,928.105103,1964.723999,9.814620,0.000000,0.000000,0.000000);
CreateDynamicObject(692,952.811584,1956.028076,9.814620,0.000000,0.000000,0.000000);
CreateDynamicObject(874,917.093994,1973.398926,9.588700,0.000000,0.000000,0.000000);
CreateDynamicObject(888,919.223755,1975.897705,9.815720,0.000000,0.000000,-207.480011);
CreateDynamicObject(18451,933.729797,1970.717163,10.067400,0.000000,0.000000,64.260002);
CreateDynamicObject(3459,1010.464783,1929.339966,9.987500,75.141602,90.000000,167.121597);
CreateDynamicObject(759,825.745667,1998.024170,8.377730,0.000000,0.000000,0.000000);
CreateDynamicObject(874,940.955811,1974.142090,10.863800,0.000000,0.000000,20.520000);
CreateDynamicObject(692,1003.087463,1949.973389,9.814620,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,1008.342529,1949.196655,10.362100,0.000000,0.000000,39.419998);
CreateDynamicObject(2675,904.874390,2004.257568,9.805200,0.000000,0.000000,0.000000);
CreateDynamicObject(1327,1030.862671,1943.666382,10.750500,0.000000,10.000000,-89.040001);
CreateDynamicObject(1448,903.628235,2006.183716,9.719500,0.000000,0.000000,14.040000);
CreateDynamicObject(1327,1030.859131,1945.445068,9.817600,0.000000,90.000000,0.000000);
CreateDynamicObject(1448,904.221741,2006.291870,9.899500,0.000000,20.000000,0.000000);
CreateDynamicObject(874,892.271301,2012.527100,10.227700,0.000000,0.000000,0.000000);
CreateDynamicObject(3168,792.533813,2011.664551,5.050000,3.141600,90.000000,58.636299);
CreateDynamicObject(3460,904.811951,2011.534424,9.925600,3.141600,90.000000,29.530800);
CreateDynamicObject(1327,1033.711182,1955.586914,9.607600,0.000000,90.000000,0.000000);
CreateDynamicObject(874,907.979248,2013.864136,10.167530,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1040.836060,1954.145630,10.506100,0.000000,0.000000,18.000000);
CreateDynamicObject(3168,883.414185,2017.942383,10.957200,3.141600,90.000000,327.196289);
CreateDynamicObject(874,1152.847046,1763.662476,8.959030,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1025.032715,1975.674072,10.870400,0.000000,0.000000,-9.420000);
CreateDynamicObject(874,1073.798584,1939.449341,10.043500,0.000000,0.000000,0.000000);
CreateDynamicObject(685,1023.563904,1979.476929,8.921700,0.000000,10.000000,115.260017);
CreateDynamicObject(874,889.031799,2024.403687,10.227700,0.000000,0.000000,81.659988);
CreateDynamicObject(734,1174.348633,1779.341797,9.022500,0.000000,0.000000,-66.419998);
CreateDynamicObject(3460,1005.306396,1999.061523,9.809200,356.858398,90.000000,-31.630800);
CreateDynamicObject(1365,1054.740234,1973.661133,10.960940,3.141590,0.000000,42.970791);
CreateDynamicObject(18451,1005.568970,2011.211304,10.056200,0.000000,0.000000,30.120001);
CreateDynamicObject(823,901.266174,2040.306519,9.300800,0.000000,0.000000,0.000000);
CreateDynamicObject(1332,905.131348,2040.804688,10.202300,90.000000,0.000000,53.880001);
CreateDynamicObject(874,1107.301270,1975.043213,10.085400,0.000000,0.000000,0.000000);
CreateDynamicObject(3459,1104.216797,1978.474609,9.940300,3.141600,90.000000,-58.958420);
CreateDynamicObject(3474,1124.679688,1963.367188,16.742189,356.858398,0.000000,3.141590);
CreateDynamicObject(734,796.455444,2037.728271,5.559870,0.000000,0.000000,0.000000);
CreateDynamicObject(3273,769.866333,2031.934326,5.710900,3.141600,20.000000,59.530800);
CreateDynamicObject(3459,1024.250366,2050.641846,9.829000,90.858398,90.000000,45.889198);
CreateDynamicObject(3447,1059.740112,2034.258301,10.660300,450.238403,91.000000,44.161610);
CreateDynamicObject(1410,1053.979980,2044.362183,10.484380,3.141590,0.000000,32.760010);
CreateDynamicObject(1410,1065.070190,2043.468750,9.864400,90.141602,0.000000,180.239899);
CreateDynamicObject(874,763.941223,2043.425293,5.688200,0.000000,0.000000,0.000000);
CreateDynamicObject(3364,868.334595,2084.072510,9.526600,357.278412,0.000000,-130.639114);
CreateDynamicObject(873,906.038818,2088.671143,10.093700,0.000000,0.000000,0.000000);
CreateDynamicObject(3274,759.229797,2043.397217,5.830900,30.141600,0.000000,1.570800);
CreateDynamicObject(874,1065.898682,2056.740723,10.421000,0.000000,0.000000,0.000000);
CreateDynamicObject(3460,1012.044983,2081.048584,9.945600,3.141600,90.000000,130.990799);
CreateDynamicObject(7657,1055.613403,2064.047852,11.319100,30.000000,0.000000,29.219999);
CreateDynamicObject(1257,1070.654663,2057.591064,10.613800,3.141600,90.000000,28.930799);
CreateDynamicObject(874,888.692810,2096.854004,9.810540,0.000000,0.000000,0.000000);
CreateDynamicObject(773,886.190979,2097.030762,9.780310,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1108.740601,2042.564575,10.020900,0.000000,0.000000,-23.940001);
CreateDynamicObject(3594,1222.215576,1866.204468,6.323900,0.000000,0.000000,-33.840000);
CreateDynamicObject(3474,971.880554,2106.400879,17.897400,359.872406,20.000000,180.284134);
CreateDynamicObject(1292,1118.424805,2056.843750,10.007200,0.000000,90.000000,-30.180010);
CreateDynamicObject(1492,1121.555908,2057.903076,9.726300,90.000000,0.000000,17.040001);
CreateDynamicObject(874,1123.185059,2057.228760,9.864100,0.000000,0.000000,0.000000);
CreateDynamicObject(1259,1095.866089,2075.917725,24.496300,356.858398,30.000000,139.380005);
CreateDynamicObject(1290,1211.484375,1667.415039,5.873100,90.141602,90.000000,59.107399);
CreateDynamicObject(874,987.600586,2121.417969,11.014900,0.000000,0.000000,0.000000);
CreateDynamicObject(3273,814.241150,2086.994385,10.530900,3.141600,90.000000,27.190800);
CreateDynamicObject(874,1226.529663,1958.376099,5.716300,0.000000,0.000000,0.000000);
CreateDynamicObject(805,1006.360352,2122.711670,9.446800,0.000000,0.000000,0.000000);
CreateDynamicObject(1327,1204.364746,2011.993652,5.729200,0.000000,90.000000,0.000000);
CreateDynamicObject(3460,1275.685425,1810.610718,10.065600,3.858400,95.000000,33.415298);
CreateDynamicObject(874,1249.828857,1712.486450,5.716420,0.000000,0.000000,-51.360001);
CreateDynamicObject(1441,992.175049,2138.472168,10.444400,0.000000,0.000000,67.919998);
CreateDynamicObject(1409,904.863892,2129.543701,9.964100,90.000000,0.000000,-36.959999);
CreateDynamicObject(1265,903.516785,2129.475342,9.848000,0.000000,0.000000,0.000000);
CreateDynamicObject(1264,905.354553,2130.129150,9.669140,0.000000,0.000000,84.480003);
CreateDynamicObject(874,1278.811523,1868.434937,8.764680,0.000000,0.000000,0.000000);
CreateDynamicObject(1357,904.222595,2130.678955,9.932400,0.000000,0.000000,-54.000000);
CreateDynamicObject(3594,1297.099854,1812.640869,10.492100,0.000000,0.000000,333.178589);
CreateDynamicObject(874,1298.072021,1812.731567,9.827800,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,1219.928467,2055.499023,13.319200,0.000000,0.000000,-72.540001);
CreateDynamicObject(19951,1304.577759,1806.751587,9.902900,-5.000000,20.000000,-90.000000);
CreateDynamicObject(734,1302.914307,1897.361938,9.522800,0.000000,0.000000,-94.680000);
CreateDynamicObject(3460,1321.833618,1834.941772,10.505600,3.858400,90.000000,-42.370800);
CreateDynamicObject(734,1293.524658,1700.011353,9.583000,0.000000,0.000000,79.019997);
CreateDynamicObject(1327,1212.245483,1599.226196,5.729200,0.000000,90.000000,0.000000);
CreateDynamicObject(3460,1299.410034,1957.353638,9.925600,3.141600,90.000000,-28.379999);
CreateDynamicObject(874,1329.855957,1868.596680,9.658220,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1329.306885,1886.066284,9.658220,0.000000,0.000000,0.000000);
CreateDynamicObject(1259,1331.854614,1870.139771,20.453541,20.000000,5.000000,356.898682);
CreateDynamicObject(3594,1335.049194,1886.129150,10.235410,0.000000,0.000000,45.000000);
CreateDynamicObject(874,1298.678589,2008.161865,9.657240,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1226.091431,1563.833252,5.716360,0.000000,0.000000,0.000000);
CreateDynamicObject(1410,1339.391357,1952.853882,9.744900,90.000000,0.000000,-26.219999);
CreateDynamicObject(735,1370.024048,1841.503906,8.855800,0.000000,0.000000,-41.939999);
CreateDynamicObject(874,1277.706665,2055.583984,9.661020,0.000000,0.000000,-78.839989);
CreateDynamicObject(874,1223.937012,2089.896484,5.731570,0.000000,0.000000,0.000000);
CreateDynamicObject(1410,1388.151001,1875.595825,9.941400,90.858398,0.000000,-123.218407);
CreateDynamicObject(874,1362.955933,1954.141724,9.658870,0.000000,0.000000,53.279991);
CreateDynamicObject(3459,1315.842285,2049.246094,9.840300,90.858398,90.000000,29.809200);
CreateDynamicObject(3460,1389.645386,1968.150146,10.025600,3.858400,90.000000,-226.810699);
CreateDynamicObject(3460,1439.998413,1873.573608,9.945600,0.858400,90.000000,28.701599);
CreateDynamicObject(874,1214.139893,1460.412720,5.698780,0.000000,0.000000,0.000000);
CreateDynamicObject(735,1303.290894,1435.541870,8.925100,0.000000,0.000000,-39.720001);
CreateDynamicObject(3270,1482.151123,1530.860962,9.488000,0.000000,0.000000,335.655975);
CreateDynamicObject(3593,1207.444458,1375.002197,6.213800,0.000000,0.000000,-48.180000);
CreateDynamicObject(3594,1178.386719,1380.259521,10.325499,10.000000,0.000000,107.867699);
CreateDynamicObject(973,1179.425171,1376.911255,10.938300,0.000000,-5.000000,50.000000);
CreateDynamicObject(973,1177.196533,1368.356079,10.532299,0.000000,0.000000,90.000000);
CreateDynamicObject(1280,1170.884766,1366.073608,10.144700,0.000000,90.000000,141.693405);
CreateDynamicObject(2164,1175.512085,1360.798828,9.919300,0.000000,0.000000,-90.000000);
CreateDynamicObject(2309,1171.193848,1361.951172,10.054599,90.000000,0.000000,50.000000);
CreateDynamicObject(1495,1168.001953,1362.735474,9.819999,0.000000,0.000000,243.346741);
CreateDynamicObject(2674,1169.222412,1361.280029,9.940199,0.000000,0.000000,70.000000);
CreateDynamicObject(2309,1172.519043,1359.890137,10.189599,0.000000,90.000000,7.838699);
CreateDynamicObject(2202,1175.080200,1358.903198,9.919099,0.000000,0.000000,-90.000000);
CreateDynamicObject(1347,1158.230103,1363.960449,10.359100,0.000000,0.000000,0.000000);
CreateDynamicObject(1327,1155.182251,1364.829224,9.724800,0.000000,90.000000,25.000000);
CreateDynamicObject(2161,1175.561157,1358.468628,11.386099,0.000000,0.000000,-90.000000);
CreateDynamicObject(2309,1168.437500,1359.709839,10.054599,90.000000,0.000000,206.839706);
CreateDynamicObject(2612,1167.203125,1359.728149,11.972999,0.000000,10.000000,90.000000);
CreateDynamicObject(2309,1167.296997,1359.665405,9.919599,0.000000,0.000000,-90.000000);
CreateDynamicObject(2356,1175.313965,1357.314087,10.049900,90.000000,90.000000,226.893295);
CreateDynamicObject(2309,1167.453247,1358.439941,9.919599,0.000000,0.000000,-90.000000);
CreateDynamicObject(2670,1171.738770,1357.076904,10.009599,0.000000,0.000000,0.000000);
CreateDynamicObject(19786,1175.648438,1355.962158,12.290699,0.000000,0.000000,-90.000000);
CreateDynamicObject(2607,1173.606079,1355.950806,10.323300,0.000000,0.000000,-90.000000);
obj=CreateDynamicObject(968,1151.936523,1362.927979,10.490200,0.000000,-90.000000,0.000000);
SetDynamicObjectMaterial(obj,1,65535,"none","none",-16777217);
CreateDynamicObject(2674,1170.029419,1356.947754,9.948200,0.000000,0.000000,15.000000);
obj=CreateDynamicObject(966,1151.727051,1362.920410,9.690899,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,1,65535,"none","none",-16777217);
CreateDynamicObject(1415,1155.676270,1361.494629,9.817500,0.000000,0.000000,359.493927);
CreateDynamicObject(2309,1167.643188,1357.541992,10.082599,0.000000,-42.000000,-90.000000);
CreateDynamicObject(1237,1152.654907,1362.375000,9.821299,0.000000,0.000000,70.000000);
CreateDynamicObject(2673,1168.342163,1356.598145,10.008500,0.000000,0.000000,75.000000);
CreateDynamicObject(2309,1167.450195,1356.812988,9.919599,0.000000,0.000000,-90.000000);
CreateDynamicObject(1372,1157.096436,1360.120483,9.814399,0.000000,0.000000,270.624695);
CreateDynamicObject(2611,1167.203125,1356.791870,12.029000,0.000000,0.000000,90.000000);
CreateDynamicObject(1238,1155.794067,1359.932617,9.993700,0.000000,-105.000000,20.000000);
CreateDynamicObject(2673,1171.027954,1354.774902,10.008500,0.000000,0.000000,0.000000);
CreateDynamicObject(2309,1167.430786,1355.792114,9.919599,0.000000,0.000000,-105.000000);
CreateDynamicObject(2162,1175.558350,1353.429443,11.482000,0.000000,0.000000,-90.000000);
CreateDynamicObject(1372,1157.108032,1358.672485,9.814399,0.000000,0.000000,270.745209);
CreateDynamicObject(1237,1143.294067,1362.664185,9.975299,0.000000,90.000000,138.309952);
CreateDynamicObject(1237,1144.109131,1362.222046,9.821299,0.000000,0.000000,45.000000);
CreateDynamicObject(1372,1157.109741,1357.115845,9.814399,0.000000,0.000000,269.135498);
CreateDynamicObject(19967,1142.506104,1362.318726,9.697199,0.000000,0.000000,180.000000);
CreateDynamicObject(1237,1141.001587,1362.834839,10.185299,0.000000,-90.000000,57.000000);
CreateDynamicObject(950,1165.091797,1353.989380,10.444600,0.000000,0.000000,0.000000);
CreateDynamicObject(1721,1174.381714,1350.946411,9.918899,0.000000,0.000000,180.000000);
CreateDynamicObject(1237,1141.798218,1362.043701,9.821299,0.000000,0.000000,7.000000);
CreateDynamicObject(19980,1175.572998,1350.201416,9.929900,0.000000,0.000000,-90.000000);
CreateDynamicObject(19980,1175.572998,1350.201416,8.816300,0.000000,0.000000,-90.000000);
CreateDynamicObject(19949,1175.572510,1350.196899,9.935899,0.000000,0.000000,-90.000000);
CreateDynamicObject(19957,1175.572510,1350.189575,8.815899,0.000000,0.000000,-90.000000);
CreateDynamicObject(2309,1165.550659,1352.955322,10.059599,90.000000,0.000000,31.593901);
CreateDynamicObject(1721,1172.193848,1350.915283,10.226900,0.000000,90.000000,160.000000);
CreateDynamicObject(1372,1157.094849,1355.568481,9.814399,0.000000,0.000000,269.971588);
CreateDynamicObject(1721,1173.073730,1350.535522,9.918899,0.000000,0.000000,180.000000);
CreateDynamicObject(2670,1168.666992,1351.430298,10.009599,0.000000,0.000000,-45.000000);
CreateDynamicObject(3594,1130.096924,1365.916260,10.437500,0.000000,0.000000,254.771606);
CreateDynamicObject(2674,1167.207764,1351.736206,9.948200,0.000000,0.000000,70.000000);
CreateDynamicObject(1721,1174.201904,1349.047607,9.918899,0.000000,0.000000,180.000000);
CreateDynamicObject(2309,1164.578857,1351.862061,9.919599,0.000000,0.000000,-90.000000);
obj=CreateDynamicObject(968,1133.370361,1363.192139,10.796400,0.000000,-95.000000,105.120796);
SetDynamicObjectMaterial(obj,1,65535,"none","none",-16777217);
CreateDynamicObject(1721,1169.992432,1349.616211,10.198900,0.000000,-90.000000,208.316498);
CreateDynamicObject(1808,1164.651733,1351.210938,9.918899,0.000000,10.000000,90.000000);
obj=CreateDynamicObject(966,1133.418335,1363.000977,9.690899,0.000000,0.000000,180.000000);
SetDynamicObjectMaterial(obj,1,65535,"none","none",-16777217);
CreateDynamicObject(1721,1171.598267,1348.914795,9.918899,0.000000,0.000000,180.000000);
CreateDynamicObject(1721,1172.889771,1348.458252,10.030900,90.000000,0.000000,189.284637);
CreateDynamicObject(19980,1175.572998,1347.641357,9.929900,0.000000,0.000000,-90.000000);
CreateDynamicObject(19980,1175.572998,1347.641357,8.816300,0.000000,0.000000,-90.000000);
CreateDynamicObject(19962,1175.572632,1347.630005,9.935899,0.000000,0.000000,-90.000000);
CreateDynamicObject(2167,1168.741821,1349.325562,9.920299,0.000000,0.000000,-90.000000);
CreateDynamicObject(1237,1132.533447,1362.379639,9.821299,0.000000,0.000000,157.000000);
CreateDynamicObject(2309,1164.805298,1350.033813,10.190600,0.000000,90.000000,338.437714);
CreateDynamicObject(1237,1131.474976,1362.767578,9.821299,0.000000,0.000000,57.000000);
CreateDynamicObject(19165,1164.444580,1349.718994,11.917900,95.000000,90.000000,0.000000);
obj=CreateDynamicObject(979,1142.340698,1357.545654,10.611100,0.000000,0.000000,268.946625);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(2167,1168.415161,1348.095215,9.920299,-90.000000,0.000000,71.601730);
CreateDynamicObject(19168,1172.977539,1346.301270,11.979599,90.000000,90.000000,90.000000);
CreateDynamicObject(19950,1174.798828,1345.716919,9.978400,0.000000,0.000000,180.000000);
CreateDynamicObject(19956,1174.798950,1345.716309,9.038200,0.000000,0.000000,180.000000);
CreateDynamicObject(19980,1174.792603,1345.714966,9.981200,0.000000,0.000000,180.000000);
CreateDynamicObject(19980,1174.792603,1345.714966,9.042300,0.000000,0.000000,180.000000);
CreateDynamicObject(19967,1174.798950,1345.716309,8.104100,0.000000,0.000000,180.000000);
CreateDynamicObject(19980,1174.792603,1345.714966,8.102800,0.000000,0.000000,180.000000);
CreateDynamicObject(3077,1172.291504,1346.262573,9.919400,0.000000,0.000000,180.000000);
CreateDynamicObject(19169,1171.484741,1346.301270,11.979599,90.000000,90.000000,90.000000);
CreateDynamicObject(2309,1167.936523,1347.330322,10.059599,90.000000,20.000000,-90.000000);
CreateDynamicObject(1237,1143.045166,1355.683960,9.821299,0.000000,0.000000,70.000000);
CreateDynamicObject(2167,1168.741821,1346.619385,9.920299,0.000000,0.000000,-90.000000);
CreateDynamicObject(19980,1169.701050,1345.714966,9.981200,0.000000,0.000000,180.000000);
CreateDynamicObject(19976,1169.689819,1345.715820,9.959500,0.000000,0.000000,180.000000);
CreateDynamicObject(19980,1169.701050,1345.714966,9.042300,0.000000,0.000000,180.000000);
CreateDynamicObject(19964,1169.689697,1345.716309,9.043399,0.000000,0.000000,180.000000);
CreateDynamicObject(19980,1169.701050,1345.714966,8.102800,0.000000,0.000000,180.000000);
CreateDynamicObject(1237,1141.805420,1355.511963,9.821299,0.000000,0.000000,70.000000);
CreateDynamicObject(19966,1169.669678,1345.716309,8.104100,0.000000,0.000000,180.000000);
CreateDynamicObject(950,1167.104492,1346.023315,10.444600,0.000000,0.000000,180.000000);
CreateDynamicObject(1237,1142.998169,1354.467651,9.821299,0.000000,0.000000,70.000000);
CreateDynamicObject(1237,1143.135498,1352.983643,9.821299,0.000000,0.000000,70.000000);
CreateDynamicObject(1219,1165.459839,1344.834717,10.972999,80.000000,0.000000,0.000000);
CreateDynamicObject(1237,1141.351074,1352.846924,10.194299,0.000000,90.000000,301.363403);
CreateDynamicObject(1237,1130.729980,1355.717773,9.821299,0.000000,0.000000,40.000000);
CreateDynamicObject(1427,1158.816650,1344.385742,10.303600,0.000000,0.000000,9.284600);
obj=CreateDynamicObject(979,1145.321411,1349.283081,10.611100,0.000000,0.000000,310.733093);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(19967,1130.725830,1355.350952,9.697199,0.000000,-20.000000,180.000000);
CreateDynamicObject(1237,1130.367310,1354.701172,10.157299,0.000000,90.000000,320.370331);
obj=CreateDynamicObject(973,1157.730713,1343.195313,10.611100,0.000000,0.000000,-90.000000);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1238,1148.404663,1346.582764,10.142700,0.000000,0.000000,75.000000);
obj=CreateDynamicObject(979,1125.907837,1355.113403,10.611100,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1237,1147.220703,1345.467163,9.821299,0.000000,0.000000,331.683472);
obj=CreateDynamicObject(1290,1144.840332,1346.014893,14.154199,40.000000,0.000000,24.342800);
SetDynamicObjectMaterial(obj,0,19844,"metalpanels","metalpanel3",-6710887);
CreateDynamicObject(17070,1165.568970,1337.412476,9.797900,-0.300000,0.000000,92.586502);
CreateDynamicObject(1238,1157.312622,1339.805054,10.142700,0.000000,0.000000,45.000000);

CreateDynamicObject(19955,1158.065674,1339.093262,9.793499,0.000000,0.000000,90.000000);
CreateDynamicObject(734,1145.716187,1343.630493,9.785630,0.000000,0.000000,0.000000);
CreateDynamicObject(1237,1158.647949,1338.414307,10.180299,-90.000000,0.000000,313.298096);
CreateDynamicObject(1237,1121.384766,1353.966553,9.821299,0.000000,0.000000,-40.000000);
CreateDynamicObject(1237,1157.075806,1338.722412,9.821299,0.000000,0.000000,70.000000);
obj=CreateDynamicObject(979,1148.405396,1341.174927,10.611100,0.000000,0.000000,270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(19425,1157.740967,1337.427002,9.804599,0.000000,0.000000,90.000000);
CreateDynamicObject(933,1121.603516,1350.350708,9.797300,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(979,1118.057007,1351.841309,10.611100,0.000000,0.000000,45.000000);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1237,1100.844604,1361.338013,9.821299,0.000000,0.000000,70.000000);
CreateDynamicObject(19425,1157.740967,1334.140015,9.804599,0.000000,0.000000,90.000000);
CreateDynamicObject(1237,1099.926147,1360.661987,9.821299,0.000000,0.000000,70.000000);
CreateDynamicObject(19967,1148.448975,1336.454590,9.697199,0.000000,0.000000,90.000000);
CreateDynamicObject(19955,1148.454956,1336.451416,8.881400,0.000000,0.000000,90.000000);
CreateDynamicObject(19956,1148.414551,1336.456055,8.881400,0.000000,0.000000,-90.000000);
CreateDynamicObject(1237,1158.409912,1332.786621,9.821299,0.000000,0.000000,45.000000);
CreateDynamicObject(1237,1148.799438,1336.204956,9.821299,0.000000,0.000000,70.000000);
CreateDynamicObject(1237,1147.872803,1336.526367,9.821299,0.000000,0.000000,70.000000);
CreateDynamicObject(1237,1156.685181,1332.985596,10.166299,90.000000,0.000000,20.000000);
CreateDynamicObject(1237,1115.156982,1350.459473,10.150300,0.000000,90.000000,237.000488);
CreateDynamicObject(1237,1099.467041,1359.240845,9.821299,0.000000,0.000000,70.000000);
CreateDynamicObject(19425,1148.758545,1334.674072,9.802599,0.000000,0.000000,90.000000);
CreateDynamicObject(19425,1148.758545,1332.345459,9.805600,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(973,1157.730713,1328.337524,10.611100,0.000000,0.000000,-90.000000);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
obj=CreateDynamicObject(973,1171.797119,1323.646118,10.611100,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1237,1148.672607,1330.859375,9.821299,0.000000,0.000000,70.000000);
CreateDynamicObject(1237,1107.641113,1349.900024,10.150300,0.000000,90.000000,65.923943);
CreateDynamicObject(1237,1147.887329,1330.769531,9.821299,0.000000,0.000000,70.000000);
CreateDynamicObject(17070,1129.089478,1337.552124,9.795900,-0.300000,0.000000,1.906299);
obj=CreateDynamicObject(1290,1109.765991,1347.434204,9.921799,90.000000,90.000000,217.223602);
SetDynamicObjectMaterial(obj,0,19844,"metalpanels","metalpanel3",-6710887);
obj=CreateDynamicObject(979,1114.781616,1343.985596,10.611100,0.000000,0.000000,-270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
obj=CreateDynamicObject(973,1162.354736,1323.240234,10.503100,30.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
obj=CreateDynamicObject(979,1148.497314,1325.912720,10.611100,0.000000,0.000000,270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
obj=CreateDynamicObject(1290,1144.510254,1326.904541,13.931900,-45.000000,0.000000,123.176003);
SetDynamicObjectMaterial(obj,0,19844,"metalpanels","metalpanel3",-6710887);
CreateDynamicObject(1327,1120.001709,1336.159668,9.796799,0.000000,90.000000,0.000000);
CreateDynamicObject(1327,1121.359009,1335.093628,10.670100,0.000000,-60.000000,334.965698);
obj=CreateDynamicObject(979,1148.536255,1322.433228,10.611100,0.000000,0.000000,270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1237,1108.927368,1338.258789,10.150300,0.000000,90.000000,20.000000);
CreateDynamicObject(3593,1135.520386,1324.590698,15.715000,0.000000,0.000000,98.667297);
obj=CreateDynamicObject(979,1114.721680,1334.608032,10.611100,0.000000,0.000000,-270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1237,1149.216187,1318.094604,9.821299,0.000000,0.000000,70.000000);
CreateDynamicObject(1237,1166.015015,1311.801880,10.173299,0.000000,90.000000,244.792892);
CreateDynamicObject(1237,1148.019043,1317.943237,9.821299,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(1290,1167.827759,1311.004395,15.489199,0.000000,12.000000,0.000000);
SetDynamicObjectMaterial(obj,0,19844,"metalpanels","metalpanel3",-6710887);
CreateDynamicObject(1238,1156.628052,1314.345337,10.142700,0.000000,0.000000,75.000000);
obj=CreateDynamicObject(979,1152.739014,1315.598511,10.611100,0.000000,0.000000,333.086700);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1237,1148.855835,1316.919067,9.821299,0.000000,0.000000,160.000000);
CreateDynamicObject(1238,1157.560425,1313.110474,10.142700,0.000000,0.000000,5.000000);
obj=CreateDynamicObject(979,1156.880493,1309.016602,10.611100,0.000000,0.000000,270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
obj=CreateDynamicObject(1290,1102.950684,1332.057373,13.000000,60.000000,0.000000,264.148407);
SetDynamicObjectMaterial(obj,0,19844,"metalpanels","metalpanel3",-6710887);
obj=CreateDynamicObject(979,1114.668579,1325.237183,10.611100,0.000000,0.000000,-270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(874,1226.328979,1290.939453,5.713520,0.000000,0.000000,0.000000);
CreateDynamicObject(3567,1121.627319,1319.383423,10.625100,0.000000,0.000000,180.000000);
CreateDynamicObject(1237,1166.795776,1300.223877,9.821299,0.000000,0.000000,0.000000);
CreateDynamicObject(1237,1105.447998,1325.325684,10.150300,0.000000,90.000000,131.524826);
obj=CreateDynamicObject(979,1156.934937,1299.639160,10.611100,0.000000,0.000000,270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
obj=CreateDynamicObject(979,1114.612671,1315.874390,10.611100,0.000000,0.000000,-270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1237,1167.208618,1292.325317,10.182399,0.000000,90.000000,202.020126);
obj=CreateDynamicObject(979,1156.990479,1290.260376,10.611100,0.000000,0.000000,270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
obj=CreateDynamicObject(1290,1165.152588,1285.633423,9.943200,90.000000,0.000000,328.508698);
SetDynamicObjectMaterial(obj,0,19844,"metalpanels","metalpanel3",-6710887);
obj=CreateDynamicObject(979,1114.552368,1306.503662,10.611100,0.000000,0.000000,-270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1237,1166.775879,1280.990601,9.821299,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(979,1157.063965,1280.888306,10.611100,0.000000,0.000000,270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
obj=CreateDynamicObject(979,1114.491943,1297.123047,10.611100,0.000000,0.000000,-270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(734,1153.247437,1278.483398,9.785599,0.000000,0.000000,40.000000);
CreateDynamicObject(7496,1128.647095,1287.970337,13.353599,0.000000,0.000000,89.585800);
CreateDynamicObject(1237,1164.791260,1271.568726,10.124300,0.000000,90.000000,50.000000);
obj=CreateDynamicObject(979,1157.121094,1271.511475,10.611100,0.000000,0.000000,270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
obj=CreateDynamicObject(979,1114.435425,1287.745117,10.611100,0.000000,0.000000,-270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1237,1169.011230,1262.419312,10.194299,0.000000,90.000000,306.983490);
CreateDynamicObject(8375,1098.385620,1294.245361,11.785900,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(979,1157.181396,1262.131836,10.611100,0.000000,0.000000,270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
obj=CreateDynamicObject(979,1114.384033,1278.378540,10.611100,0.000000,0.000000,-270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1237,1166.795776,1250.991943,9.821299,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(1290,1166.786377,1250.935059,15.489159,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,19844,"metalpanels","metalpanel3",-6710887);
obj=CreateDynamicObject(979,1157.239014,1252.751465,10.611100,0.000000,0.000000,270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
obj=CreateDynamicObject(979,1114.328247,1269.010864,10.611100,0.000000,0.000000,-270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1237,1107.129883,1268.091919,9.821299,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(1290,1107.122925,1268.095215,15.489159,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,19844,"metalpanels","metalpanel3",-6710887);
CreateDynamicObject(1237,1166.795776,1240.991943,9.821299,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(979,1157.298218,1243.373535,10.611100,0.000000,0.000000,270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
obj=CreateDynamicObject(979,1114.261230,1259.627930,10.611100,0.000000,0.000000,-270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1238,1157.876831,1238.933960,10.142700,0.000000,0.000000,55.000000);
CreateDynamicObject(1238,1157.029297,1237.782959,10.142700,0.000000,0.000000,5.000000);
CreateDynamicObject(1237,1173.985352,1231.848877,9.821299,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(979,1153.126343,1236.818115,10.611100,0.000000,0.000000,204.343994);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1237,1163.029053,1232.319702,10.166299,0.000000,90.000000,17.797831);
CreateDynamicObject(1237,1169.914673,1230.145142,9.821299,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(979,1114.208618,1250.249878,10.611100,0.000000,0.000000,-270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(7496,1128.317139,1242.685059,13.353599,0.000000,0.000000,89.585800);
CreateDynamicObject(1237,1159.788818,1229.962036,10.166299,0.000000,90.000000,306.983490);
CreateDynamicObject(1237,1173.985352,1225.192749,9.821299,0.000000,0.000000,0.000000);
CreateDynamicObject(18452,1107.373291,1252.174927,13.097599,0.000000,0.000000,90.000000);
CreateDynamicObject(1237,1168.564331,1225.192749,9.821299,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(1290,1168.534058,1225.231567,15.489159,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,19844,"metalpanels","metalpanel3",-6710887);
obj=CreateDynamicObject(979,1144.589966,1232.944702,10.611100,0.000000,0.000000,204.343994);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1237,1162.863770,1225.174072,9.821299,0.000000,0.000000,0.000000);
CreateDynamicObject(1237,1157.628906,1225.046387,9.821299,0.000000,0.000000,0.000000);
CreateDynamicObject(1237,1150.951416,1225.918823,10.166299,0.000000,90.000000,31.328711);
CreateDynamicObject(1237,1152.409058,1225.025757,9.821299,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(1290,1152.400757,1225.050537,15.489159,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,19844,"metalpanels","metalpanel3",-6710887);
obj=CreateDynamicObject(973,1135.654419,1231.555908,10.611100,0.000000,0.000000,173.903870);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
obj=CreateDynamicObject(979,1114.169800,1240.901245,10.611100,0.000000,0.000000,-270.366791);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1237,1137.880127,1229.757568,10.160300,0.000000,90.000000,23.333900);
CreateDynamicObject(973,1151.953857,1223.911865,10.611100,0.000000,0.000000,0.000000);
CreateDynamicObject(18452,1107.373291,1243.860962,13.097599,0.000000,0.000000,90.000000);
CreateDynamicObject(734,1119.897583,1235.769897,9.785599,0.000000,0.000000,284.278625);
CreateDynamicObject(3594,1132.067505,1229.942871,11.156700,0.000000,-65.000000,273.950195);
CreateDynamicObject(19817,1136.169312,1227.545776,9.762900,0.000000,0.000000,90.000000);
obj=CreateDynamicObject(973,1126.409424,1231.347534,10.611100,0.000000,0.000000,185.962677);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(973,1142.576538,1223.903442,10.611100,0.000000,0.000000,0.000000);
CreateDynamicObject(1237,1113.378906,1236.500244,9.821299,0.000000,0.000000,0.000000);
CreateDynamicObject(1237,1137.794922,1225.134521,9.821299,0.000000,0.000000,50.000000);
obj=CreateDynamicObject(979,1117.926392,1233.687500,10.611100,0.000000,0.000000,143.922562);
SetDynamicObjectMaterial(obj,0,19278,"skydiveplatforms","hazardtile19-2",0);
CreateDynamicObject(1237,1114.296997,1235.441162,9.821299,0.000000,0.000000,50.000000);
CreateDynamicObject(19817,1126.554688,1227.563843,9.762900,0.000000,0.000000,-90.000000);
CreateDynamicObject(973,1133.190063,1223.903442,10.611100,0.000000,0.000000,0.000000);
CreateDynamicObject(13590,1138.037598,1219.957520,10.932200,0.000000,0.000000,94.450798);
CreateDynamicObject(973,1123.813721,1223.903442,10.611100,0.000000,0.000000,0.000000);
CreateDynamicObject(1237,1116.748169,1224.860474,9.821299,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(1290,1116.740845,1224.887207,15.489159,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,19844,"metalpanels","metalpanel3",-6710887);
CreateDynamicObject(874,1223.624756,1194.708618,13.431600,0.000000,0.000000,-53.220001);
CreateDynamicObject(734,1151.546387,1209.287842,9.785599,0.000000,0.000000,-120.000000);
CreateDynamicObject(973,1114.432007,1223.903442,10.611100,0.000000,0.000000,0.000000);
CreateDynamicObject(1237,1110.901367,1224.968628,9.821299,0.000000,0.000000,0.000000);
CreateDynamicObject(1237,1105.750488,1224.879883,9.821299,0.000000,0.000000,0.000000);
CreateDynamicObject(973,1105.066772,1223.903442,10.611100,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1315.264526,1194.221191,9.663840,0.000000,0.000000,0.000000);
CreateDynamicObject(1237,1099.518433,1226.477661,9.821299,0.000000,0.000000,-50.000000);
CreateDynamicObject(1237,1101.070679,1224.674805,9.821299,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(1290,1101.062378,1224.753418,15.489159,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,19844,"metalpanels","metalpanel3",-6710887);
CreateDynamicObject(1237,1099.920166,1225.214478,9.821299,0.000000,0.000000,50.000000);
CreateDynamicObject(734,1105.001953,1208.891724,9.785599,0.000000,0.000000,150.000000);
CreateDynamicObject(3459,1343.807861,1189.115112,9.809100,90.858398,90.000000,34.369202);
CreateDynamicObject(874,1210.217407,1166.129028,5.804280,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1393.009644,1190.465332,9.661050,0.000000,0.000000,-93.659988);
CreateDynamicObject(735,1164.712402,1126.757935,8.989400,0.000000,0.000000,-52.619999);
CreateDynamicObject(874,1233.921753,1112.596680,5.636700,0.000000,0.000000,-100.379997);
CreateDynamicObject(874,1447.895752,1173.100952,9.662950,0.000000,0.000000,0.000000);
CreateDynamicObject(3270,1540.870728,1296.949585,9.513690,0.000000,0.000000,45.000000);
CreateDynamicObject(1327,1205.927490,1073.532227,5.818600,0.000000,90.000000,0.000000);
CreateDynamicObject(874,1091.042847,1084.512939,9.827610,0.000000,0.000000,40.799992);
CreateDynamicObject(13591,1089.496338,1080.525879,10.293600,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1503.993286,1131.309692,9.708750,0.000000,0.000000,-121.800034);
CreateDynamicObject(3594,1235.490967,994.016785,6.425900,0.000000,0.000000,-122.580002);
CreateDynamicObject(3594,1510.765259,1131.249268,10.181600,0.000000,0.000000,-28.500000);
CreateDynamicObject(734,1078.931763,1039.455933,8.913700,0.000000,0.000000,-262.319977);
CreateDynamicObject(874,1220.575684,973.855896,5.796840,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1349.795410,974.475098,15.252750,0.000000,0.000000,0.000000);
CreateDynamicObject(734,967.101929,1153.356323,9.704400,0.000000,0.000000,-46.680000);
CreateDynamicObject(874,1512.364868,1073.060791,9.664470,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1182.533691,933.795837,8.432990,0.000000,0.000000,-49.919998);
CreateDynamicObject(874,1337.517822,921.389771,9.658280,0.000000,0.000000,0.000000);
CreateDynamicObject(1410,1568.294434,1089.345215,9.806800,90.000000,0.000000,-44.279999);
CreateDynamicObject(874,1566.575439,1065.454590,9.655900,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1564.297974,1058.388794,9.667350,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,1508.289063,977.112671,10.202200,0.000000,0.000000,-48.180000);
CreateDynamicObject(3593,1298.099243,896.675415,16.420401,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1616.768066,1137.665894,9.659390,0.000000,0.000000,0.000000);
CreateDynamicObject(3459,1564.640747,1005.567810,9.838800,90.858398,90.000000,-56.558399);
CreateDynamicObject(734,1623.209473,1260.636475,9.683200,0.000000,0.000000,0.000000);
CreateDynamicObject(1951,1340.760010,1164.359985,10.040000,0.000000,360.000000,300.000000);
CreateDynamicObject(3594,1646.083862,1199.561401,10.220900,0.000000,0.000000,52.320000);
CreateDynamicObject(874,1647.812378,1182.720459,9.653170,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1512.447632,917.249695,9.661140,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,1567.060303,943.679382,10.153500,0.000000,0.000000,39.299999);
CreateDynamicObject(874,1575.285767,930.474487,9.856490,0.000000,0.000000,-74.819977);
CreateDynamicObject(874,1564.272583,910.350525,9.805150,0.000000,0.000000,0.000000);
CreateDynamicObject(734,1503.479370,887.588013,9.669600,0.000000,0.000000,-64.739998);
CreateDynamicObject(874,1640.332397,933.359436,9.790880,0.000000,0.000000,-271.500000);
CreateDynamicObject(3594,1424.959473,857.521423,6.443800,0.000000,0.000000,-26.520000);
CreateDynamicObject(874,1751.961670,1132.688599,11.195790,0.000000,0.000000,8.760000);
CreateDynamicObject(874,1538.465698,852.779846,5.796120,0.000000,0.000000,61.740002);
CreateDynamicObject(874,1728.000732,1281.239502,9.742730,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,1779.871582,1132.702148,12.914400,0.000000,0.000000,-29.040001);
CreateDynamicObject(874,1511.617798,834.054993,5.802850,0.000000,0.000000,51.119999);
CreateDynamicObject(874,1788.810669,1051.131592,5.716580,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1788.276367,1242.080200,5.566300,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,1806.972778,1187.683472,6.302300,0.000000,0.000000,-51.840000);
CreateDynamicObject(3594,1782.865967,1274.924683,12.963800,0.000000,0.000000,-255.059998);
CreateDynamicObject(874,1679.532104,857.082031,6.456700,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,1610.294434,832.893005,6.324600,0.000000,0.000000,-27.240000);
CreateDynamicObject(874,1862.687256,1133.431519,9.657320,0.000000,0.000000,5.280000);
CreateDynamicObject(734,1763.208008,1350.886108,8.115000,0.000000,0.000000,54.360001);
CreateDynamicObject(874,1871.034668,1094.642944,9.839620,0.000000,0.000000,39.779999);
CreateDynamicObject(874,1807.941040,1318.938721,5.639600,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1810.257935,930.309204,7.431690,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1862.803955,1275.151245,9.968110,0.000000,0.000000,31.379999);
CreateDynamicObject(3593,1867.727539,973.816101,10.070600,0.000000,0.000000,-51.840000);
CreateDynamicObject(734,1828.268921,894.510071,9.319700,0.000000,0.000000,-144.899994);
CreateDynamicObject(3593,1786.606323,1395.196533,6.206500,0.000000,0.000000,-39.840000);
CreateDynamicObject(2891,1683.339966,1112.290039,11.480000,0.000000,360.000000,300.000000);
CreateDynamicObject(2977,1972.679077,1138.355957,17.085938,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1796.089600,848.183838,9.647660,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,1807.075195,848.137817,10.150400,0.000000,0.000000,46.320000);
CreateDynamicObject(874,1969.831299,1274.302856,9.660450,0.000000,0.000000,40.500000);
CreateDynamicObject(874,1935.606934,932.496582,9.653810,0.000000,0.000000,-94.080017);
CreateDynamicObject(735,2007.863525,1049.482666,8.889300,0.000000,0.000000,83.699997);
CreateDynamicObject(3593,1989.803589,1272.742310,10.144900,0.000000,0.000000,-45.840000);
CreateDynamicObject(3593,2031.896240,1094.093262,10.043700,0.000000,0.000000,-52.919998);
CreateDynamicObject(3593,2023.752197,1238.149170,10.284900,0.000000,0.000000,-156.539993);
CreateDynamicObject(874,2044.297119,1157.223877,9.640820,0.000000,0.000000,0.000000);
CreateDynamicObject(13591,1881.996582,863.499512,8.031900,0.000000,0.000000,-45.900002);
CreateDynamicObject(734,1996.118530,1307.262329,8.057300,0.000000,0.000000,327.420013);
CreateDynamicObject(3594,2047.356079,1195.893311,10.239000,0.000000,0.000000,-36.060001);
CreateDynamicObject(734,2056.824707,1134.343872,9.651600,0.000000,0.000000,14.460000);
CreateDynamicObject(874,2008.650269,960.056519,9.658470,0.000000,0.000000,0.000000);
CreateDynamicObject(18451,1991.588745,933.284729,10.180700,0.000000,0.000000,44.639999);
CreateDynamicObject(1441,2065.802490,1188.900024,10.304300,0.000000,0.000000,-54.059990);
CreateDynamicObject(3594,1793.155884,832.021973,10.268000,0.000000,0.000000,-44.459999);
CreateDynamicObject(3593,2072.055420,1088.122314,10.151200,0.000000,0.000000,-57.240002);
CreateDynamicObject(1327,2050.673340,1277.301392,9.660100,0.000000,90.000000,0.000000);
CreateDynamicObject(1327,2051.608154,1277.915894,10.300100,0.000000,90.000000,0.000000);
CreateDynamicObject(1327,2052.802490,1277.808228,9.660100,0.000000,90.000000,0.000000);
CreateDynamicObject(874,2068.100830,1011.567566,9.603550,0.000000,0.000000,0.000000);
CreateDynamicObject(734,2099.114014,1121.696045,9.703200,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2069.788086,1267.504272,10.280000,0.000000,0.000000,-40.020000);
CreateDynamicObject(734,1981.936890,1377.783447,7.907700,0.000000,0.000000,-63.959999);
CreateDynamicObject(13591,2098.393799,1231.751465,10.234300,0.000000,0.000000,-53.580002);
CreateDynamicObject(874,1935.572876,854.386841,6.015780,0.000000,0.000000,53.640011);
CreateDynamicObject(874,2068.809814,1310.634155,9.655320,0.000000,0.000000,0.000000);
CreateDynamicObject(734,2128.559082,1088.140747,9.612200,0.000000,0.000000,90.419998);
CreateDynamicObject(3593,2048.098633,917.302795,8.157400,0.000000,0.000000,-53.460011);
CreateDynamicObject(874,2044.538330,906.644104,7.134510,0.000000,0.000000,0.000000);
CreateDynamicObject(1327,2138.304932,1196.621582,9.678800,0.000000,90.000000,0.000000);
CreateDynamicObject(734,2057.708740,903.770630,6.981300,0.000000,0.000000,61.919998);
CreateDynamicObject(874,1990.430298,834.336365,5.720460,0.000000,0.000000,-79.800003);
CreateDynamicObject(874,2040.328613,855.076843,5.720690,0.000000,0.000000,-90.660004);
CreateDynamicObject(874,2145.687500,969.164307,9.830410,0.000000,0.000000,0.000000);
CreateDynamicObject(735,2155.651611,1223.541992,8.857000,0.000000,0.000000,117.900002);
CreateDynamicObject(734,1911.453979,801.872620,9.648400,0.000000,0.000000,43.439999);
CreateDynamicObject(734,2156.135498,1236.232910,9.634000,0.000000,0.000000,-11.280000);
CreateDynamicObject(874,2047.788208,1362.080078,9.662570,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2100.008057,1329.916382,10.432100,0.000000,0.000000,-35.580002);
CreateDynamicObject(3594,2188.235352,1214.549561,10.288300,0.000000,0.000000,-151.199997);
CreateDynamicObject(874,2195.480713,1194.985107,9.760580,0.000000,0.000000,0.000000);
CreateDynamicObject(735,2008.411499,1386.237427,7.070200,0.000000,0.000000,116.160004);
CreateDynamicObject(1327,2097.579346,1339.957031,9.817100,0.000000,90.000000,0.000000);
CreateDynamicObject(874,2146.864990,907.738098,9.749590,5.700000,-12.719990,-39.959999);
CreateDynamicObject(874,2102.689697,1356.147827,9.809700,0.000000,0.000000,-36.599998);
CreateDynamicObject(874,2224.192383,1236.873413,9.662400,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2096.960449,834.202576,6.339900,0.000000,0.000000,-36.840000);
CreateDynamicObject(734,2155.458740,1330.552979,9.221300,0.000000,0.000000,170.699982);
CreateDynamicObject(734,2057.401123,1387.565674,9.725400,0.000000,0.000000,51.299999);
CreateDynamicObject(734,2060.341553,810.049072,8.143400,0.000000,0.000000,-242.279984);
CreateDynamicObject(874,2170.512451,859.879150,5.727220,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2184.882324,1325.857910,9.651900,0.000000,0.000000,0.000000);
CreateDynamicObject(734,2162.941162,1343.255493,9.145100,0.000000,0.000000,66.300003);
CreateDynamicObject(874,2110.217041,1375.811523,9.844720,0.000000,0.000000,8.820000);
CreateDynamicObject(734,2217.893311,868.228271,6.192600,0.000000,0.000000,0.000000);
CreateDynamicObject(734,2319.583740,1032.632202,9.628800,0.000000,0.000000,-207.300003);
CreateDynamicObject(3593,2150.321289,1373.027710,10.102900,0.000000,0.000000,-31.860001);
CreateDynamicObject(18451,2309.543945,972.986389,10.195900,0.000000,0.000000,-240.300003);
CreateDynamicObject(1441,2204.990723,849.630371,6.378400,0.000000,0.000000,18.420000);
CreateDynamicObject(874,2340.414307,1143.643188,9.662170,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2351.845947,1074.296265,10.407800,0.000000,0.000000,32.160000);
CreateDynamicObject(874,2206.551025,1358.415283,9.807740,0.000000,0.000000,52.200001);
CreateDynamicObject(734,2208.040039,1357.563843,9.587400,0.000000,0.000000,67.800003);
CreateDynamicObject(874,2349.994141,1040.286743,8.997700,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2347.264160,1192.336548,9.754630,0.000000,0.000000,15.240000);
CreateDynamicObject(734,2315.474854,941.994507,9.522000,0.000000,0.000000,-93.239998);
CreateDynamicObject(874,2228.025391,1369.230347,9.852600,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,2068.614990,1409.376953,10.161800,0.000000,0.000000,-46.680000);
CreateDynamicObject(734,2009.156738,1414.577881,7.907700,0.000000,0.000000,68.220001);
CreateDynamicObject(3594,2070.015625,1442.723022,10.193700,0.000000,0.000000,-64.620003);
CreateDynamicObject(13591,2047.974487,1446.096802,10.042500,0.000000,0.000000,36.060001);
CreateDynamicObject(874,2045.877319,1454.890625,9.664570,0.000000,0.000000,95.399986);
CreateDynamicObject(18451,2424.765869,1193.696533,10.348000,0.000000,0.000000,-108.900002);
CreateDynamicObject(874,2431.795166,1196.235107,9.841400,0.000000,0.000000,0.000000);
CreateDynamicObject(2663,2157.360107,1170.140015,10.010000,0.000000,360.000000,300.000000);
CreateDynamicObject(874,2366.443359,1375.793457,9.650210,0.000000,0.000000,-50.699989);
CreateDynamicObject(874,2428.639160,1076.312012,9.346900,0.000000,0.000000,0.000000);
CreateDynamicObject(3459,2425.510254,1336.762329,9.800300,90.858398,90.000000,44.287701);
CreateDynamicObject(874,2446.606445,1313.756226,9.550900,0.000000,0.000000,53.340000);
CreateDynamicObject(874,2471.364502,1255.169434,9.256800,0.000000,0.000000,45.540001);
CreateDynamicObject(874,2442.499023,1372.232910,9.483100,0.000000,0.000000,-96.239998);
CreateDynamicObject(874,2428.304932,982.990356,9.654750,0.000000,0.000000,0.000000);
CreateDynamicObject(3459,2526.355713,1195.143921,9.980300,90.858398,90.000000,-26.378389);
CreateDynamicObject(874,2528.625488,1192.814941,9.895000,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2526.198975,1254.113159,10.517400,0.000000,0.000000,-113.820000);
CreateDynamicObject(874,2549.279541,1194.558228,9.199500,0.000000,0.000000,65.940002);
CreateDynamicObject(874,2487.651611,1011.440430,9.869720,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2528.464355,1081.275513,9.768530,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2525.463867,1324.419678,9.244600,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,2528.563477,1071.098511,10.345500,0.000000,0.000000,-24.959999);
CreateDynamicObject(874,2496.175537,1373.793823,9.402600,0.000000,0.000000,88.680000);
CreateDynamicObject(874,2562.873291,1254.115967,9.656890,0.000000,0.000000,61.500000);
CreateDynamicObject(874,2377.196533,1474.306641,9.717250,0.000000,0.000000,0.000000);
CreateDynamicObject(3459,2549.182129,1309.176514,9.810000,90.141602,90.000000,54.005402);
CreateDynamicObject(3593,2607.074463,1166.144287,10.105500,0.000000,0.000000,-52.020000);
CreateDynamicObject(874,2607.703613,1218.939209,9.265100,0.000000,0.000000,0.000000);
CreateDynamicObject(1327,2589.177490,1075.191040,9.667700,0.000000,90.000000,0.000000);
CreateDynamicObject(874,2503.523438,952.890686,9.340400,0.000000,0.000000,-91.080002);
CreateDynamicObject(874,2568.347168,1016.717285,9.459000,0.000000,0.000000,-5.580000);
CreateDynamicObject(874,2601.956787,1076.117920,9.896980,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2374.568359,886.068420,6.933730,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2287.826904,884.591492,10.980230,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2547.993652,1395.927734,9.633600,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2613.056396,1315.899780,9.665810,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2426.557861,1472.619385,10.489900,0.000000,0.000000,-29.280001);
CreateDynamicObject(18451,2546.811523,947.104797,10.071700,0.000000,0.000000,17.040001);
CreateDynamicObject(874,2611.689209,1374.583862,9.439900,0.000000,0.000000,-61.439999);
CreateDynamicObject(2891,2422.290039,1192.000000,10.130000,0.000000,360.000000,300.000000);
CreateDynamicObject(874,2615.736328,979.838440,9.810080,0.000000,0.000000,0.000000);
CreateDynamicObject(734,2617.149170,977.882385,9.630200,0.000000,0.000000,54.119999);
CreateDynamicObject(874,2516.108643,1474.511719,9.502100,0.000000,0.000000,-50.340000);
CreateDynamicObject(874,2728.044189,1235.090332,5.543500,0.000000,0.000000,-38.400002);
CreateDynamicObject(874,2696.115723,1040.671387,5.554000,0.000000,0.000000,-37.139999);
CreateDynamicObject(874,2708.900879,1338.702515,5.431100,-0.020000,0.000000,0.000000);
CreateDynamicObject(874,2670.815186,1396.533447,7.106000,0.000000,0.000000,0.000000);
CreateDynamicObject(13591,2714.533447,1339.428589,6.129700,0.000000,0.000000,-71.699997);
CreateDynamicObject(3593,2648.489258,954.890015,6.086500,0.000000,0.000000,-178.440018);
CreateDynamicObject(734,2546.118652,1493.890137,9.714900,0.000000,0.000000,67.199997);
CreateDynamicObject(874,2767.119141,1314.603149,10.418910,0.000000,0.000000,47.520000);
CreateDynamicObject(683,2798.561523,1187.097412,9.747400,0.000000,0.000000,-74.099998);
CreateDynamicObject(1327,2611.065430,1487.393677,9.663300,0.000000,90.000000,0.000000);
CreateDynamicObject(1327,2550.786377,898.271912,11.847800,0.000000,85.000000,-83.400002);
CreateDynamicObject(3593,2642.614502,918.117615,6.227500,0.000000,0.000000,-96.720001);
CreateDynamicObject(3594,2640.518066,912.877625,6.302300,0.000000,0.000000,-45.480000);
CreateDynamicObject(735,2842.330566,1095.501831,8.659200,0.000000,8.000000,-100.139999);
CreateDynamicObject(874,2786.774414,1423.974609,8.797600,0.000000,0.000000,-30.000000);
CreateDynamicObject(874,2727.493408,889.743713,9.469000,0.000000,0.000000,-11.160000);
CreateDynamicObject(11748,2676.270020,1172.510010,10.040000,0.000000,360.000000,300.000000);
CreateDynamicObject(3594,2716.553955,1471.476318,13.565400,0.000000,0.000000,51.540001);
CreateDynamicObject(874,2723.722656,1470.656494,13.394700,0.000000,0.000000,0.000000);
CreateDynamicObject(734,2747.658447,826.803528,9.696400,0.000000,0.000000,-23.400000);
CreateDynamicObject(874,2793.631348,1508.598511,9.357900,0.000000,0.000000,0.000000);
CreateDynamicObject(734,2766.534668,1504.410889,9.330600,0.000000,0.000000,-117.599998);
CreateDynamicObject(3593,2729.689697,1523.599609,6.218900,0.000000,0.000000,-7.440010);
CreateDynamicObject(874,2608.194580,1503.297119,9.664990,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2696.563477,1582.921753,5.476200,0.000000,0.000000,-77.760002);
CreateDynamicObject(3585,2894.644775,1604.491455,11.527600,0.000000,0.000000,-89.580040);
CreateDynamicObject(3564,2879.280273,1610.596802,11.527600,0.000000,0.000000,-91.260010);
CreateDynamicObject(3585,2894.613770,1620.065430,11.527600,0.000000,0.000000,-89.580040);
CreateDynamicObject(734,2590.637695,1525.768188,9.704000,0.000000,0.000000,-130.440018);
CreateDynamicObject(735,2901.858154,1633.332031,8.513080,0.000000,0.000000,315.052155);
CreateDynamicObject(3564,2874.900146,1648.131348,11.527600,0.000000,0.000000,-70.739998);
CreateDynamicObject(735,2646.125000,1593.999756,9.044200,0.000000,0.000000,-103.680000);
CreateDynamicObject(3459,2566.900635,1506.849487,9.820300,90.858398,90.000000,-174.403351);
CreateDynamicObject(3459,2608.304932,1568.575073,9.820300,90.858398,90.000000,-239.623398);
CreateDynamicObject(735,2898.813232,1662.202393,8.980000,0.000000,0.000000,-63.120010);
CreateDynamicObject(874,2608.775146,1585.284790,9.660240,0.000000,0.000000,0.000000);
CreateDynamicObject(3585,2881.637695,1672.455566,11.287600,90.000000,0.000000,111.600014);
CreateDynamicObject(3564,2811.275146,1680.644775,11.527600,0.000000,0.000000,-91.199997);
CreateDynamicObject(3585,2811.286865,1690.161255,11.527600,0.000000,0.000000,-92.339996);
CreateDynamicObject(874,2861.464111,1687.913208,9.528200,0.000000,0.000000,149.335709);
CreateDynamicObject(3585,2825.632568,1694.079590,11.527600,270.000000,0.000000,-137.640060);
CreateDynamicObject(3564,2822.779541,1710.791626,11.527600,0.000000,0.000000,-70.739998);
CreateDynamicObject(874,2841.770752,1714.214355,9.528200,0.000000,0.000000,116.587219);
CreateDynamicObject(874,2809.194092,1723.007080,9.528200,0.000000,0.000000,116.587219);
CreateDynamicObject(874,2728.473389,1718.854492,5.501400,0.000000,0.000000,0.000000);
CreateDynamicObject(1575,2763.610107,1437.939941,10.030000,0.000000,360.000000,300.000000);
CreateDynamicObject(3585,2829.894775,1732.797363,11.527600,0.000000,0.000000,-50.340000);
CreateDynamicObject(874,2818.625488,1736.406616,9.806990,0.000000,0.000000,-80.220009);
CreateDynamicObject(3585,2823.283691,1742.230713,11.247600,90.000000,0.000000,108.239998);
CreateDynamicObject(874,2842.523682,1745.044434,9.528200,0.000000,0.000000,116.587219);
CreateDynamicObject(3594,2842.398926,1752.774902,10.389600,0.000000,0.000000,344.519287);
CreateDynamicObject(695,2860.197266,1750.390991,8.953700,0.000000,0.000000,-90.779999);
CreateDynamicObject(874,2855.483643,1752.678711,9.528200,0.000000,0.000000,116.587219);
CreateDynamicObject(695,2846.726318,1754.994385,9.033700,0.000000,0.000000,-69.599998);
CreateDynamicObject(683,2870.200195,1750.562622,9.616100,0.000000,0.000000,0.000000);
CreateDynamicObject(12986,2874.554199,1751.125977,11.292600,0.000000,0.000000,91.590683);
CreateDynamicObject(874,2840.476074,1761.065918,9.528200,0.000000,0.000000,116.587219);
CreateDynamicObject(874,2868.978760,1756.856079,9.528200,0.000000,0.000000,116.587219);
CreateDynamicObject(835,2864.428223,1766.065552,9.773900,0.000000,0.000000,108.360001);
CreateDynamicObject(3585,2798.029053,1779.039185,11.527600,0.000000,0.000000,-68.519997);
CreateDynamicObject(874,2870.599854,1772.827515,10.252700,0.000000,0.000000,-26.639999);
CreateDynamicObject(16601,2857.478271,1776.721802,14.440000,0.000000,0.000000,0.000000);
CreateDynamicObject(834,2865.155762,1776.074829,9.773900,0.000000,0.000000,22.379999);
CreateDynamicObject(735,2878.052246,1775.387085,8.825400,0.000000,0.000000,-70.680000);
CreateDynamicObject(874,2878.798096,1775.629883,10.252700,0.000000,0.000000,0.000000);
CreateDynamicObject(3585,2795.137695,1786.568237,11.527600,0.000000,0.000000,-69.360123);
CreateDynamicObject(16601,2857.648193,1784.420654,14.440000,0.000000,0.000000,0.000000);
CreateDynamicObject(8885,2831.044189,1791.713257,9.806800,0.000000,0.000000,-90.059967);
CreateDynamicObject(8885,2834.844971,1791.761597,9.806800,0.000000,0.000000,-90.059967);
CreateDynamicObject(7040,2843.250244,1792.008301,13.140000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2824.925293,1804.618896,9.528200,0.000000,0.000000,116.587219);
CreateDynamicObject(3066,2858.876465,1802.898682,10.858100,0.000000,0.000000,3.480000);
CreateDynamicObject(3066,2880.880127,1799.850830,10.898100,0.000000,0.000000,91.199997);
CreateDynamicObject(3066,2864.363037,1803.340576,10.898100,0.000000,0.000000,3.480000);
CreateDynamicObject(3066,2869.910156,1803.718506,10.898100,0.000000,0.000000,3.480000);
CreateDynamicObject(18260,2900.669678,1800.201294,11.374200,0.000000,0.000000,1.680000);
CreateDynamicObject(3564,2882.557861,1807.898438,11.527600,0.000000,0.000000,-20.400000);
CreateDynamicObject(734,2690.539063,1787.042480,6.738100,0.000000,0.000000,-269.459991);
CreateDynamicObject(1431,2902.946777,1803.116577,10.330700,0.000000,0.000000,-180.240005);
CreateDynamicObject(874,2836.312500,1815.281372,9.528200,0.000000,0.000000,75.959999);
CreateDynamicObject(3585,2874.994629,1810.708618,11.527600,0.000000,0.000000,-20.400000);
CreateDynamicObject(1431,2905.458740,1803.258789,10.330700,0.000000,0.000000,-180.240005);
CreateDynamicObject(1431,2902.981201,1805.173706,10.330700,0.000000,0.000000,-180.240005);
CreateDynamicObject(8634,2871.143066,1812.975220,10.480900,0.000000,0.000000,68.699997);
CreateDynamicObject(1431,2905.512207,1805.272949,10.330700,0.000000,0.000000,-180.240005);
CreateDynamicObject(960,2882.674072,1811.277100,10.131300,0.000000,0.000000,-83.820007);
CreateDynamicObject(1431,2903.133545,1807.275513,10.330700,0.000000,0.000000,-180.240005);
CreateDynamicObject(1431,2905.494629,1807.395386,10.330700,0.000000,0.000000,-180.240005);
CreateDynamicObject(1299,2881.803955,1814.013062,10.258300,0.000000,0.000000,0.000000);
CreateDynamicObject(3585,2856.906250,1818.715942,11.331600,270.000000,0.000000,190.620117);
CreateDynamicObject(1431,2905.485352,1808.978027,9.770700,0.000000,0.000000,-57.720001);
CreateDynamicObject(1431,2905.151855,1810.318604,10.330700,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2892.023193,1814.246704,8.778800,0.000000,0.000000,55.860001);
CreateDynamicObject(1219,2882.396973,1817.467773,10.015600,0.000000,0.000000,0.000000);
CreateDynamicObject(1220,2882.123779,1817.784790,10.612100,0.000000,0.000000,-85.620003);
CreateDynamicObject(3564,2844.118408,1823.087036,11.527600,0.000000,0.000000,-20.400000);
CreateDynamicObject(960,2885.406006,1817.641357,10.131300,0.000000,0.000000,-32.700001);
CreateDynamicObject(3576,2905.274170,1812.904785,11.297900,0.000000,0.000000,-88.259987);
CreateDynamicObject(3014,2901.217773,1814.363403,11.538100,0.000000,0.000000,96.120293);
CreateDynamicObject(3015,2899.691895,1814.952637,9.938100,0.000000,0.000000,133.500107);
CreateDynamicObject(3576,2900.996094,1814.777954,9.812900,0.000000,0.000000,40.560001);
CreateDynamicObject(3014,2900.238770,1815.551636,9.938100,0.000000,0.000000,39.180279);
CreateDynamicObject(3014,2900.014160,1816.035034,9.938100,0.000000,0.000000,127.680298);
CreateDynamicObject(960,2882.988037,1820.121094,10.131300,0.000000,0.000000,-8.220000);
CreateDynamicObject(3585,2835.052002,1826.696045,11.527600,0.000000,0.000000,-22.559999);
CreateDynamicObject(8633,2879.917480,1822.632690,10.480900,0.000000,0.000000,69.599998);
CreateDynamicObject(3564,2900.349609,1819.892334,11.527600,0.000000,0.000000,-20.400000);
CreateDynamicObject(3091,2828.753174,1829.366455,10.443100,0.000000,0.000000,-111.120003);
CreateDynamicObject(3585,2892.778076,1822.709961,11.527600,0.000000,0.000000,-20.400000);
CreateDynamicObject(3491,2879.221924,1825.441528,18.224001,0.000000,0.000000,-88.860001);
CreateDynamicObject(8628,2813.846924,1829.818848,9.941900,0.000000,0.000000,49.439999);
CreateDynamicObject(1431,2890.954102,1823.324707,11.290700,0.000000,0.000000,18.900000);
CreateDynamicObject(3564,2885.198486,1825.517578,11.527600,0.000000,0.000000,-20.400000);
CreateDynamicObject(3585,2838.392578,1833.040527,11.527600,0.000000,0.000000,0.060000);
CreateDynamicObject(3564,2808.402100,1833.288696,11.527600,0.000000,0.000000,-1.020000);
CreateDynamicObject(3564,2875.032227,1830.742065,11.331600,90.000000,0.000000,182.460007);
CreateDynamicObject(874,2861.065918,1832.987183,9.815670,0.000000,0.000000,0.000000);
CreateDynamicObject(3585,2800.312256,1833.435425,11.527600,0.000000,0.000000,-1.020000);
CreateDynamicObject(3585,2787.727783,1833.481079,11.259600,90.000000,0.000000,-27.000000);
CreateDynamicObject(18451,2708.250000,1812.108643,6.269100,0.000000,0.000000,-20.340000);
CreateDynamicObject(3066,2898.429932,1834.582031,10.898100,0.000000,0.000000,1.320000);
CreateDynamicObject(3066,2904.839355,1835.035645,10.778100,0.000000,0.000000,1.320000);
CreateDynamicObject(874,2880.313232,1841.559326,9.098800,0.000000,0.000000,55.860001);
CreateDynamicObject(5269,2875.997559,1844.489502,8.620000,0.000000,0.000000,89.220016);
CreateDynamicObject(5269,2855.273193,1848.271973,8.620000,0.000000,0.000000,0.780020);
CreateDynamicObject(874,2814.118896,1848.621826,10.379380,0.000000,0.000000,17.039770);
CreateDynamicObject(5262,2862.616455,1848.423218,12.654400,0.000000,0.000000,90.419968);
CreateDynamicObject(3585,2785.113770,1845.828369,11.431600,0.000000,0.000000,-90.900002);
CreateDynamicObject(5269,2875.957275,1847.967773,8.660000,0.000000,0.000000,90.059998);
CreateDynamicObject(3066,2884.215576,1847.116089,10.898100,0.000000,0.000000,1.320000);
CreateDynamicObject(5262,2872.589600,1849.174927,7.960000,0.000000,0.000000,179.580002);
CreateDynamicObject(3066,2891.115723,1847.381104,10.898100,0.000000,0.000000,1.320000);
CreateDynamicObject(901,2913.730957,1843.309814,9.429300,0.000000,0.000000,50.699940);
CreateDynamicObject(3066,2898.322021,1847.069336,10.898100,0.000000,0.000000,1.320000);
CreateDynamicObject(5269,2876.082275,1851.852417,12.120000,0.000000,0.000000,90.899971);
CreateDynamicObject(3066,2904.683350,1847.639160,10.778100,0.000000,0.000000,1.320000);
CreateDynamicObject(3091,2785.204834,1850.808350,10.353100,-40.000000,0.000000,-180.780106);
CreateDynamicObject(874,2767.205566,1848.058594,10.256770,0.000000,0.000000,-6.120000);
CreateDynamicObject(3054,2846.567627,1862.505493,11.818100,0.000000,0.000000,1.320000);
CreateDynamicObject(1327,2840.333984,1864.623901,9.739700,0.000000,90.000000,0.000000);
CreateDynamicObject(874,2846.091797,1864.680054,9.528200,0.000000,0.000000,75.959999);
CreateDynamicObject(10985,2848.006592,1871.395752,10.365600,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2841.062744,1872.710449,9.528200,0.000000,0.000000,-6.120000);
CreateDynamicObject(10984,2900.197021,1870.207153,10.805600,0.000000,0.000000,-124.259987);
CreateDynamicObject(734,2874.184326,1873.977783,9.445700,0.000000,0.000000,-74.820000);
CreateDynamicObject(900,2917.908447,1866.569092,9.429290,0.000000,0.000000,63.720009);
CreateDynamicObject(874,2896.582764,1878.631470,10.617000,0.000000,0.000000,62.820000);
CreateDynamicObject(10984,2896.351318,1883.976440,10.805600,0.000000,0.000000,-83.099983);
CreateDynamicObject(874,2892.278564,1885.290405,10.617000,0.000000,0.000000,-9.300000);
CreateDynamicObject(734,2838.131104,1892.768311,9.565700,0.000000,0.000000,-86.760002);
CreateDynamicObject(695,2876.838867,1908.098877,9.153700,0.000000,0.000000,-26.700001);
CreateDynamicObject(735,2888.108398,1926.276001,8.968900,0.000000,0.000000,0.000000);
CreateDynamicObject(19897,2894.417480,1619.569336,10.821400,0.000000,360.000000,300.000000);
CreateDynamicObject(874,2727.484619,1906.029419,5.566200,0.000000,0.000000,0.000000);
CreateDynamicObject(18451,2831.907959,1978.596191,10.179600,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2736.600098,1953.955933,12.608840,0.000000,0.000000,33.900002);
CreateDynamicObject(874,2547.984375,1664.156982,9.658710,0.000000,0.000000,0.000000);
CreateDynamicObject(19562,2811.329102,1690.100464,10.821300,0.000000,360.000000,300.000000);
CreateDynamicObject(960,2702.867676,1976.967041,6.130700,0.000000,0.000000,-25.020000);
CreateDynamicObject(874,2729.197510,2017.309937,5.716670,0.000000,0.000000,0.000000);
CreateDynamicObject(19473,2841.490234,1758.519897,10.016340,0.000000,360.000000,300.000000);
CreateDynamicObject(1950,2829.575195,1743.418701,9.920313,0.000000,360.000000,250.000000);
CreateDynamicObject(874,2849.383301,2059.783936,9.447700,0.000000,0.000000,-46.259998);
CreateDynamicObject(874,2585.055664,1954.593506,9.794870,0.000000,0.000000,0.000000);
CreateDynamicObject(19897,2794.978760,1786.594238,10.820100,0.000000,360.000000,300.000000);
CreateDynamicObject(874,2666.300537,2041.016602,7.965610,0.000000,0.000000,0.000000);
CreateDynamicObject(2769,2841.647705,1791.960449,9.998800,0.000000,360.000000,300.000000);
CreateDynamicObject(874,2780.202148,2095.794434,9.108400,0.000000,0.000000,-183.240021);
CreateDynamicObject(13591,2788.115479,2097.067139,10.240400,0.000000,0.000000,33.240002);
CreateDynamicObject(2891,2835.220947,1826.706299,10.820400,0.000000,360.000000,300.000000);
CreateDynamicObject(1575,2838.301270,1833.107056,10.820600,0.000000,360.000000,300.000000);
CreateDynamicObject(874,2845.893311,2116.465576,9.581300,0.000000,0.000000,-48.959999);
CreateDynamicObject(1327,2697.711182,2081.153076,6.528400,0.000000,20.000000,-157.499893);
CreateDynamicObject(897,2692.835693,2078.505859,7.079500,0.000000,0.000000,0.000000);
CreateDynamicObject(1575,2858.842041,1845.362061,11.029800,0.000000,360.000000,300.000000);
CreateDynamicObject(874,2754.364258,2112.900391,11.437330,0.000000,0.000000,0.000000);
CreateDynamicObject(1512,2885.876953,1851.399048,9.896500,0.000000,360.000000,300.000000);
CreateDynamicObject(1575,2896.181885,1851.314819,9.896500,0.000000,360.000000,300.000000);
CreateDynamicObject(11748,2904.805908,1835.866821,11.862200,0.000000,360.000000,300.000000);
CreateDynamicObject(1672,2904.796143,1848.218262,11.862200,0.000000,360.000000,300.000000);
CreateDynamicObject(1575,2905.027588,1808.358887,9.889900,0.000000,360.000000,300.000000);
CreateDynamicObject(18632,2904.305664,1805.703247,9.889900,0.000000,360.000000,300.000000);
CreateDynamicObject(841,2880.396484,1799.603271,11.891700,0.000000,360.000000,300.000000);
CreateDynamicObject(2684,2868.203125,1799.335938,11.895000,0.000000,360.000000,300.000000);
CreateDynamicObject(1441,2710.417480,2109.642090,13.410900,0.000000,0.000000,-150.659988);
CreateDynamicObject(19793,2873.894287,1895.903198,9.932000,0.000000,360.000000,300.000000);
CreateDynamicObject(734,2758.862793,2166.932373,7.650800,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2779.316406,2175.294189,8.405500,0.000000,0.000000,-7.860000);
CreateDynamicObject(3594,2874.360840,2202.876953,10.437700,0.000000,0.000000,-137.279999);
CreateDynamicObject(735,2875.176514,2207.669189,9.028600,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,2847.319092,2232.226563,10.024600,0.000000,0.000000,-202.260025);
CreateDynamicObject(734,2875.844971,2273.695068,9.649800,0.000000,0.000000,-137.699936);
CreateDynamicObject(3593,2847.962891,2262.615967,10.004600,0.000000,0.000000,-47.820000);
CreateDynamicObject(849,2848.486572,2266.602783,9.965600,0.000000,0.000000,4.560000);
CreateDynamicObject(1259,2911.354248,2293.480225,12.036300,-1.718400,90.180000,-44.198399);
CreateDynamicObject(735,2798.618164,2245.462646,9.204200,0.000000,0.000000,-45.600010);
CreateDynamicObject(1327,2906.947510,2310.826416,10.608800,0.000000,0.000000,-41.580002);
CreateDynamicObject(874,2847.311279,2291.284912,9.558200,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2904.227539,2320.050293,9.669940,0.000000,0.000000,-1.260000);
CreateDynamicObject(734,2799.348633,2281.842041,9.835200,0.000000,0.000000,-23.219999);
CreateDynamicObject(3593,2799.101074,2292.258057,10.038900,0.000000,0.000000,42.360001);
CreateDynamicObject(3594,2880.895752,2336.475342,10.198200,0.000000,0.000000,124.440002);
CreateDynamicObject(3593,2725.529785,2224.233887,6.096900,0.000000,0.000000,-41.639999);
CreateDynamicObject(3593,2854.391113,2333.403320,10.191900,0.000000,0.000000,134.759995);
CreateDynamicObject(874,2886.842529,2347.041504,9.818910,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,2889.690918,2349.228271,10.192000,0.000000,0.000000,40.619999);
CreateDynamicObject(734,2847.252197,2337.705566,9.863500,0.000000,0.000000,-10.320000);
CreateDynamicObject(874,2731.744385,2260.744629,5.530100,-0.020000,0.000000,-0.180000);
CreateDynamicObject(13591,2884.281738,2367.739990,10.047500,0.000000,0.000000,41.580002);
CreateDynamicObject(3593,2813.450195,2336.302246,10.186800,0.000000,0.000000,-298.140015);
CreateDynamicObject(874,2881.586670,2368.676270,9.820250,0.000000,0.000000,0.000000);
CreateDynamicObject(19630,2970.497803,2079.406494,0.956847,0.000000,360.000000,250.000000);
CreateDynamicObject(841,2873.860352,1770.773682,9.888500,0.000000,360.000000,300.000000);
CreateDynamicObject(19473,2854.068115,1754.299316,10.695680,0.000000,360.000000,300.000000);
CreateDynamicObject(19447,2821.300293,2665.959229,811.715881,0.000000,0.000000,0.000000);
CreateDynamicObject(914,2815.735352,2668.850342,811.529907,90.000000,90.000000,45.000000);
CreateDynamicObject(19447,2821.300293,2665.959229,815.213928,0.000000,180.000000,0.000000);
CreateDynamicObject(1437,2817.840088,2664.652588,809.985901,10.000000,0.000000,0.000000);
CreateDynamicObject(3111,2814.504395,2667.089600,813.183899,0.000000,90.000000,-179.820099);
CreateDynamicObject(1437,2817.840088,2664.637695,815.772522,10.000000,0.000000,0.000000);
CreateDynamicObject(19447,2817.418945,2663.553467,811.715881,0.000000,0.000000,90.000000);
CreateDynamicObject(921,2814.597412,2668.617676,813.994324,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2814.392822,2665.959229,811.715881,0.000000,0.000000,0.000000);
CreateDynamicObject(19362,2818.909912,2672.223877,811.462830,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2814.392822,2665.959229,815.213928,0.000000,180.000000,0.000000);
CreateDynamicObject(19355,2822.830322,2670.712402,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2819.203613,2661.871582,811.715881,0.000000,0.000000,45.000000);
CreateDynamicObject(19355,2822.830322,2670.712402,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(19355,2821.306641,2670.461670,817.046265,-45.000000,0.000000,0.000000);
CreateDynamicObject(19362,2815.410400,2672.223877,811.462830,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2816.501709,2661.867676,811.715881,0.000000,0.000000,-45.000000);
CreateDynamicObject(19447,2819.203613,2661.871582,815.174377,0.000000,180.000000,45.000000);
CreateDynamicObject(19362,2822.408447,2672.223877,811.462830,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2816.816895,2670.503906,818.019043,180.000000,180.000000,90.000000);
CreateDynamicObject(19447,2824.654053,2665.238037,811.715881,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2816.501709,2661.867676,815.213928,0.000000,180.000000,-45.000000);
CreateDynamicObject(3502,2817.749756,2664.166260,818.290649,90.000000,0.000000,0.000000);
CreateDynamicObject(19355,2812.872314,2670.693604,813.296631,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2821.300293,2665.959229,818.710388,180.000000,180.000000,0.000000);
CreateDynamicObject(19355,2814.390625,2670.470947,817.046326,-45.000000,0.000000,0.000000);
CreateDynamicObject(19447,2824.654053,2665.238037,815.213928,0.000000,180.000000,90.000000);
CreateDynamicObject(19447,2817.831299,2673.745605,809.798950,0.000000,0.000000,90.000000);
CreateDynamicObject(19355,2812.872314,2670.693604,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(19377,2816.904541,2665.339111,819.295654,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2814.392822,2665.959229,818.710388,180.000000,180.000000,0.000000);
CreateDynamicObject(19447,2811.024658,2665.238037,811.715881,0.000000,0.000000,90.000000);
CreateDynamicObject(921,2812.534424,2672.530518,813.994324,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2819.203613,2661.871582,818.714172,0.000000,0.000000,45.000000);
CreateDynamicObject(19447,2811.024658,2665.238037,815.213928,0.000000,180.000000,90.000000);
CreateDynamicObject(19362,2811.917480,2672.223877,811.462830,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2816.501709,2661.867676,818.714172,0.000000,0.000000,-45.000000);
CreateDynamicObject(19447,2824.654053,2665.238037,818.714172,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2823.421143,2674.835693,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2817.903564,2675.687500,816.321106,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2823.421143,2674.835693,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19447,2812.325195,2674.841064,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2811.024658,2665.238037,818.714172,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2812.325195,2674.841064,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19447,2820.489502,2678.628418,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2822.160645,2678.643311,811.462830,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,2817.831299,2679.062500,810.351318,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2815.408691,2678.628418,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2817.831299,2679.062500,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2813.738281,2678.643311,811.462830,0.000000,90.000000,0.000000);
CreateDynamicObject(1462,2812.907471,2678.273682,811.546875,0.000000,0.000000,81.780029);
CreateDynamicObject(921,2812.534424,2680.405029,813.994324,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2831.221191,2674.826416,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2831.221191,2674.826416,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19447,2828.258789,2679.490967,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(1370,2803.593994,2670.445557,812.079102,0.000000,0.000000,85.000000);
CreateDynamicObject(19447,2804.295898,2673.048340,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(1370,2803.336670,2669.444092,812.079102,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2828.258789,2679.490967,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(19447,2804.295898,2673.048340,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(921,2804.083252,2673.294678,813.994324,0.000000,0.000000,-90.000000);
CreateDynamicObject(19454,2803.026855,2664.697998,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19454,2832.735107,2675.613281,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(1370,2802.599609,2670.335449,811.899109,90.000000,0.000000,134.771698);
CreateDynamicObject(1370,2802.350098,2669.253418,812.079102,0.000000,0.000000,45.000000);
CreateDynamicObject(19454,2803.029785,2674.329102,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2801.362549,2668.192627,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2823.421143,2684.463623,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2823.421143,2684.463623,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19447,2812.325195,2684.470947,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2812.325195,2684.470947,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19447,2800.282227,2668.324951,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2800.282227,2668.324951,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(10444,2816.210693,2685.857910,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2816.210693,2685.857910,810.682739,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2800.416992,2671.191406,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2834.406738,2677.814941,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2827.423096,2684.224121,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(921,2804.083252,2680.329834,813.994324,0.000000,0.000000,-90.000000);
CreateDynamicObject(925,2832.413330,2681.437744,812.581726,0.000000,0.000000,91.150299);
CreateDynamicObject(19377,2808.225830,2684.211914,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2820.490234,2687.442627,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2822.158936,2687.438965,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2801.362549,2677.819580,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2815.409180,2687.442627,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(1440,2813.234131,2687.254883,812.053589,0.000000,0.000000,90.000000);
CreateDynamicObject(19454,2813.721924,2687.444824,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2798.003906,2668.336426,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2798.003906,2668.336426,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(16086,2821.266113,2687.919678,815.701172,180.000000,0.000000,90.000000);
CreateDynamicObject(1448,2799.445557,2675.596924,811.332825,0.000000,0.000000,5.000000);
CreateDynamicObject(19447,2804.295898,2682.666992,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2830.671143,2684.619629,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2830.671143,2684.619629,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2804.295898,2682.666992,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19447,2831.221191,2684.456787,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2798.597168,2673.714844,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2831.221191,2684.456787,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19377,2798.597168,2673.714844,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(931,2832.356689,2684.185303,812.581726,0.000000,0.000000,91.150284);
CreateDynamicObject(921,2812.534424,2688.298584,813.994324,0.000000,0.000000,90.000000);
CreateDynamicObject(635,2837.036133,2679.532471,814.495483,0.000000,-90.000000,-90.000000);
CreateDynamicObject(19454,2832.723633,2684.435303,811.467773,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,2817.831299,2689.558105,810.351318,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2804.289063,2684.463623,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2796.484863,2669.528564,811.472778,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2804.289063,2684.463623,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19377,2817.831299,2689.558105,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19355,2825.011963,2689.200928,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2837.894775,2679.490967,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19355,2823.917725,2689.198486,816.748413,45.000000,0.000000,270.000000);
CreateDynamicObject(19447,2837.881348,2679.490967,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(19454,2803.029785,2683.957764,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19355,2825.011963,2689.200928,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19355,2810.806641,2689.205078,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19355,2811.837646,2689.199951,816.748413,45.000000,0.000000,90.000000);
CreateDynamicObject(1438,2813.297119,2690.096924,811.559387,0.000000,0.000000,167.918564);
CreateDynamicObject(19447,2838.425781,2679.490967,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19355,2810.806641,2689.205078,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19355,2828.201660,2689.200928,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19355,2809.008545,2689.200928,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19454,2825.238037,2690.501953,811.462830,0.000000,90.000000,90.000000);
CreateDynamicObject(19355,2828.201660,2689.200928,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19355,2809.008545,2689.200928,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(10444,2801.750244,2684.619629,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2801.750244,2684.619629,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(19355,2829.691162,2689.192871,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(921,2804.083252,2687.024658,813.994324,0.000000,0.000000,-90.000000);
CreateDynamicObject(921,2807.937744,2689.410156,813.994324,0.000000,0.000000,180.000000);
CreateDynamicObject(1450,2808.640625,2689.899170,812.131409,0.000000,0.000000,180.000000);
CreateDynamicObject(19355,2829.691162,2689.192871,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19454,2809.847900,2690.514893,811.462830,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2837.085693,2684.211426,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2837.085693,2684.211426,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19355,2830.729980,2689.190674,816.748413,45.000000,0.000000,90.000000);
CreateDynamicObject(1448,2798.138428,2682.015137,811.332825,0.000000,0.000000,45.000000);
CreateDynamicObject(19355,2805.811523,2689.200928,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2839.662354,2681.283936,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2829.672607,2690.495605,811.477783,0.000000,90.000000,90.000000);
CreateDynamicObject(19355,2805.811523,2689.200928,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19447,2834.406738,2687.441162,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2825.231689,2692.173340,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19355,2804.791748,2689.195313,816.748413,45.000000,0.000000,270.000000);
CreateDynamicObject(19447,2810.671875,2692.189697,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19377,2798.597168,2684.216553,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2806.104492,2690.514893,811.472778,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2798.597168,2684.216553,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2841.344482,2681.288574,811.467773,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,2798.046631,2683.843262,816.337097,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2801.362549,2687.451660,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(1448,2793.144043,2675.020996,811.332825,0.000000,0.000000,85.000000);
CreateDynamicObject(19447,2829.678467,2692.168213,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2795.443848,2681.299316,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(16086,2811.093018,2693.507568,815.701172,180.000000,0.000000,0.000000);
CreateDynamicObject(19377,2817.843994,2694.713623,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2817.843994,2694.713623,816.337097,0.000000,90.000000,90.000000);
CreateDynamicObject(19355,2843.229004,2679.419678,816.748413,45.000000,0.000000,270.000000);
CreateDynamicObject(19447,2806.097900,2692.184570,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2790.782471,2671.191406,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19454,2841.344482,2684.426758,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(19454,2793.773926,2681.307373,811.462830,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,2827.461914,2694.713623,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2827.461914,2694.713623,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(1440,2789.678467,2669.642822,812.045288,0.000000,0.000000,-184.380005);
CreateDynamicObject(1449,2792.752197,2681.024414,812.051025,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2842.735107,2684.148438,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2808.222900,2694.713623,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2842.735107,2684.148438,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19377,2808.222900,2694.713623,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(3260,2841.208740,2686.432861,811.593872,-90.000000,0.000000,15.000000);
CreateDynamicObject(19447,2790.706543,2676.566406,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19355,2791.907715,2679.588135,816.669983,45.000000,0.000000,90.000000);
CreateDynamicObject(19447,2788.372314,2668.336426,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2788.372314,2668.336426,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(19377,2788.970947,2673.714844,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2788.970947,2673.714844,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2795.429932,2687.451660,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(635,2820.270020,2698.371094,814.495544,0.000000,-90.000000,90.000000);
CreateDynamicObject(19447,2820.646240,2698.491211,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2792.470703,2684.333496,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2820.646240,2698.491211,815.082520,0.000000,-45.000000,90.000000);
CreateDynamicObject(19447,2820.646240,2698.491211,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2792.470703,2684.333496,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19447,2842.735596,2687.679932,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(10444,2845.132813,2684.619629,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2845.132813,2684.619629,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2839.662354,2690.908203,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(851,2786.986328,2669.814697,811.811218,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2786.849609,2669.528564,811.472778,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2811.029053,2698.491211,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19454,2793.748779,2687.439697,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19355,2815.909668,2699.079102,816.669983,45.000000,0.000000,0.000000);
CreateDynamicObject(19447,2811.016602,2698.491211,815.082520,0.000000,-45.000000,90.000000);
CreateDynamicObject(19447,2811.015137,2698.491211,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2827.269287,2698.485596,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2827.261230,2698.485596,815.082520,0.000000,-45.000000,90.000000);
CreateDynamicObject(19355,2815.885010,2700.034180,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19355,2815.885010,2700.034180,816.792297,180.000000,0.000000,0.000000);
CreateDynamicObject(19447,2792.482666,2687.445801,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2837.085693,2694.713623,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2792.482666,2687.445801,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19377,2837.085693,2694.713623,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2830.268555,2698.491211,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2787.699951,2679.583252,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19454,2787.209473,2678.237549,811.472778,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2787.699951,2679.583252,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19377,2798.597168,2694.713623,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2798.597168,2694.713623,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(1441,2793.004395,2689.946045,812.203918,0.000000,0.000000,90.000000);
CreateDynamicObject(19355,2831.989990,2699.026123,816.669983,45.000000,0.000000,0.000000);
CreateDynamicObject(19377,2788.449707,2683.852539,816.337097,0.000000,90.000000,90.000000);
CreateDynamicObject(635,2792.594238,2690.414307,814.495483,0.000000,-90.000000,180.000000);
CreateDynamicObject(19355,2806.132568,2700.029297,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2841.344482,2694.061523,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2801.383789,2698.491211,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2801.383789,2698.491211,815.082520,0.000000,-45.000000,90.000000);
CreateDynamicObject(19447,2801.383789,2698.491211,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2842.735107,2693.775635,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2787.326416,2684.619629,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2787.326416,2684.619629,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(944,2841.606689,2695.296143,812.385071,0.000000,0.000000,90.000000);
CreateDynamicObject(11718,2841.440674,2695.685547,812.955383,0.000000,0.000000,40.000000);
CreateDynamicObject(19447,2842.719238,2694.622803,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2842.719238,2694.622803,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19355,2791.891357,2692.165527,816.669983,45.000000,0.000000,90.000000);
CreateDynamicObject(19447,2839.666016,2697.568604,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2790.673340,2692.176514,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2781.156738,2671.191406,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2831.994385,2703.358398,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2796.162598,2698.490723,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2796.162598,2698.490723,815.082520,0.000000,-45.000000,90.000000);
CreateDynamicObject(19447,2796.162598,2698.490723,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2831.994385,2703.358398,816.792297,180.000000,0.000000,0.000000);
CreateDynamicObject(19377,2811.339600,2705.202637,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2833.333496,2703.234375,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2781.082275,2676.566406,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19377,2827.451416,2705.208740,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2846.699707,2694.816650,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2835.009521,2703.234619,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2787.738525,2692.176514,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2780.870605,2679.607910,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2787.738525,2692.176514,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19447,2831.986816,2705.042480,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2779.339111,2673.714844,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2780.870605,2679.607910,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19447,2778.737305,2668.336426,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19377,2779.339111,2673.714844,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2778.737305,2668.336426,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(19447,2831.986816,2705.042480,816.792297,180.000000,0.000000,0.000000);
CreateDynamicObject(19377,2788.972900,2694.713623,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19355,2843.208252,2699.347900,816.748413,45.000000,0.000000,270.000000);
CreateDynamicObject(19377,2788.972900,2694.713623,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(1448,2789.624512,2695.761475,811.332825,0.000000,0.000000,-45.000000);
CreateDynamicObject(19454,2777.221680,2669.528564,811.472778,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2777.983643,2676.551514,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19355,2791.439209,2699.051025,816.669983,45.000000,0.000000,0.000000);
CreateDynamicObject(19454,2844.405762,2700.627930,811.477783,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2837.085693,2705.211182,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2777.984619,2678.226318,811.462830,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2837.085693,2705.211182,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(2649,2832.558105,2707.428467,814.648010,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,2779.349609,2684.207031,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2847.461670,2699.351563,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2847.461670,2699.351563,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19447,2844.397461,2702.305420,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2786.147705,2696.671631,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2786.147705,2696.671631,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19355,2776.718994,2679.615479,816.669983,45.000000,0.000000,270.000000);
CreateDynamicObject(19447,2786.147705,2696.671631,816.792297,180.000000,0.000000,0.000000);
CreateDynamicObject(19447,2835.016357,2708.165527,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2791.432617,2703.234619,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2791.432617,2703.234619,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2791.432617,2703.234619,816.792297,180.000000,0.000000,0.000000);
CreateDynamicObject(19447,2776.140381,2684.339111,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2776.140381,2684.339111,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19454,2774.914551,2681.286377,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,2856.332031,2694.795166,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19355,2786.144775,2700.869629,816.669983,45.000000,0.000000,180.000000);
CreateDynamicObject(2674,2833.165039,2712.123291,811.575195,0.000000,0.000000,47.000000);
CreateDynamicObject(19377,2846.699707,2705.286865,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2846.699707,2705.286865,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2771.523193,2671.191406,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2773.244873,2681.281006,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2816.210693,2714.970947,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2816.210693,2714.970947,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2833.333496,2712.854736,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,2779.349609,2694.684326,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19355,2841.110840,2709.678467,816.748413,45.000000,0.000000,270.000000);
CreateDynamicObject(19377,2788.952881,2705.202637,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2853.548340,2700.627930,811.467773,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2788.952881,2705.202637,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19355,2842.126953,2709.641602,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19377,2817.852295,2715.703857,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19355,2842.126953,2709.641602,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(10444,2772.865723,2684.619629,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2772.865723,2684.619629,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2791.417480,2708.165527,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2830.673096,2714.970947,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(1440,2832.989502,2714.355469,812.053650,0.000000,0.000000,87.900063);
CreateDynamicObject(1265,2775.246338,2690.202881,811.954834,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2830.673096,2714.970947,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2832.006836,2714.669434,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2791.417480,2708.165527,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2791.417480,2708.165527,816.792297,180.000000,0.000000,0.000000);
CreateDynamicObject(19377,2827.456787,2715.707520,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2832.006836,2714.669434,816.792297,180.000000,0.000000,0.000000);
CreateDynamicObject(19377,2769.710205,2673.714844,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2769.710205,2673.714844,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2808.202148,2715.703857,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2769.107422,2668.336426,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2769.107422,2668.336426,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(19454,2774.914551,2690.905518,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2854.018311,2702.305420,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(2908,2832.406982,2715.426514,811.650879,0.000000,45.000000,0.000000);
CreateDynamicObject(19447,2857.093994,2699.351563,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2845.334229,2709.641602,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2857.093994,2699.351563,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19447,2776.140381,2693.960693,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2776.140381,2693.960693,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(1265,2774.614746,2691.561279,811.954773,0.000000,0.000000,150.000000);
CreateDynamicObject(19447,2781.408203,2701.405518,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(10444,2801.750244,2714.970947,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2781.408203,2701.405518,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(10444,2801.750244,2714.970947,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2781.408203,2701.405518,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2776.151855,2695.447754,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2776.151855,2695.447754,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19454,2767.588623,2669.528564,811.472778,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2773.244873,2690.913818,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2848.209229,2709.639893,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19377,2837.085693,2715.703369,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2837.085693,2715.703369,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2774.908691,2695.091064,811.462830,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,2769.710205,2684.207031,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2840.604736,2714.407715,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2767.393066,2674.266602,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2840.604736,2714.407715,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19377,2769.710205,2684.207031,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2840.604736,2714.407715,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2817.630127,2719.401367,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(952,2774.736328,2695.227539,812.759827,0.000000,0.000000,180.000000);
CreateDynamicObject(19447,2817.630127,2719.401367,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(19447,2777.966064,2699.961914,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2777.966064,2699.961914,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19377,2798.572021,2715.703857,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2833.347900,2717.757324,811.462830,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2845.362793,2712.788330,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2827.260986,2719.401367,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2827.260986,2719.401367,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(19447,2845.362793,2712.788330,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19454,2848.212402,2711.301025,811.472778,0.000000,90.000000,90.000000);
CreateDynamicObject(1687,2847.169189,2712.025879,814.227783,90.000000,0.000000,358.166290);
CreateDynamicObject(19454,2860.112793,2700.406250,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(1440,2819.922119,2720.411865,812.081726,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2835.024414,2717.790771,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2777.983643,2701.413574,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2808.004639,2719.401367,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2777.983643,2701.413574,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(19447,2808.004639,2719.401367,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(19447,2777.983643,2701.413574,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2843.667969,2714.404053,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19355,2832.002197,2718.817627,816.669983,45.000000,0.000000,180.000000);
CreateDynamicObject(19447,2843.667969,2714.404053,816.792297,180.000000,0.000000,0.000000);
CreateDynamicObject(19377,2856.326172,2705.286865,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2820.651367,2720.860107,811.472778,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2856.326172,2705.286865,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(3675,2860.385986,2700.903564,810.183472,0.000000,0.000000,-90.000000);
CreateDynamicObject(19454,2765.719482,2676.091064,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(3675,2764.871338,2669.970947,812.821716,0.000000,90.000000,90.000000);
CreateDynamicObject(3675,2764.871338,2669.970947,814.371582,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2767.393066,2683.892578,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2811.027588,2720.860107,811.472778,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2773.229980,2696.670898,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2861.323486,2700.932617,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2861.323486,2700.932617,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19447,2764.392822,2667.963379,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2764.392822,2667.963379,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(10444,2845.132813,2714.970947,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2845.132813,2714.970947,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(3675,2774.501709,2699.296631,811.548767,0.000000,0.000000,0.000000);
CreateDynamicObject(3675,2859.357178,2703.745605,811.530029,-90.000000,0.000000,88.119698);
CreateDynamicObject(3675,2860.385986,2702.540039,810.183472,0.000000,0.000000,-90.000000);
CreateDynamicObject(19377,2779.319092,2705.202637,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2779.319092,2705.202637,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2830.278320,2720.860107,811.472778,0.000000,90.000000,90.000000);
CreateDynamicObject(1219,2770.335938,2693.119873,811.194580,0.000000,0.000000,17.000000);
CreateDynamicObject(19447,2800.645020,2719.376709,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2800.645020,2719.376709,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(19355,2849.590332,2712.794189,816.748413,45.000000,0.000000,90.000000);
CreateDynamicObject(19447,2781.418213,2707.937012,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(2649,2789.729248,2714.272949,815.755981,0.000000,180.000000,0.000000);
CreateDynamicObject(19447,2820.654297,2722.524170,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2764.392822,2677.591309,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2764.392822,2677.591309,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19447,2811.023193,2722.524170,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2786.147705,2712.669189,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2846.716309,2715.778809,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2765.719482,2685.725098,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,2769.710205,2694.684326,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2801.408936,2720.860107,811.472778,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2769.710205,2694.684326,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2858.414551,2707.057373,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2781.410400,2709.609619,811.472778,0.000000,90.000000,90.000000);
CreateDynamicObject(19428,2773.229980,2700.691650,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2830.286865,2722.524170,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(3675,2860.385986,2705.293457,810.183472,0.000000,0.000000,-90.000000);
CreateDynamicObject(19428,2773.229980,2700.691650,816.792419,180.000000,0.000000,0.000000);
CreateDynamicObject(19974,2851.092773,2713.857422,811.578125,-90.000000,0.000000,337.646393);
CreateDynamicObject(19377,2788.948975,2715.691895,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2840.609619,2719.790283,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2788.948975,2715.691895,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2840.609619,2719.790283,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19447,2840.609619,2719.790283,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19355,2782.349609,2710.994385,816.669983,45.000000,0.000000,90.000000);
CreateDynamicObject(10444,2787.326416,2714.970947,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2787.326416,2714.970947,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2791.417480,2717.790771,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19428,2773.249512,2702.087158,816.792419,-45.000000,0.000000,0.000000);
CreateDynamicObject(19447,2791.417480,2717.790771,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2791.417480,2717.790771,816.792297,180.000000,0.000000,0.000000);
CreateDynamicObject(19447,2802.616455,2722.520508,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19355,2797.668945,2720.968506,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(1327,2784.817383,2713.907471,811.534363,0.000000,90.000000,90.000000);
CreateDynamicObject(3675,2860.385986,2707.019775,810.183472,0.000000,0.000000,-90.000000);
CreateDynamicObject(19447,2767.393066,2693.521729,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19355,2797.668945,2720.968506,816.792297,180.000000,0.000000,0.000000);
CreateDynamicObject(19447,2764.392822,2687.220703,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2801.391846,2722.524170,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2764.392822,2687.220703,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(2649,2798.249268,2721.612061,814.608093,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2852.945313,2714.407715,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19355,2797.667480,2721.924561,816.669983,45.000000,0.000000,180.000000);
CreateDynamicObject(19377,2817.832520,2726.191406,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(1462,2778.479492,2710.401611,811.471985,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2817.832520,2726.191406,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2850.093506,2717.521484,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2850.093506,2717.521484,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19454,2860.112793,2710.039307,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2778.231689,2710.990234,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19377,2827.458496,2726.191406,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2827.458496,2726.191406,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19355,2796.151367,2722.539307,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19454,2784.478271,2716.166016,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19355,2796.151367,2722.539307,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(19447,2778.231689,2710.990234,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19447,2796.162598,2722.539307,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19377,2808.202148,2726.191406,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2808.202148,2726.191406,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2765.719482,2695.354004,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19454,2851.279785,2717.863037,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2782.962646,2715.730225,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2782.962646,2715.730225,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19447,2861.323486,2710.559814,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2861.323486,2710.559814,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19447,2786.140625,2718.702637,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19355,2792.944824,2722.539307,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19355,2792.944824,2722.539307,815.082520,0.000000,45.000000,90.000000);
CreateDynamicObject(19355,2791.422852,2721.969238,816.669983,45.000000,0.000000,180.000000);
CreateDynamicObject(19377,2856.326172,2715.778809,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2824.079834,2728.486572,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19377,2856.326172,2715.778809,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2837.085693,2726.191406,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2837.085693,2726.191406,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2764.392822,2696.846924,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2764.392822,2696.846924,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19377,2769.710205,2705.181396,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2808.765381,2728.464600,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19377,2769.710205,2705.181396,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2771.792725,2707.937012,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(635,2840.597412,2725.560547,814.495483,0.000000,-90.000000,0.000000);
CreateDynamicObject(19377,2798.572021,2726.191406,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2798.572021,2726.191406,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2830.285889,2728.487793,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19377,2779.319092,2715.697021,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2767.393066,2703.149658,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2852.960449,2719.790283,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2859.568848,2714.950928,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2859.568848,2714.950928,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(2674,2825.198486,2729.967529,811.575195,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2771.788818,2709.609619,811.462830,0.000000,90.000000,90.000000);
CreateDynamicObject(3005,2811.909180,2730.372803,811.566101,0.000000,0.000000,162.681351);
CreateDynamicObject(19454,2827.165039,2730.166992,811.467773,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2858.414551,2716.687744,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2808.710938,2730.140137,811.467773,0.000000,90.000000,90.000000);
CreateDynamicObject(1486,2809.709717,2730.406738,811.574585,90.000000,0.000000,45.000000);
CreateDynamicObject(19447,2850.091064,2722.853516,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2850.091064,2722.853516,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19454,2830.284912,2730.166992,811.477783,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2799.134521,2728.464600,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19639,2808.206787,2730.777100,811.555115,0.000000,0.000000,45.000000);
CreateDynamicObject(19639,2807.340332,2730.679443,811.719177,0.000000,180.000000,8.709500);
CreateDynamicObject(19355,2823.091309,2731.551270,816.748413,45.000000,0.000000,270.000000);
CreateDynamicObject(19447,2827.347656,2731.549072,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2827.347656,2731.549072,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19454,2765.719482,2704.987061,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19355,2810.138672,2731.718506,816.748413,45.000000,0.000000,90.000000);
CreateDynamicObject(19587,2802.212158,2730.431885,811.575684,0.000000,0.000000,70.000000);
CreateDynamicObject(19447,2796.147949,2728.470947,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19377,2846.716309,2726.277344,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(2968,2811.436768,2732.416992,811.862793,0.000000,0.000000,0.000000);
CreateDynamicObject(19355,2831.558594,2731.552734,816.748413,45.000000,0.000000,90.000000);
CreateDynamicObject(19447,2805.888672,2731.714355,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19454,2799.648682,2730.140137,811.477783,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2805.888672,2731.714355,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19447,2840.609619,2729.418213,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2840.609619,2729.418213,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19587,2802.760986,2731.270752,812.205811,0.000000,100.000000,89.363098);
CreateDynamicObject(19447,2840.609619,2729.418213,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2821.015137,2733.224609,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2819.348145,2733.227295,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2788.948975,2726.191406,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(635,2764.548340,2704.999512,814.535522,0.000000,-90.000000,180.000000);
CreateDynamicObject(19377,2788.948975,2726.191406,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(10444,2772.865723,2714.970947,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2772.865723,2714.970947,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2813.490479,2733.227295,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2811.825195,2733.198486,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2768.608887,2710.990234,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2768.608887,2710.990234,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19454,2860.112793,2719.666504,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(1440,2851.032715,2725.872314,812.053589,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2764.392822,2706.478027,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2764.392822,2706.478027,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19447,2799.105713,2731.703857,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2799.105713,2731.703857,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19454,2784.478271,2725.792725,811.462830,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2861.323486,2720.193359,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2835.024414,2733.221436,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2861.323486,2720.193359,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19447,2782.962646,2725.358154,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2782.962646,2725.358154,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(1428,2821.196289,2735.526367,811.616516,105.000000,0.000000,10.000000);
CreateDynamicObject(19454,2851.279785,2727.487793,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2858.425293,2723.168213,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19355,2794.854980,2731.708008,816.748413,45.000000,0.000000,270.000000);
CreateDynamicObject(19377,2769.710205,2715.680908,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2822.582520,2736.283691,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2822.582520,2736.283691,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19447,2786.140625,2728.328369,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2816.333008,2736.690918,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(635,2782.956543,2726.848877,814.535522,0.000000,-90.000000,180.000000);
CreateDynamicObject(19377,2816.333008,2736.690918,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2810.639160,2736.443848,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2850.093506,2729.413574,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2810.639160,2736.443848,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19447,2850.093506,2729.413574,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19377,2825.954590,2736.690918,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2784.473877,2728.318604,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(19377,2856.326172,2726.277344,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2856.326172,2726.277344,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2832.071777,2736.285400,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2808.166992,2736.691650,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2832.071777,2736.285400,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19377,2837.082031,2735.353516,810.351318,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2793.085693,2733.207031,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(19454,2833.351074,2736.727051,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2852.960449,2729.418213,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2788.166504,2731.428467,811.472778,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2765.719482,2714.610596,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2791.417480,2733.197266,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2837.069824,2736.276855,816.337097,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2791.021973,2733.223389,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19377,2865.959717,2720.895264,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(635,2782.952637,2729.615234,814.535522,0.000000,-90.000000,180.000000);
CreateDynamicObject(19377,2837.073242,2736.758789,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2837.062012,2736.739258,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(1219,2816.730713,2739.248291,811.197876,0.000000,0.000000,335.996002);
CreateDynamicObject(19355,2861.829590,2724.927734,816.748413,45.000000,0.000000,270.000000);
CreateDynamicObject(19447,2789.426758,2733.204834,815.082520,0.000000,-45.000000,90.000000);
CreateDynamicObject(19447,2789.071533,2733.062256,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(635,2789.054932,2733.224609,814.535522,0.000000,-90.000000,90.000000);
CreateDynamicObject(19377,2798.540283,2736.687744,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(930,2862.249756,2725.468262,812.024780,0.000000,0.000000,0.000000);
CreateDynamicObject(635,2850.126221,2733.357422,814.495483,0.000000,-90.000000,180.000000);
CreateDynamicObject(19447,2794.375732,2736.440430,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2794.375732,2736.440430,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(930,2863.566650,2725.724121,812.024780,0.000000,0.000000,35.000000);
CreateDynamicObject(19454,2863.174316,2726.230469,811.477783,0.000000,90.000000,90.000000);
CreateDynamicObject(930,2864.996338,2725.473633,812.024780,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2866.053467,2724.935059,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2866.053467,2724.935059,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19377,2846.716309,2736.769775,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2840.609619,2739.045654,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2840.609619,2739.045654,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19447,2840.609619,2739.045654,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2863.163574,2727.913086,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19377,2788.948975,2736.680420,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2819.348145,2742.859131,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2781.412109,2733.223389,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2813.490479,2742.860107,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2811.825195,2742.830811,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2780.959473,2733.214844,815.082520,0.000000,-45.000000,90.000000);
CreateDynamicObject(19447,2782.950928,2734.990234,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2782.962646,2734.990967,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19454,2851.279785,2737.116699,811.472778,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2835.024414,2742.851807,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(2671,2779.178467,2734.440674,811.588013,0.000000,0.000000,-101.040024);
CreateDynamicObject(10444,2816.210693,2745.302002,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2816.210693,2745.302002,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2875.569580,2720.895508,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2850.093506,2739.048096,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2850.093506,2739.048096,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19447,2822.582520,2745.912354,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2822.582520,2745.912354,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19454,2851.288818,2739.048584,811.462830,0.000000,90.000000,0.000000);
CreateDynamicObject(10444,2830.673096,2745.302002,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2830.673096,2745.302002,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2856.326172,2736.769775,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2856.326172,2736.769775,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2810.639160,2746.071289,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2810.639160,2746.071289,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(1441,2872.267090,2725.681396,812.184570,0.000000,0.000000,183.358597);
CreateDynamicObject(19447,2852.960449,2739.041016,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(3502,2820.263916,2746.735596,818.689087,90.000000,0.000000,0.000000);
CreateDynamicObject(19377,2865.946289,2731.392090,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2865.946289,2731.392090,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2832.071777,2745.914551,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2832.071777,2745.914551,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19355,2841.113525,2743.778320,816.748413,45.000000,0.000000,270.000000);
CreateDynamicObject(10444,2801.750244,2745.302002,810.840881,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2801.750244,2745.302002,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2816.333008,2747.186523,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2872.744629,2726.230469,811.467773,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2814.613037,2747.186523,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2816.324463,2747.398682,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2863.163574,2733.948486,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19377,2825.954590,2747.186523,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2833.351074,2746.350098,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(1222,2811.876465,2747.462646,811.994507,0.000000,0.000000,0.000000);
CreateDynamicObject(1437,2820.385742,2748.234619,811.874023,10.000000,0.000000,0.000000);
CreateDynamicObject(19447,2845.343750,2743.786621,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2845.343262,2743.786621,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2875.685059,2724.935059,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2845.343750,2743.786621,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19447,2875.685059,2724.935059,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19447,2872.791504,2727.913086,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19454,2818.386719,2749.069336,811.467773,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2858.434082,2738.690674,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19355,2862.104004,2736.752197,816.748413,45.000000,0.000000,270.000000);
CreateDynamicObject(19447,2848.231689,2743.783203,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(1222,2812.943359,2749.157715,811.994507,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2837.073242,2747.249512,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2837.073242,2747.249512,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(10444,2845.132813,2745.302002,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2845.132813,2745.302002,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2860.097900,2738.681885,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(19355,2849.599854,2743.769531,816.748413,45.000000,0.000000,90.000000);
CreateDynamicObject(1449,2816.565186,2749.886719,812.053223,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2817.898682,2750.172607,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2817.898682,2750.172607,815.082520,0.000000,-45.000000,90.000000);
CreateDynamicObject(19447,2815.162354,2750.167725,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2815.162354,2750.167725,815.082520,0.000000,-45.000000,90.000000);
CreateDynamicObject(10444,2874.020264,2729.360840,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(19454,2866.639160,2735.611572,811.477783,0.000000,90.000000,90.000000);
CreateDynamicObject(19627,2834.586182,2749.593994,811.585571,0.000000,0.000000,25.000000);
CreateDynamicObject(19447,2866.325684,2736.744629,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2866.325684,2736.744629,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19447,2834.489746,2750.352295,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(1431,2868.229004,2735.861084,811.562073,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2846.703613,2747.229492,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2846.703613,2747.229492,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2811.825195,2752.460449,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(19454,2877.763184,2729.066895,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(1362,2869.492188,2736.068604,812.095703,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2861.594727,2741.480225,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2861.594727,2741.480225,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19377,2875.571289,2731.392090,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2876.098145,2730.912842,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19377,2875.571289,2731.392090,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2872.791992,2733.948486,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(3502,2876.368652,2731.104248,818.580994,90.000000,0.000000,0.000000);
CreateDynamicObject(2671,2765.558594,2735.317383,811.406555,4.560000,-1.860000,0.000000);
CreateDynamicObject(19447,2828.633301,2753.221191,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2828.633301,2753.221191,815.082520,0.000000,-45.000000,90.000000);
CreateDynamicObject(19447,2835.024414,2752.483398,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2879.199951,2729.541992,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2879.199951,2729.541992,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19447,2844.111328,2750.352295,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19454,2839.901367,2752.015137,811.477783,0.000000,90.000000,90.000000);
CreateDynamicObject(635,2837.137695,2753.134766,814.495483,0.000000,-90.000000,90.000000);
CreateDynamicObject(1437,2876.963379,2733.061768,811.600525,100.000000,0.000000,9.572220);
CreateDynamicObject(10444,2859.568848,2745.302002,811.354309,0.000000,0.000000,0.000000);
CreateDynamicObject(10444,2859.568848,2745.302002,810.682678,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2838.256104,2753.221191,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2838.256104,2753.221191,815.082520,0.000000,-45.000000,90.000000);
CreateDynamicObject(19377,2856.326172,2747.249512,810.366272,0.000000,90.000000,90.000000);
CreateDynamicObject(19377,2856.326172,2747.249512,816.329102,0.000000,90.000000,90.000000);
CreateDynamicObject(19454,2860.097900,2745.449219,811.467773,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2832.071777,2755.546143,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2832.071777,2755.546143,815.082520,0.000000,45.000000,0.000000);
CreateDynamicObject(19454,2876.270020,2735.611572,811.477783,0.000000,90.000000,90.000000);
CreateDynamicObject(3643,2834.157715,2755.768799,813.572571,0.000000,0.000000,180.000000);
CreateDynamicObject(19454,2833.351074,2755.967285,811.477783,0.000000,90.000000,0.000000);
CreateDynamicObject(19447,2875.955322,2736.744629,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2875.955322,2736.744629,816.792297,180.000000,0.000000,90.000000);
CreateDynamicObject(19454,2849.523682,2752.015137,811.477783,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2853.740234,2750.352295,809.799011,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2858.433838,2748.314941,809.799011,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2847.870605,2753.221191,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2847.870605,2753.221191,815.082520,0.000000,-45.000000,90.000000);
CreateDynamicObject(914,2856.548096,2751.385498,811.565125,90.000000,0.000000,17.000000);
CreateDynamicObject(1687,2856.465088,2752.327881,814.227783,90.000000,0.000000,358.166290);
CreateDynamicObject(19454,2859.127441,2752.015137,811.477783,0.000000,90.000000,90.000000);
CreateDynamicObject(19447,2879.199951,2739.160156,813.296570,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2879.199951,2739.160156,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19447,2861.594727,2751.110352,813.282837,0.000000,0.000000,0.000000);
CreateDynamicObject(19447,2861.594727,2751.110352,815.082520,0.000000,-45.000000,0.000000);
CreateDynamicObject(19447,2857.506348,2753.221191,813.296570,0.000000,0.000000,90.000000);
CreateDynamicObject(19447,2857.506348,2753.221191,815.082520,0.000000,-45.000000,90.000000);
CreateDynamicObject(2649,2859.561523,2752.654785,814.284729,90.000000,0.000000,0.000000);
CreateDynamicObject(1546,2841.294922,2694.922363,812.944153,0.000000,360.000000,300.000000);
CreateDynamicObject(2034,2868.637207,2735.822510,812.109680,0.000000,360.000000,300.000000);
CreateDynamicObject(19564,2834.005371,2749.545166,811.564819,0.000000,360.000000,300.000000);
CreateDynamicObject(2060,2789.031250,2670.743652,811.559753,0.000000,360.000000,300.000000);
CreateDynamicObject(12986,782.867126,1074.871338,30.929100,0.000000,0.000000,90.000000);
CreateDynamicObject(1327,775.552124,1076.959106,29.476801,0.000000,90.000000,0.000000);
CreateDynamicObject(1358,772.143188,1080.709351,30.679100,0.000000,0.000000,-96.180008);
CreateDynamicObject(1327,792.784241,1070.953491,29.476801,0.000000,90.000000,0.000000);
CreateDynamicObject(734,775.531921,1068.301270,29.329599,0.000000,0.000000,-28.020000);
CreateDynamicObject(874,797.476807,1084.455322,29.449310,0.000000,0.000000,0.000000);
CreateDynamicObject(1327,774.556641,1068.895874,29.996799,0.000000,30.000000,-48.419998);
CreateDynamicObject(751,790.824951,1066.754395,29.460630,0.000000,0.000000,0.000000);
CreateDynamicObject(18451,731.619629,1107.179810,27.883600,0.000000,0.000000,51.900002);
CreateDynamicObject(874,725.017517,1100.748901,27.202000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,878.220886,1048.637329,18.331600,0.000000,0.000000,0.000000);
CreateDynamicObject(874,829.275146,1169.838745,26.727980,0.000000,0.000000,0.000000);
CreateDynamicObject(734,855.463074,1177.245850,29.712099,0.000000,0.000000,-1.980000);
CreateDynamicObject(874,650.519409,1085.638428,27.325340,0.000000,0.000000,-102.659981);
CreateDynamicObject(1308,645.674927,1073.882568,27.368099,358.178589,90.000000,-216.070709);
CreateDynamicObject(734,682.395203,1172.652222,11.710600,0.000000,0.000000,-37.320000);
CreateDynamicObject(734,769.817322,1223.155762,19.356501,0.000000,0.000000,-50.520000);
CreateDynamicObject(734,924.112000,1027.809814,10.764600,0.000000,0.000000,-186.119995);
CreateDynamicObject(3593,906.030701,990.607300,10.321100,0.000000,0.000000,-43.200001);
CreateDynamicObject(734,815.277893,931.225708,12.202500,0.000000,0.000000,-198.120026);
CreateDynamicObject(1327,818.710388,1253.166626,25.122900,0.000000,90.000000,0.000000);
CreateDynamicObject(874,578.266724,1069.357788,26.794201,0.000000,0.000000,0.000000);
CreateDynamicObject(874,911.464355,917.763550,12.338070,0.000000,0.000000,0.000000);
CreateDynamicObject(734,833.865906,1282.521362,26.117800,0.000000,0.000000,0.000000);
CreateDynamicObject(874,637.948608,945.910583,-36.916901,0.000000,0.000000,-138.660004);
CreateDynamicObject(18247,675.229980,914.150024,-36.480000,0.000000,0.000000,229.699997);
CreateDynamicObject(3594,628.892029,945.551697,-36.268700,-6.000000,9.300000,-130.860001);
CreateDynamicObject(16302,643.070007,924.979980,-39.189999,0.000000,0.000000,120.190002);
CreateDynamicObject(16083,649.545593,916.057800,-39.748100,371.018188,-10.800000,-136.118393);
CreateDynamicObject(1327,665.875427,895.792114,-40.645401,0.000000,20.000000,-20.100000);
CreateDynamicObject(896,671.094727,892.796570,-43.401371,9.600010,-35.160000,-30.719999);
CreateDynamicObject(874,854.334717,861.128723,12.146300,0.000000,0.000000,0.000000);
CreateDynamicObject(734,982.862793,964.557678,9.594500,0.000000,0.000000,63.720001);
CreateDynamicObject(1431,659.619019,897.313477,-41.203701,8.520000,-5.700000,-59.759991);
CreateDynamicObject(1449,665.119568,891.969971,-40.897099,0.000000,0.000000,-78.360001);
CreateDynamicObject(1440,654.649475,898.155273,-41.757500,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,549.561707,1057.881226,27.913099,0.000000,0.000000,0.000000);
CreateDynamicObject(735,560.956970,1156.889038,10.699700,0.000000,0.000000,-46.799999);
CreateDynamicObject(1369,664.329407,888.941895,-40.898300,0.320000,90.099998,-68.339996);
CreateDynamicObject(1462,665.922485,887.791687,-41.369202,0.000000,0.000000,-82.199997);
CreateDynamicObject(879,651.452576,897.430603,-41.615040,0.000000,0.000000,-85.620003);
CreateDynamicObject(760,649.116699,895.893921,-43.057301,0.000000,0.000000,-71.339996);
CreateDynamicObject(13591,852.360901,848.455017,12.629800,0.000000,0.000000,-68.699997);
CreateDynamicObject(874,782.843445,1323.793213,23.472750,0.000000,0.000000,0.000000);
CreateDynamicObject(765,665.623291,872.445190,-42.472500,0.000000,0.000000,-24.299999);
CreateDynamicObject(944,631.270020,890.130005,-43.090000,0.000000,0.000000,0.000000);
CreateDynamicObject(16071,674.789978,854.520020,-39.369999,356.859985,0.000000,-3.140000);
CreateDynamicObject(929,625.109985,878.179993,-43.009998,0.000000,0.000000,0.350000);
CreateDynamicObject(19458,624.450012,878.710022,-44.200001,90.000000,0.000000,0.000000);
CreateDynamicObject(19458,619.700012,880.380005,-41.139999,0.000000,0.000000,90.000000);
CreateDynamicObject(19458,624.460022,877.599976,-44.200001,90.000000,0.000000,0.000000);
CreateDynamicObject(18755,622.320007,878.179993,-42.009998,0.000000,0.000000,0.000000);
CreateDynamicObject(19439,620.390015,878.750000,-40.200001,90.000000,90.000000,90.000000);
CreateDynamicObject(19458,619.719971,878.750000,-39.459999,0.000000,90.000000,90.000000);
CreateDynamicObject(19458,619.700012,880.380005,-44.610001,0.000000,0.000000,90.000000);
CreateDynamicObject(944,617.739990,881.429993,-43.290001,0.000000,0.000000,359.410004);
CreateDynamicObject(18638,616.719971,881.760010,-42.669998,0.000000,-90.000000,49.450001);
CreateDynamicObject(19439,620.400024,877.750000,-40.200001,90.000000,90.000000,90.000000);
CreateDynamicObject(19458,619.700012,877.590027,-39.450001,0.000000,90.000000,90.000000);
CreateDynamicObject(734,521.139282,1016.814575,26.548401,0.000000,0.000000,-147.479996);
CreateDynamicObject(19439,614.979980,881.210022,-39.680000,0.000000,0.000000,0.000000);
CreateDynamicObject(918,623.820007,875.090027,-43.610001,0.000000,0.000000,0.000000);
CreateDynamicObject(918,615.770020,881.570007,-43.610001,0.000000,0.000000,157.089996);
CreateDynamicObject(19439,614.979980,881.210022,-43.169998,0.000000,0.000000,0.000000);
CreateDynamicObject(19458,619.719971,875.929993,-41.139999,0.000000,0.000000,90.000000);
CreateDynamicObject(19439,615.010010,878.760010,-38.730000,90.000000,90.000000,89.389999);
CreateDynamicObject(944,621.609985,874.820007,-43.090000,0.000000,0.000000,1.610000);
CreateDynamicObject(19458,619.719971,875.929993,-44.610001,0.000000,0.000000,90.000000);
CreateDynamicObject(19439,615.020020,877.580017,-38.730000,90.000000,90.000000,89.389999);
CreateDynamicObject(18248,628.450012,866.150024,-36.000000,0.000000,0.000000,334.649994);
CreateDynamicObject(944,618.159973,874.739990,-43.090000,0.000000,0.000000,1.610000);
CreateDynamicObject(18638,617.250000,874.739990,-42.470001,0.000000,-90.000000,157.399994);
CreateDynamicObject(19439,615.030029,875.200012,-39.669998,0.000000,0.000000,0.000000);
CreateDynamicObject(918,616.000000,874.849976,-43.610001,0.000000,0.000000,0.000000);
CreateDynamicObject(19439,615.030029,875.200012,-43.169998,0.000000,0.000000,0.000000);
CreateDynamicObject(918,614.409973,875.549988,-43.610001,0.000000,0.000000,157.089996);
CreateDynamicObject(1358,610.672729,878.017273,-42.766701,0.000000,0.000000,42.360001);
CreateDynamicObject(918,614.570007,874.780029,-43.610001,0.000000,0.000000,0.000000);
CreateDynamicObject(16304,622.080017,855.820007,-39.230000,0.000000,0.000000,158.520004);
CreateDynamicObject(639,578.501770,876.520813,-40.949402,-6.620000,1.780000,-0.420000);
CreateDynamicObject(874,568.055969,881.579590,-44.757401,3.960000,-4.680000,-7.740000);
CreateDynamicObject(734,2676.101807,2158.329346,8.853400,0.000000,0.000000,-97.500000);
CreateDynamicObject(3594,2613.775879,2093.134033,10.354700,0.000000,0.000000,-51.720001);
CreateDynamicObject(3594,2644.454590,2148.583496,10.059200,0.000000,0.000000,-69.779999);
CreateDynamicObject(3594,2581.279053,2057.652100,10.252700,0.000000,0.000000,71.519997);
CreateDynamicObject(874,2616.434326,2118.510010,9.657560,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2671.223145,2178.612549,8.107580,0.000000,0.000000,0.120000);
CreateDynamicObject(3459,2553.789307,1955.113647,9.840300,90.838402,90.000000,-43.930801);
CreateDynamicObject(3593,2572.121094,2054.188232,10.156000,0.000000,0.000000,-117.180000);
CreateDynamicObject(3594,2567.206787,2056.399170,10.252700,0.000000,0.000000,-13.139990);
CreateDynamicObject(1450,2564.616455,2055.333496,10.398100,0.000000,0.000000,-101.220001);
CreateDynamicObject(1462,2564.590576,2065.227539,10.096200,0.000000,0.000000,-1.980000);
CreateDynamicObject(874,2555.578125,2049.442627,9.661040,0.000000,0.000000,89.939987);
CreateDynamicObject(3593,2577.122070,2114.678467,10.045600,0.060000,0.000000,-70.199997);
CreateDynamicObject(1257,2577.865479,2124.346436,10.733800,0.000000,90.000000,122.470802);
CreateDynamicObject(3594,2571.834717,2112.583740,10.175500,0.000000,0.000000,-132.900024);
CreateDynamicObject(874,2577.643555,2125.584229,9.819880,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2565.339111,2111.839844,10.175500,0.000000,0.000000,-54.660000);
CreateDynamicObject(1431,2548.764160,2065.247803,10.613800,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,2576.328125,2144.204102,10.197900,0.000000,0.000000,-45.840000);
CreateDynamicObject(1440,2565.993408,2128.835205,10.862600,0.000000,0.000000,40.860001);
CreateDynamicObject(874,2721.952881,2292.017822,13.416200,0.000000,0.000000,62.279999);
CreateDynamicObject(1438,2560.062988,2128.499512,9.798500,0.000000,0.000000,12.840000);
CreateDynamicObject(1462,2559.283936,2127.014160,9.821190,0.000000,0.000000,-180.000015);
CreateDynamicObject(1327,2550.159668,2105.818115,9.780000,0.000000,90.000000,0.000000);
CreateDynamicObject(3866,2558.874756,2139.806152,10.160000,0.000000,0.000000,-269.700195);
CreateDynamicObject(874,2634.903076,2259.127686,9.660650,0.000000,0.000000,0.000000);
CreateDynamicObject(1327,2548.153564,2104.030762,9.780000,0.000000,90.000000,0.000000);
CreateDynamicObject(850,2557.992188,2140.543945,9.876000,0.000000,0.000000,0.000000);
CreateDynamicObject(1230,2567.267822,2170.347900,10.178300,0.000000,0.000000,-100.500000);
CreateDynamicObject(960,2566.535400,2172.105225,10.138100,0.000000,0.000000,24.600000);
CreateDynamicObject(3594,2830.189453,2353.461426,10.233800,0.000000,0.000000,99.840027);
CreateDynamicObject(850,2555.251465,2145.261230,9.876000,0.000000,0.000000,-71.339989);
CreateDynamicObject(1327,2547.380859,2115.521973,9.780000,0.000000,90.000000,0.000000);
CreateDynamicObject(1230,2564.528809,2172.545166,10.198300,0.000000,0.000000,-38.099998);
CreateDynamicObject(1450,2549.790527,2127.491455,10.412600,0.000000,0.000000,137.280106);
CreateDynamicObject(874,2561.837891,2166.284424,9.815590,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2829.057373,2357.853760,9.818420,0.000000,0.000000,0.000000);
CreateDynamicObject(3866,2558.314453,2160.568604,13.300000,0.000000,0.000000,-449.100311);
CreateDynamicObject(3594,2830.665283,2360.702881,10.233800,0.000000,0.000000,52.380001);
CreateDynamicObject(874,2550.383057,2142.128906,9.815720,0.000000,0.000000,0.000000);
CreateDynamicObject(734,2821.195068,2368.725830,9.890200,0.000000,0.000000,-242.100006);
CreateDynamicObject(734,2663.229736,2312.219727,9.707100,0.000000,0.000000,-10.380000);
CreateDynamicObject(749,2693.424805,2332.550049,6.786600,0.000000,90.000000,0.000000);
CreateDynamicObject(749,2692.790039,2332.314453,5.986600,0.000000,0.000000,0.000000);
CreateDynamicObject(868,2692.937256,2334.573242,6.511700,0.000000,0.000000,37.860001);
CreateDynamicObject(874,2690.228516,2334.791016,6.267580,0.000000,0.000000,5.340000);
CreateDynamicObject(1441,2553.801025,2169.858398,10.499000,0.000000,0.000000,-86.760040);
CreateDynamicObject(874,2779.483154,2374.488770,9.722470,0.000000,0.000000,-29.100000);
CreateDynamicObject(3594,2773.010986,2373.307617,10.306900,0.020000,0.000000,107.040001);
CreateDynamicObject(3594,2778.734131,2374.663086,10.286900,0.000000,0.000000,46.020000);
CreateDynamicObject(874,2775.364502,2380.716553,9.727250,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2870.841309,2389.135254,10.206500,0.000000,0.000000,-234.359970);
CreateDynamicObject(874,2837.455566,2390.984131,9.813200,0.000000,0.000000,0.000000);
CreateDynamicObject(1328,2803.703369,2389.993164,10.091900,0.000000,90.000000,29.280001);
CreateDynamicObject(2672,2804.799805,2390.547852,10.117600,0.000000,0.000000,24.660000);
CreateDynamicObject(1225,2870.608154,2391.979980,10.216700,0.000000,90.000000,-109.200020);
CreateDynamicObject(1327,2797.113281,2390.700684,9.732500,0.000000,90.000000,0.000000);
CreateDynamicObject(1327,2796.265869,2391.128662,10.352500,0.000000,90.000000,0.000000);
CreateDynamicObject(1327,2795.488525,2391.712402,9.732500,0.000000,90.000000,0.000000);
CreateDynamicObject(874,2866.460205,2396.369629,9.801690,0.000000,0.000000,0.000000);
CreateDynamicObject(3459,2573.204346,2233.127197,9.820300,90.858398,90.000000,50.929199);
CreateDynamicObject(874,2794.031494,2395.255127,9.614900,0.000000,0.000000,124.500000);
CreateDynamicObject(3593,2869.291748,2397.830811,10.194200,0.000000,0.000000,61.020000);
CreateDynamicObject(874,2868.928467,2399.297363,9.816940,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2864.111572,2399.866699,10.206500,0.000000,0.000000,-4.500000);
CreateDynamicObject(926,2790.943604,2396.812744,10.077100,0.000000,0.000000,-9.660000);
CreateDynamicObject(1299,2789.237549,2396.614990,10.236700,0.000000,0.000000,54.119999);
CreateDynamicObject(1225,2873.690186,2399.329834,10.216700,0.000000,90.000000,-39.600010);
CreateDynamicObject(874,2627.219971,2312.518311,9.659870,0.000000,0.000000,0.000000);
CreateDynamicObject(1327,2802.743408,2399.829834,9.732500,0.000000,90.000000,0.000000);
CreateDynamicObject(3460,2903.926758,2395.814453,9.980000,0.000000,90.000000,-34.210800);
CreateDynamicObject(1257,2915.050293,2393.492676,10.733700,0.000000,90.000000,26.639999);
CreateDynamicObject(926,2789.978760,2399.038330,10.077100,0.000000,0.000000,25.500000);
CreateDynamicObject(850,2544.691895,2152.845947,9.876000,0.000000,0.000000,-38.819889);
CreateDynamicObject(1327,2794.945801,2401.493652,9.732500,0.000000,90.000000,0.000000);
CreateDynamicObject(3593,2871.526123,2402.974609,10.194200,0.000000,0.000000,171.179977);
CreateDynamicObject(3594,2541.646484,2163.125732,10.238300,0.000000,0.000000,43.080002);
CreateDynamicObject(3593,2536.407471,2091.044189,10.217600,0.000000,0.000000,71.220001);
CreateDynamicObject(1438,2536.553467,2086.331543,9.797800,0.000000,0.000000,35.700001);
CreateDynamicObject(1280,2538.524902,2147.823975,10.058800,0.000000,80.000000,26.421600);
CreateDynamicObject(1224,2535.445068,2079.143555,10.288100,0.000000,0.000000,-14.040000);
CreateDynamicObject(874,2534.050049,2114.783691,9.720440,0.000000,0.000000,43.200001);
CreateDynamicObject(3459,2531.589355,2104.026367,9.900000,90.000000,90.000000,128.050797);
CreateDynamicObject(3593,2527.119873,2131.656006,10.026200,0.000000,0.000000,-117.180000);
CreateDynamicObject(874,2525.340576,2094.361572,9.663420,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2527.496094,2153.725586,9.666680,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2526.478271,2078.869141,10.038700,0.000000,0.000000,142.139999);
CreateDynamicObject(874,2915.258301,2398.071777,9.814450,0.000000,0.000000,0.000000);
CreateDynamicObject(3459,2528.376953,2222.585693,9.820300,90.858398,90.000000,-130.750793);
CreateDynamicObject(3593,2506.996094,2050.758545,10.309300,0.000000,0.000000,38.279999);
CreateDynamicObject(734,2745.182617,2407.597656,9.629200,0.000000,0.000000,53.700001);
CreateDynamicObject(1440,2757.543213,2433.002930,10.167300,0.000000,0.000000,-68.400002);
CreateDynamicObject(1327,2755.861816,2434.287842,9.647800,0.000000,90.000000,0.000000);
CreateDynamicObject(874,2484.122314,2130.951904,9.654980,0.000000,0.000000,-132.840012);
CreateDynamicObject(874,2694.500244,2430.017578,5.561900,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2905.654785,2418.710449,9.809900,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2528.566650,2317.545654,9.661840,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2508.068115,2014.229980,9.401100,0.000000,0.000000,23.520000);
CreateDynamicObject(874,2464.673096,2238.134521,9.656700,0.000000,0.000000,-40.320000);
CreateDynamicObject(3459,2465.214844,2050.428955,9.780300,90.858398,90.000000,-247.270798);
CreateDynamicObject(874,2410.333984,2148.476318,9.660280,0.000000,0.000000,-66.540009);
CreateDynamicObject(874,2419.848389,2047.599243,9.843040,0.000000,0.000000,-42.000000);
CreateDynamicObject(874,2422.328369,2289.543213,9.654900,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2508.864990,1904.274658,9.659380,0.000000,0.000000,-16.680000);
CreateDynamicObject(734,2450.542725,1953.426025,9.529700,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2350.488281,2086.923828,9.654480,0.000000,0.000000,-64.980003);
CreateDynamicObject(3459,2345.386230,2139.568604,9.825100,90.000000,90.000000,-38.099991);
CreateDynamicObject(3459,2427.330322,2342.761475,9.820300,90.141602,90.000000,-31.838400);
CreateDynamicObject(734,2435.700195,1903.932373,4.882400,0.000000,0.000000,-152.399994);
CreateDynamicObject(874,2349.095459,2225.073730,9.656600,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2342.146240,2024.514648,9.780550,0.000000,0.000000,-44.040001);
CreateDynamicObject(19821,2611.266357,2093.836670,10.038700,0.000000,360.000000,300.000000);
CreateDynamicObject(11748,2598.139893,2096.149902,10.040000,0.000000,360.000000,300.000000);
CreateDynamicObject(11736,2577.503174,2114.560059,10.024200,0.000000,360.000000,300.000000);
CreateDynamicObject(874,2299.474365,2141.047119,9.659980,0.000000,0.000000,0.000000);
CreateDynamicObject(19576,2572.024902,2115.527588,10.024200,0.000000,360.000000,300.000000);
CreateDynamicObject(734,2325.772461,2255.765381,9.703700,0.000000,0.000000,-26.760000);
CreateDynamicObject(626,2283.811279,2155.689941,10.787200,356.878387,60.000000,2.001600);
CreateDynamicObject(1951,2558.025146,2128.057129,10.060300,0.000000,360.000000,300.000000);
CreateDynamicObject(3594,2344.909668,1903.967041,10.243600,0.000000,0.000000,-43.560001);
CreateDynamicObject(19570,2551.020996,2127.278809,10.040100,0.000000,360.000000,300.000000);
CreateDynamicObject(19570,2536.406982,2090.628662,10.146300,0.000000,360.000000,300.000000);
CreateDynamicObject(18046,2180.330078,944.820007,998.659973,0.000000,0.000000,0.000000);
CreateDynamicObject(2042,2178.840088,943.130005,998.739990,0.000000,0.000000,0.000000);
CreateDynamicObject(2040,2178.979980,942.799988,998.760010,0.000000,0.000000,70.000000);
CreateDynamicObject(1509,2177.870117,946.849976,998.719971,0.000000,90.000000,18.000000);
CreateDynamicObject(2042,2182.870117,947.650024,998.739990,0.000000,0.000000,0.000000);
CreateDynamicObject(914,2177.209961,944.969971,998.640015,90.000000,90.000000,40.000000);
CreateDynamicObject(1509,2182.159912,941.520020,998.719971,0.000000,90.000000,-108.000000);
CreateDynamicObject(3014,2180.479980,941.030029,998.849976,0.000000,0.000000,-20.000000);
CreateDynamicObject(18101,2182.649902,941.489990,998.659973,0.000000,0.000000,0.000000);
CreateDynamicObject(1509,2177.149902,942.760010,998.719971,0.000000,90.000000,108.000000);
CreateDynamicObject(3014,2176.669922,942.679993,998.849976,0.000000,0.000000,90.000000);
CreateDynamicObject(2908,2184.229980,947.880005,998.729980,0.000000,0.000000,45.000000);
CreateDynamicObject(19639,2184.229980,947.880005,998.669983,0.000000,0.000000,-15.000000);
CreateDynamicObject(3014,2181.729980,940.049988,998.849976,0.000000,0.000000,60.000000);
CreateDynamicObject(2042,2183.790039,948.669983,998.739990,0.000000,0.000000,45.000000);
CreateDynamicObject(19639,2175.989990,946.190002,998.669983,0.000000,0.000000,-15.000000);
CreateDynamicObject(3014,2175.889893,943.059998,998.849976,0.000000,0.000000,45.000000);
CreateDynamicObject(19622,2186.080078,944.599976,998.679993,90.000000,90.000000,19.000000);
CreateDynamicObject(18047,2178.199951,949.690002,999.229980,0.000000,0.000000,0.000000);
CreateDynamicObject(1886,2185.699951,947.169983,998.809998,0.000000,90.000000,325.959991);
CreateDynamicObject(19639,2185.169922,948.739990,998.669983,0.000000,0.000000,45.000000);
CreateDynamicObject(2038,2177.139893,949.669983,1000.059998,0.000000,360.000000,300.000000);
CreateDynamicObject(1533,2184.570068,940.219971,998.659973,0.000000,0.000000,0.000000);
CreateDynamicObject(2359,2174.750000,947.119995,999.840027,0.000000,0.000000,78.000000);
CreateDynamicObject(2038,2186.500000,948.179993,1000.059998,0.000000,360.000000,300.000000);
CreateDynamicObject(1450,2172.780029,945.169983,999.250000,0.000000,0.000000,90.000000);
CreateDynamicObject(19639,2173.439941,940.440002,998.669983,0.000000,0.000000,-55.000000);
CreateDynamicObject(735,2303.257813,2283.843018,8.933500,0.000000,0.000000,-103.320000);
CreateDynamicObject(849,2399.566895,2368.273682,10.094000,0.000000,0.000000,30.059999);
CreateDynamicObject(926,2400.685059,2370.336914,10.077700,0.000000,0.000000,28.139999);
CreateDynamicObject(926,2400.696533,2371.525635,10.077700,0.000000,0.000000,-26.700001);
CreateDynamicObject(3594,2247.903564,2022.571167,10.260400,0.000000,0.000000,-29.879999);
CreateDynamicObject(2060,2526.299316,2075.828125,9.888600,0.000000,360.000000,300.000000);
CreateDynamicObject(734,2491.664063,1789.883789,9.666800,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2298.931641,1895.453491,9.317200,0.000000,0.000000,0.000000);
CreateDynamicObject(19562,2550.436768,2065.140137,10.337700,0.000000,360.000000,300.000000);
CreateDynamicObject(1280,2225.410645,2148.988281,10.058800,356.858398,90.000000,-121.750801);
CreateDynamicObject(874,2213.566406,2142.109375,9.655060,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2287.415771,2281.299561,9.659900,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2423.714111,1753.082642,9.662520,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2328.228516,1769.842896,9.662200,0.000000,0.000000,-79.919998);
CreateDynamicObject(734,2137.326416,2061.193115,9.646900,0.000000,0.000000,94.860001);
CreateDynamicObject(734,2137.629639,1957.192017,9.646200,0.000000,0.000000,55.860001);
CreateDynamicObject(874,2123.497803,2019.535400,9.360100,0.000000,0.000000,-49.500000);
CreateDynamicObject(735,2305.282959,2324.237549,9.051300,0.000000,0.000000,-54.480000);
CreateDynamicObject(1410,2125.685303,2110.878174,9.761300,90.000000,0.000000,-38.939999);
CreateDynamicObject(18451,2147.575928,1905.621948,10.204400,0.000000,0.000000,-21.240000);
CreateDynamicObject(3460,2215.560547,2283.615479,10.005600,3.041600,90.000000,37.581600);
CreateDynamicObject(874,2126.821289,2180.051758,9.659120,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2172.231201,2290.784180,9.664890,0.000000,0.000000,0.000000);
CreateDynamicObject(928,2399.334717,2371.496094,10.100500,0.000000,0.000000,-120.779999);
CreateDynamicObject(1327,2186.978760,2318.198486,9.665600,0.000000,90.000000,0.000000);
CreateDynamicObject(874,2397.115234,2375.231445,9.820350,0.000000,0.000000,1.380000);
CreateDynamicObject(1230,2374.728271,2377.237061,10.935500,0.000000,0.000000,0.000000);
CreateDynamicObject(3866,2388.838623,2376.874512,17.480000,0.000000,0.000000,178.860001);
CreateDynamicObject(1410,2270.840820,2364.694336,9.803100,90.000000,0.000000,-40.500000);
CreateDynamicObject(3593,2375.974854,2379.208252,10.176800,0.000000,0.000000,-36.660000);
CreateDynamicObject(923,2400.656006,2378.351074,10.700500,0.000000,0.000000,-41.400002);
CreateDynamicObject(874,2287.690674,2371.714844,9.709600,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2375.798828,2384.608643,9.817230,0.000000,0.000000,0.000000);
CreateDynamicObject(735,2304.683594,2379.669678,8.874700,0.000000,0.000000,67.680000);
CreateDynamicObject(3594,2369.604492,2386.013672,10.278200,0.000000,0.000000,29.820000);
CreateDynamicObject(2674,2398.444092,2384.685303,9.839800,0.000000,0.000000,-47.400009);
CreateDynamicObject(2674,2394.706787,2385.714600,9.839800,0.000000,0.000000,-95.040001);
CreateDynamicObject(960,2400.317383,2385.185303,10.139100,0.000000,0.000000,-31.500000);
CreateDynamicObject(1462,2392.926514,2386.621338,9.820090,0.000000,0.000000,-1.260000);
CreateDynamicObject(1450,2397.441406,2386.375244,10.420000,0.000000,0.000000,1.080000);
CreateDynamicObject(852,2392.020752,2388.950684,9.779200,0.000000,0.000000,0.000000);
CreateDynamicObject(1327,2396.435059,2388.890381,9.798800,0.000000,90.000000,0.000000);
CreateDynamicObject(874,2393.479980,2389.768066,9.819350,0.000000,0.000000,66.900002);
CreateDynamicObject(734,2330.525391,2393.004150,9.633200,0.000000,0.000000,0.000000);
CreateDynamicObject(3577,2267.453369,2381.225586,10.556200,0.000000,0.000000,-44.279999);
CreateDynamicObject(3887,2263.660400,2386.564697,10.840000,0.000000,0.000000,-272.580292);
CreateDynamicObject(1431,2253.056152,2382.568359,10.359500,0.000000,0.000000,-111.360046);
CreateDynamicObject(874,2257.361816,2385.200195,9.819070,0.000000,0.000000,0.000000);
CreateDynamicObject(1440,2247.989746,2381.929688,10.293900,0.000000,0.000000,37.560001);
CreateDynamicObject(2359,2254.446777,2384.722168,10.019600,0.000000,0.000000,-28.379999);
CreateDynamicObject(1431,2252.385742,2385.084229,10.359500,0.000000,0.000000,-45.660000);
CreateDynamicObject(874,2223.659180,2372.060303,9.371600,0.000000,0.000000,-27.540001);
CreateDynamicObject(1340,2298.941895,2404.436279,10.299400,0.858400,90.000000,-267.070587);
CreateDynamicObject(3593,2274.052979,2399.775391,10.172100,0.000000,0.000000,-37.319988);
CreateDynamicObject(3460,2336.721680,2413.180664,9.820000,0.000000,90.000000,-145.679993);
CreateDynamicObject(3594,2249.148926,2393.965088,10.377700,0.000000,0.000000,200.699997);
CreateDynamicObject(874,2110.668457,2277.094482,9.511000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2314.054932,2415.328613,9.659120,0.000000,0.000000,23.580000);
CreateDynamicObject(874,2422.061035,2417.348633,9.793760,0.000000,0.000000,0.000000);
CreateDynamicObject(1257,2387.851807,2421.920654,10.773800,0.000000,90.000000,54.610802);
CreateDynamicObject(735,2143.663574,2323.868652,9.805700,0.000000,0.000000,70.680000);
CreateDynamicObject(3594,2351.079102,2423.131348,10.058900,0.000000,0.000000,-114.300003);
CreateDynamicObject(1438,2383.928955,2423.216797,9.816200,0.000000,0.000000,61.139999);
CreateDynamicObject(3594,2247.335205,2400.122314,10.377700,0.000000,0.000000,126.000000);
CreateDynamicObject(874,2347.472412,2426.144775,9.020000,10.000000,0.000000,-205.199997);
CreateDynamicObject(734,2326.802979,2427.515625,10.193200,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2245.054688,2404.336914,9.814250,0.000000,0.000000,0.000000);
CreateDynamicObject(1327,2303.033936,2426.262451,9.778900,0.000000,90.000000,0.000000);
CreateDynamicObject(3459,2253.016357,2411.644043,9.820300,90.141602,90.000000,59.721600);
CreateDynamicObject(734,2331.069336,2433.463379,11.665000,0.000000,0.000000,48.900002);
CreateDynamicObject(874,2283.149902,2425.549072,9.815650,0.000000,0.000000,58.259998);
CreateDynamicObject(1440,2312.440186,2432.626953,2.750000,0.000000,0.000000,-58.320011);
CreateDynamicObject(734,2317.275146,2434.273193,11.665000,0.000000,0.000000,-185.040054);
CreateDynamicObject(1327,2296.961426,2430.216064,9.778900,0.000000,90.000000,0.000000);
CreateDynamicObject(1438,2310.651367,2433.741211,2.270960,0.000000,0.000000,35.400002);
CreateDynamicObject(639,2294.937012,2430.917236,15.010000,0.000000,0.000000,-270.360077);
CreateDynamicObject(1327,2299.174561,2432.580078,10.517900,0.000000,20.000000,87.540024);
CreateDynamicObject(639,2290.379395,2430.878418,15.010000,0.000000,0.000000,-269.880096);
CreateDynamicObject(1440,2281.861816,2431.568848,10.329400,0.000000,0.000000,0.000000);
CreateDynamicObject(3460,2310.372559,2442.196045,9.940000,0.000000,90.000000,-57.900002);
CreateDynamicObject(874,2368.838623,2451.588867,9.662730,0.000000,0.000000,-16.620001);
CreateDynamicObject(874,2306.760254,2445.926025,2.270610,0.000000,0.000000,0.000000);
CreateDynamicObject(1450,2349.804199,2451.542969,14.546300,0.000000,0.000000,-124.860001);
CreateDynamicObject(1462,2302.195801,2450.756836,9.801260,0.000000,0.000000,88.499977);
CreateDynamicObject(1357,2348.926514,2457.390381,14.224100,0.000000,0.000000,-36.419998);
CreateDynamicObject(1438,2318.470947,2454.844238,9.814700,0.000000,0.000000,-50.819939);
CreateDynamicObject(1357,2347.723633,2458.188232,14.224100,0.000000,0.000000,-103.860001);
CreateDynamicObject(874,2345.261963,2458.167725,13.726400,0.000000,0.000000,9.240000);
CreateDynamicObject(1462,2301.796631,2452.552002,9.801260,0.000000,0.000000,153.899933);
CreateDynamicObject(874,2133.639160,2349.294434,9.663020,0.000000,0.000000,-70.559998);
CreateDynamicObject(1438,2320.140869,2457.164795,9.814700,0.000000,0.000000,-56.459999);
CreateDynamicObject(1438,2317.831055,2457.848877,9.814700,0.000000,0.000000,-139.379944);
CreateDynamicObject(874,2314.123291,2457.324707,9.816370,0.000000,0.000000,19.139999);
CreateDynamicObject(850,2314.100586,2458.879883,9.912400,0.000000,0.000000,-49.860001);
CreateDynamicObject(850,2310.969482,2459.391602,9.912400,0.000000,0.000000,-163.139969);
CreateDynamicObject(7092,2213.571777,2430.562256,10.920000,265.000000,50.000000,110.639999);
CreateDynamicObject(928,2258.086426,2454.243408,2.810000,0.000000,0.000000,37.560001);
CreateDynamicObject(928,2257.867920,2455.134766,2.810000,0.000000,0.000000,-10.860000);
CreateDynamicObject(1449,2259.695801,2459.707764,3.028300,0.000000,0.000000,-89.580002);
CreateDynamicObject(2037,2189.261475,2415.149902,72.621201,0.000000,0.000000,237.674667);
CreateDynamicObject(1431,2189.367188,2415.534424,72.029999,0.000000,0.000000,-90.000000);
CreateDynamicObject(2036,2189.541748,2415.800781,72.138298,0.000000,90.000000,-90.000000);
CreateDynamicObject(2036,2189.484131,2415.794922,72.726303,90.000000,0.000000,0.000000);
CreateDynamicObject(1449,2259.690430,2462.208984,3.028300,0.000000,0.000000,-88.680008);
CreateDynamicObject(2670,2186.298340,2414.078125,72.116600,0.000000,0.000000,0.000000);
CreateDynamicObject(1431,2189.392334,2417.587158,72.029999,0.000000,0.000000,90.000000);
CreateDynamicObject(1810,2186.129150,2415.112793,72.031799,0.000000,0.000000,131.086502);
CreateDynamicObject(2359,2185.149658,2414.463135,72.241997,0.000000,0.000000,180.000000);
CreateDynamicObject(1362,2149.582764,2390.952637,23.168600,0.000000,0.000000,0.000000);
CreateDynamicObject(2673,2150.441650,2392.462402,22.686199,0.000000,0.000000,0.000000);
CreateDynamicObject(2358,2187.852539,2418.724365,72.157997,0.000000,0.000000,0.000000);
CreateDynamicObject(1810,2150.659912,2393.837402,22.673201,0.000000,0.000000,12.388800);
CreateDynamicObject(2358,2186.972900,2418.729980,72.157997,0.000000,0.000000,180.000000);
CreateDynamicObject(1517,2150.075928,2393.824951,22.758101,0.000000,90.000000,42.161259);
CreateDynamicObject(1647,2149.077881,2393.275146,22.623739,0.000000,0.000000,332.810333);
CreateDynamicObject(19589,2148.587158,2394.030029,23.829599,90.000000,0.000000,45.370201);
CreateDynamicObject(2049,2173.838623,2415.234131,65.563004,0.000000,0.000000,-90.000000);
CreateDynamicObject(2058,2173.879639,2416.589355,65.709999,0.000000,90.000000,180.000000);
CreateDynamicObject(1462,2318.987549,2490.525391,2.270900,0.000000,0.000000,-89.519997);
CreateDynamicObject(2049,2173.838623,2418.294922,65.563004,0.000000,0.000000,-90.000000);
CreateDynamicObject(3465,2217.979980,2459.467285,10.052500,356.878387,90.000000,-67.118401);
CreateDynamicObject(960,2311.314453,2494.465576,2.646600,0.000000,0.000000,-19.080000);
CreateDynamicObject(874,2314.975098,2495.270264,1.870200,0.000000,0.000000,0.000000);
CreateDynamicObject(960,2313.353271,2495.948486,2.646600,0.000000,0.000000,26.100000);
CreateDynamicObject(1440,2216.971680,2461.201416,10.333900,0.000000,0.000000,-159.779968);
CreateDynamicObject(874,2195.331055,2452.670654,9.479100,0.000000,0.000000,-45.119999);
CreateDynamicObject(955,2334.452881,2504.198975,10.218800,180.858398,90.000000,88.581596);
CreateDynamicObject(7390,2215.302002,2466.071289,14.708100,356.858398,10.000000,29.541599);
CreateDynamicObject(1438,2210.209473,2469.546875,9.820120,0.000000,0.000000,-28.919991);
CreateDynamicObject(3465,2211.127686,2471.547119,10.072500,0.000000,90.000000,67.581581);
CreateDynamicObject(874,2313.199219,2513.605225,9.660640,0.000000,0.000000,35.099998);
CreateDynamicObject(874,2207.895996,2475.918457,9.819790,0.000000,0.000000,0.000000);
CreateDynamicObject(3465,2207.612793,2476.886963,11.192500,0.000000,20.000000,90.021599);
CreateDynamicObject(734,2577.948975,2465.177246,9.706800,0.000000,0.000000,0.000000);
CreateDynamicObject(3459,2245.668213,2513.955811,9.820300,90.858398,90.000000,-55.510799);
CreateDynamicObject(874,2227.860352,2507.147949,9.662070,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2622.010742,2512.611816,4.979600,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2539.714111,2569.043945,3.432900,0.000000,0.000000,0.000000);
CreateDynamicObject(3459,2161.452637,2450.881592,9.820000,90.000000,0.000000,-199.870697);
CreateDynamicObject(1225,2151.065186,2450.530518,9.965300,0.000000,90.000000,-14.159980);
CreateDynamicObject(3594,2155.099365,2459.696045,10.218600,0.000000,0.000000,-120.959991);
CreateDynamicObject(3594,2374.813477,2610.670654,6.350300,0.000000,0.000000,34.860001);
CreateDynamicObject(3594,2600.159180,2549.985596,5.201800,0.000000,0.000000,-2.640000);
CreateDynamicObject(874,2403.977051,2614.320313,5.405800,0.000000,0.000000,-12.720000);
CreateDynamicObject(18451,2605.063232,2548.810059,5.212800,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,2148.179932,2456.421875,10.038100,0.000000,0.000000,160.860001);
CreateDynamicObject(874,2485.470703,2615.403320,4.186530,0.000000,0.000000,0.000000);
CreateDynamicObject(825,2150.894287,2468.029541,9.599000,0.000000,0.000000,-67.199997);
CreateDynamicObject(874,2152.250000,2471.351807,9.817980,0.000000,0.000000,0.000000);
CreateDynamicObject(1290,2449.818604,2630.301025,5.149700,91.258400,0.000000,40.260101);
CreateDynamicObject(3594,2141.371094,2455.267334,10.218600,0.000000,0.000000,-60.599998);
CreateDynamicObject(1327,2151.062012,2481.306885,10.258400,0.000000,30.000000,88.739990);
CreateDynamicObject(1225,2134.091553,2446.510010,9.965300,0.000000,90.000000,-123.840012);
CreateDynamicObject(3593,2151.285889,2482.732910,10.171400,0.000000,0.000000,88.919998);
CreateDynamicObject(874,2364.653564,2632.267822,5.726160,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2137.289795,2455.478760,9.699000,-0.060000,0.000000,155.759995);
CreateDynamicObject(1327,2151.447266,2486.896729,9.775300,0.000000,90.000000,0.000000);
CreateDynamicObject(1218,2142.325928,2474.070557,10.297200,0.100000,0.000000,0.000000);
CreateDynamicObject(874,2174.696533,2528.983643,9.801890,0.000000,0.000000,151.799988);
CreateDynamicObject(3593,2113.064453,2384.574463,36.099400,0.000000,0.000000,45.000000);
CreateDynamicObject(2684,2400.577881,2367.580078,10.041700,0.000000,360.000000,300.000000);
CreateDynamicObject(3594,2147.607666,2491.525635,10.210900,0.000000,0.000000,-41.700001);
CreateDynamicObject(3594,2148.675781,2499.695068,10.210900,0.000000,0.000000,-133.619995);
CreateDynamicObject(3594,2115.170898,2417.771729,19.007500,0.000000,0.000000,63.427898);
CreateDynamicObject(3594,2109.035156,2378.084717,36.600700,10.000000,-2.000000,92.582802);
CreateDynamicObject(1950,2400.008545,2371.846680,10.041700,0.000000,360.000000,300.000000);
CreateDynamicObject(874,2314.236084,2632.551025,5.712240,0.000000,0.000000,0.000000);
CreateDynamicObject(1327,2144.062256,2493.635986,9.775300,0.000000,90.000000,0.000000);
CreateDynamicObject(1327,2143.244385,2494.513916,10.375300,0.000000,90.000000,0.000000);
CreateDynamicObject(1327,2143.772949,2495.580078,9.775300,0.000000,90.000000,0.000000);
CreateDynamicObject(16305,2166.065430,2530.262207,13.000000,0.000000,0.000000,52.380001);
CreateDynamicObject(1327,2142.151611,2494.377930,9.775300,0.000000,90.000000,0.000000);
CreateDynamicObject(1327,2146.075928,2506.001465,9.775300,0.000000,90.000000,0.000000);
CreateDynamicObject(3594,2105.420654,2379.564453,36.201698,0.000000,0.000000,0.000000);
CreateDynamicObject(12957,2104.435791,2380.729248,14.832200,0.000000,0.000000,52.342999);
CreateDynamicObject(3594,2122.282715,2459.725098,10.358600,0.000000,0.000000,-27.120001);
CreateDynamicObject(3593,2120.134277,2453.967041,10.038100,0.000000,0.000000,51.660000);
CreateDynamicObject(1225,2104.267090,2374.130615,31.696100,0.000000,0.000000,0.000000);
CreateDynamicObject(1217,2143.598145,2508.947754,10.198900,0.000000,90.000000,-42.480000);
CreateDynamicObject(1218,2144.545410,2511.077393,10.278300,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2154.578125,2528.451416,9.801890,0.000000,0.000000,-97.740013);
CreateDynamicObject(3593,2255.166992,2628.883789,6.116100,0.000000,0.000000,-22.019991);
CreateDynamicObject(735,2679.770996,2563.043213,9.017800,0.000000,0.000000,0.000000);
CreateDynamicObject(16113,2659.402588,2592.935059,8.515900,0.000000,0.000000,-150.839996);
CreateDynamicObject(733,2448.882324,2714.128174,9.641900,0.000000,0.000000,-11.100000);
CreateDynamicObject(874,2727.850342,2579.030029,9.485600,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2762.881348,2570.616943,9.855000,0.020000,0.000000,0.000000);
CreateDynamicObject(874,2515.077148,2734.564697,9.799600,0.000000,0.000000,0.000000);
CreateDynamicObject(1224,2473.420166,2730.028809,10.437500,0.000000,0.000000,0.000000);
CreateDynamicObject(1347,2475.947754,2733.135986,10.058100,0.000000,90.000000,108.000000);
CreateDynamicObject(1264,2477.065918,2734.310059,10.219400,0.000000,0.000000,0.000000);
CreateDynamicObject(1299,2480.785645,2738.569092,10.152600,0.000000,0.000000,0.000000);
CreateDynamicObject(13591,2550.805908,2754.411621,10.232300,0.000000,0.000000,-38.820000);
CreateDynamicObject(874,2527.353027,2755.165039,9.815050,0.000000,0.000000,-139.560135);
CreateDynamicObject(3594,2412.775146,2722.512695,10.283900,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2383.919922,2711.083496,9.857060,0.000000,0.000000,35.759998);
CreateDynamicObject(1415,2568.476074,2766.694824,9.959000,0.000000,0.000000,-139.980026);
CreateDynamicObject(849,2567.194092,2769.362305,10.060700,0.200000,2.800000,0.000000);
CreateDynamicObject(765,2465.132080,2756.063965,9.793800,0.000000,0.000000,0.000000);
CreateDynamicObject(1441,2570.258301,2769.702637,10.475200,0.000000,0.000000,97.620010);
CreateDynamicObject(874,2432.005127,2743.501221,9.656100,0.000000,0.000000,-56.040001);
CreateDynamicObject(3593,2533.802734,2771.568359,10.309200,0.000000,0.000000,-34.860001);
CreateDynamicObject(986,2498.744385,2769.017578,11.531300,6.000000,0.000000,65.160004);
CreateDynamicObject(1439,2567.775391,2774.322998,9.933500,0.000000,0.000000,-35.400002);
CreateDynamicObject(3460,2479.777832,2765.675049,10.005600,3.161600,90.000000,52.319988);
CreateDynamicObject(1344,2365.227295,2716.101318,10.118700,270.000000,0.000000,45.180000);
CreateDynamicObject(2672,2363.518799,2716.851318,9.947800,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2535.291992,2787.883301,9.813390,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2481.564209,2779.719971,9.661490,0.000000,0.000000,25.500000);
CreateDynamicObject(1327,2512.530029,2788.306885,9.797200,0.000000,90.000000,0.000000);
CreateDynamicObject(1448,2512.572998,2788.375244,10.511000,-1.260000,-2.580000,0.000000);
CreateDynamicObject(2059,2512.544434,2788.550049,10.611700,0.000000,0.000000,0.000000);
CreateDynamicObject(1450,2460.425781,2776.496826,10.209800,0.000000,0.000000,-1.740000);
CreateDynamicObject(1220,2460.556152,2777.422607,10.169100,0.000000,0.000000,-26.879999);
CreateDynamicObject(1327,2527.726807,2791.950928,10.597200,0.000000,20.000000,48.779991);
CreateDynamicObject(3594,2526.998047,2794.394043,10.411800,0.000000,0.000000,48.360001);
CreateDynamicObject(734,2477.025635,2795.720703,9.691800,0.000000,0.000000,0.000000);
CreateDynamicObject(735,2911.734863,2516.182129,8.713500,0.000000,0.000000,-82.620003);
CreateDynamicObject(850,2896.406738,2436.951660,9.919300,0.000000,0.000000,-108.959999);
CreateDynamicObject(1431,2896.541260,2433.278076,9.812590,0.000000,0.000000,0.000000);
CreateDynamicObject(850,2895.906982,2430.756592,9.919300,0.000000,0.000000,0.000000);
CreateDynamicObject(1431,2898.155762,2433.534912,10.352600,0.000000,0.000000,66.900002);
CreateDynamicObject(926,2905.587891,2449.026611,10.079000,0.000000,0.000000,-12.660000);
CreateDynamicObject(1219,2901.667480,2438.010986,10.014600,0.000000,0.000000,17.100000);
CreateDynamicObject(960,2906.117432,2450.384521,10.152600,0.000000,0.000000,24.900000);
CreateDynamicObject(1218,2899.175049,2431.085205,10.214500,0.000000,90.000000,36.000000);
CreateDynamicObject(1327,2901.563965,2433.133057,9.780000,0.000000,90.000000,0.000000);
CreateDynamicObject(1951,2804.749268,2390.829346,10.078600,0.000000,360.000000,300.000000);
CreateDynamicObject(1951,2862.601563,2403.119629,10.142900,0.000000,360.000000,300.000000);
CreateDynamicObject(1950,2871.440186,2402.646240,10.142900,0.000000,360.000000,300.000000);
CreateDynamicObject(19570,2868.785889,2397.777832,10.142900,0.000000,360.000000,300.000000);
CreateDynamicObject(1930,2896.032471,2435.954590,10.060600,0.000000,360.000000,300.000000);
CreateDynamicObject(1575,2896.933594,2433.280762,10.580300,0.000000,360.000000,300.000000);
CreateDynamicObject(1575,2899.439941,2433.997559,10.060600,0.000000,360.000000,300.000000);
CreateDynamicObject(365,2906.115234,2450.195557,10.080800,0.000000,360.000000,300.000000);
CreateDynamicObject(1950,2868.482666,2389.962158,10.142900,0.000000,360.000000,300.000000);
CreateDynamicObject(1951,2885.238525,2371.137695,10.056700,0.000000,360.000000,300.000000);
CreateDynamicObject(1575,2790.479980,2398.362061,10.060100,0.000000,360.000000,300.000000);
CreateDynamicObject(841,2675.939941,2564.610107,9.970000,0.000000,360.000000,300.000000);
CreateDynamicObject(1327,2323.414551,2710.254883,9.661100,0.000000,90.000000,0.000000);
CreateDynamicObject(874,2316.068848,2710.124756,9.660020,0.000000,0.000000,-10.200010);
CreateDynamicObject(734,2273.135010,2674.823730,8.263040,0.000000,0.000000,196.126144);
CreateDynamicObject(3460,2255.647705,2711.704590,9.945600,3.161600,90.000000,125.400017);
CreateDynamicObject(874,2254.108887,2712.102051,9.658710,0.000000,0.000000,100.680000);
CreateDynamicObject(13591,2248.341064,2756.755859,10.123100,0.000000,0.000000,-54.840000);
CreateDynamicObject(874,2251.998535,2766.834717,9.803110,0.000000,0.000000,0.000000);
CreateDynamicObject(1440,2230.296631,2735.301758,10.164800,0.000000,0.000000,28.920000);
CreateDynamicObject(1321,2229.258301,2731.171875,9.713300,0.000000,270.000000,-37.919998);
CreateDynamicObject(874,2220.070557,2622.584717,5.754500,0.000000,0.000000,0.000000);
CreateDynamicObject(3459,2217.267822,2742.814697,9.960300,102.858398,91.680000,-58.450802);
CreateDynamicObject(874,2224.593018,2772.327637,9.688940,0.000000,0.000000,57.180012);
CreateDynamicObject(874,2213.159180,2760.897217,9.688940,0.000000,0.000000,0.000000);
CreateDynamicObject(3460,2199.918945,2772.704346,9.905600,3.161600,90.000000,33.779999);
CreateDynamicObject(1580,2479.760010,2738.669922,10.080000,0.000000,360.000000,300.000000);
CreateDynamicObject(1902,2525.469971,2793.439941,10.070000,0.000000,360.000000,300.000000);
CreateDynamicObject(1575,2564.610107,2821.399902,10.000000,0.000000,360.000000,300.000000);
CreateDynamicObject(19897,2562.790039,2838.669922,10.000000,0.000000,360.000000,300.000000);
CreateDynamicObject(1951,2570.840088,2806.620117,10.040000,0.000000,360.000000,300.000000);
CreateDynamicObject(1455,2596.129883,2821.449951,10.000000,0.000000,360.000000,300.000000);
CreateDynamicObject(841,2607.979980,2816.000000,10.000000,0.000000,360.000000,300.000000);
CreateDynamicObject(2671,2173.378174,2771.120850,9.690300,0.000000,0.000000,0.000000);
CreateDynamicObject(2943,2171.177246,2771.082275,9.988100,0.000000,90.000000,59.040001);
CreateDynamicObject(874,2186.725342,2630.757080,8.801180,10.000000,0.000000,0.000000);
CreateDynamicObject(874,2158.988525,2771.083008,9.853300,0.000000,0.000000,15.840000);
CreateDynamicObject(734,2172.768799,2650.998779,8.878240,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2190.548584,2593.305664,5.739740,0.000000,0.000000,-72.360008);
CreateDynamicObject(874,2168.647949,2633.089844,9.660940,10.000000,0.000000,0.000000);
CreateDynamicObject(1290,2179.191406,2605.587891,5.824900,90.000000,0.000000,142.776505);
CreateDynamicObject(3465,2143.216797,2753.525879,11.273400,-20.858400,30.000000,-3.141600);
CreateDynamicObject(734,2144.779297,2677.354248,9.388300,0.000000,0.000000,45.000000);
CreateDynamicObject(874,2167.386719,2605.580811,5.754500,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2134.592041,2751.330811,9.916100,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2162.059570,2606.009277,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(3594,2161.291260,2600.535889,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(874,2149.111816,2627.751953,9.613260,10.000000,0.000000,0.000000);
CreateDynamicObject(3594,2152.173584,2602.978760,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(3594,2123.325928,2734.406738,10.413800,0.000000,0.000000,-54.779999);
CreateDynamicObject(1327,2123.256592,2739.379639,9.797700,0.000000,90.000000,0.000000);
CreateDynamicObject(3593,2151.197754,2596.210938,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(874,2129.868164,2797.606201,9.710860,0.000000,0.000000,-93.719971);
CreateDynamicObject(874,2136.340820,2619.699463,8.588900,10.000000,0.000000,0.000000);
CreateDynamicObject(3594,2142.074707,2602.123291,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(2675,2140.982422,2837.429443,9.894900,0.000000,0.000000,0.000000);
CreateDynamicObject(13591,2145.831055,2849.409424,10.031500,0.000000,0.000000,-66.419998);
CreateDynamicObject(2676,2139.192139,2834.796387,9.926900,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2141.713867,2596.209961,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(874,2137.256104,2604.957275,5.754500,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2126.660889,2622.108398,8.588900,10.000000,0.000000,0.000000);
CreateDynamicObject(874,2132.583740,2825.916748,9.710860,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2141.533936,2580.191650,6.201410,0.000000,0.000000,65.277817);
CreateDynamicObject(3593,2131.277832,2598.806152,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(3593,2132.372559,2591.206543,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(3459,2129.589600,2824.120117,9.780300,102.858398,91.680000,-137.110794);
CreateDynamicObject(3594,2125.061523,2601.333740,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(3594,2127.707031,2593.693848,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(748,2114.137451,2787.416992,9.912200,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2110.010986,2772.745850,9.850910,0.000000,0.000000,7.680000);
CreateDynamicObject(728,2135.518799,2843.679688,9.013000,0.000000,0.000000,19.620001);
CreateDynamicObject(3594,2122.141846,2596.145264,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(3593,2139.162598,2851.155273,10.153200,0.000000,0.000000,-135.780106);
CreateDynamicObject(3594,2103.826904,2657.830078,10.376800,0.000000,0.000000,251.839798);
CreateDynamicObject(2673,2103.633789,2652.751953,9.917200,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2121.440430,2586.999756,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(3593,2119.129883,2589.938477,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(874,2112.485596,2603.518066,5.765050,0.000000,0.000000,0.000000);
CreateDynamicObject(1219,2099.946777,2648.692383,10.038600,0.000000,0.000000,45.000000);
CreateDynamicObject(3594,2129.552246,2839.921143,10.185200,0.000000,0.000000,35.520000);
CreateDynamicObject(1448,2096.207520,2663.946777,9.874700,0.000000,0.000000,20.000000);
CreateDynamicObject(1448,2095.640381,2665.364014,9.874700,0.000000,0.000000,-50.000000);
CreateDynamicObject(1448,2095.413086,2664.200684,10.015000,0.000000,0.000000,60.000000);
CreateDynamicObject(734,2106.462891,2610.581787,6.848330,0.000000,0.000000,0.000000);
CreateDynamicObject(1348,2144.558838,2530.047363,10.499000,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2111.809570,2593.317383,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(1448,2094.607910,2664.442627,9.874700,0.000000,0.000000,-20.000000);
CreateDynamicObject(874,2130.037598,2843.174072,9.850540,0.000000,0.000000,0.000000);
CreateDynamicObject(918,2144.675781,2528.191406,10.058600,0.000000,90.000000,-58.919991);
CreateDynamicObject(918,2141.031738,2529.702148,10.058600,0.000000,90.000000,-160.259995);
CreateDynamicObject(3594,2110.178223,2587.647217,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(1411,2088.624512,2680.369629,10.006300,88.858398,0.000000,-65.378403);
CreateDynamicObject(874,2088.207031,2707.544922,9.940600,0.000000,0.000000,0.000000);
CreateDynamicObject(1438,2136.833740,2528.883789,9.780900,0.000000,0.000000,45.119999);
CreateDynamicObject(734,2104.652832,2794.148682,9.462300,0.000000,0.000000,-46.079990);
CreateDynamicObject(1431,2134.058105,2529.968994,10.344900,0.000000,0.000000,0.300000);
CreateDynamicObject(3593,2127.217529,2845.528320,10.185200,0.000000,0.000000,-37.020000);
CreateDynamicObject(3593,2102.147461,2590.114014,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(821,2087.360840,2637.523193,9.359300,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2135.056396,2520.386719,9.816520,0.000000,0.000000,70.740013);
CreateDynamicObject(874,2099.966309,2588.132324,4.558650,0.000000,0.000000,0.000000);
CreateDynamicObject(3866,2135.810547,2517.529297,9.629400,0.000000,0.000000,-89.220016);
CreateDynamicObject(3594,2100.436768,2584.796631,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(825,2124.536133,2527.606445,9.669600,0.000000,0.000000,12.600000);
CreateDynamicObject(1259,2091.168945,2593.692627,7.917800,3.141600,88.000000,-265.620148);
CreateDynamicObject(3594,2091.312256,2586.613770,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(3594,2090.922119,2581.592285,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(3593,2087.448242,2590.435059,6.324800,0.000000,0.000000,290.021088);
CreateDynamicObject(1412,2105.977295,2538.719727,11.070400,0.000000,0.000000,14.820000);
CreateDynamicObject(1413,2100.905029,2537.423096,11.010200,0.000000,0.000000,195.899933);
CreateDynamicObject(759,2082.684082,2577.712891,5.767900,0.000000,0.000000,-45.720001);
CreateDynamicObject(874,2069.679199,2740.292969,9.663770,0.000000,0.000000,97.140007);
CreateDynamicObject(874,2084.207520,2569.093750,5.762430,0.000000,0.000000,17.459999);
CreateDynamicObject(759,2080.636719,2575.709961,5.767900,0.000000,0.000000,-27.059999);
CreateDynamicObject(874,2071.339355,2603.672119,8.588900,10.000000,0.000000,0.000000);
CreateDynamicObject(11480,2104.292725,2521.512695,11.940000,0.000000,0.000000,5.640000);
CreateDynamicObject(3594,2105.850586,2518.219971,10.232700,0.000000,0.000000,20.100000);
CreateDynamicObject(1327,2115.766846,2503.536865,9.728200,0.000000,90.000000,0.000000);
CreateDynamicObject(1447,2096.005127,2533.356201,9.932200,90.000000,0.000000,37.500000);
CreateDynamicObject(1440,2102.034668,2519.839844,10.320400,0.000000,0.000000,93.660004);
CreateDynamicObject(10984,2125.372070,2483.681152,10.413500,0.000000,0.000000,29.160000);
CreateDynamicObject(3459,2061.116455,2740.334229,9.840300,90.858398,90.000000,134.809189);
CreateDynamicObject(1412,2089.529785,2532.360596,9.865200,90.000000,0.000000,10.920000);
CreateDynamicObject(874,2124.813721,2478.076416,9.939000,0.000000,0.000000,47.700020);
CreateDynamicObject(874,2114.652100,2483.958496,9.939000,0.000000,0.000000,153.059998);
CreateDynamicObject(10984,2114.688232,2476.836182,10.413500,0.000000,0.000000,105.660004);
CreateDynamicObject(874,2040.527222,2643.104004,9.787780,0.000000,0.000000,57.180000);
CreateDynamicObject(874,2092.143555,2495.864502,10.275600,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2105.515869,2475.577393,9.939000,0.000000,0.000000,68.819992);
CreateDynamicObject(874,2083.622559,2501.366455,10.275600,0.000000,0.000000,68.879997);
CreateDynamicObject(1327,2104.642578,2458.464355,9.583500,0.000000,90.000000,0.000000);
CreateDynamicObject(3286,2063.879883,2515.058838,14.400000,0.000000,0.000000,1.740000);
CreateDynamicObject(1327,2095.507324,2467.184082,9.583500,0.000000,90.000000,0.000000);
CreateDynamicObject(18451,2025.844604,2637.878906,10.239100,0.000000,0.000000,-115.199997);
CreateDynamicObject(1431,2067.283936,2503.731934,9.816990,0.000000,0.000000,-147.059967);
CreateDynamicObject(1431,2068.059082,2500.968262,10.340000,0.000000,0.000000,-89.999977);
CreateDynamicObject(874,2077.131348,2485.355957,10.275600,0.000000,0.000000,130.860001);
CreateDynamicObject(1225,2104.228516,2451.760498,9.965300,0.000000,90.000000,-123.840012);
CreateDynamicObject(874,2101.849365,2454.199219,9.699000,-0.060000,0.000000,68.820000);
CreateDynamicObject(1225,2098.983887,2455.974121,9.965300,0.000000,90.000000,-57.599998);
CreateDynamicObject(1431,2064.924072,2496.090820,10.340000,0.000000,0.000000,-181.559998);
CreateDynamicObject(874,2054.207764,2512.549561,9.818550,0.000000,0.000000,-60.420010);
CreateDynamicObject(3286,2053.335938,2513.628662,11.265900,90.000000,0.000000,60.239899);
CreateDynamicObject(1217,2097.991211,2450.361328,10.047500,0.000000,0.000000,0.000000);
CreateDynamicObject(16370,2058.157227,2503.665283,11.220000,0.000000,0.000000,181.500015);
CreateDynamicObject(3459,2087.775146,2455.719238,9.820300,90.858398,90.000000,-37.270802);
CreateDynamicObject(3459,2078.578857,2465.776123,9.840000,90.000000,0.000000,-139.030807);
CreateDynamicObject(13489,2049.960693,2500.683594,12.360000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2058.686768,2482.624756,9.817360,0.000000,0.000000,-75.900002);
CreateDynamicObject(13591,2008.912720,2620.669189,10.304300,0.000000,0.000000,-67.739998);
CreateDynamicObject(3460,2026.836548,2531.997314,12.355900,356.858398,90.000000,-21.730801);
CreateDynamicObject(3594,2054.083740,2480.145508,10.172200,0.000000,0.000000,34.619999);
CreateDynamicObject(3460,2018.595337,2744.297363,9.805600,179.858398,90.000000,-119.498398);
CreateDynamicObject(874,2028.986572,2517.211914,10.734240,0.000000,0.000000,0.000000);
CreateDynamicObject(2677,1997.225220,2628.315674,10.093800,0.000000,0.000000,0.000000);
CreateDynamicObject(1224,1994.015015,2628.693359,10.414700,0.000000,0.000000,22.920000);
CreateDynamicObject(874,2011.440796,2747.266113,9.680900,0.000000,0.000000,-53.580002);
CreateDynamicObject(3593,2105.287598,2408.293457,23.145000,0.000000,0.000000,158.437607);
CreateDynamicObject(19944,2097.428223,2422.345947,73.574600,0.000000,0.000000,0.000000);
CreateDynamicObject(19944,2095.134521,2422.415283,73.574600,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2091.184570,2415.729980,14.722200,0.000000,0.000000,122.909889);
CreateDynamicObject(968,2068.338379,2437.306641,10.596800,0.000000,90.000000,180.302994);
CreateDynamicObject(851,1986.678101,2651.074463,10.084200,0.000000,0.000000,-75.899986);
CreateDynamicObject(966,2068.119141,2437.283936,9.812500,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,2094.186035,2413.688965,36.099400,0.000000,0.000000,99.704201);
CreateDynamicObject(19944,2092.941162,2422.394287,73.574600,0.000000,0.000000,0.000000);
CreateDynamicObject(1412,2014.791870,2512.414551,11.083600,0.000000,0.000000,16.080000);
CreateDynamicObject(19944,2090.742432,2422.458740,73.574600,0.000000,0.000000,0.000000);
CreateDynamicObject(874,2044.808105,2459.497803,9.817360,0.000000,0.000000,0.000000);
CreateDynamicObject(19944,2088.605469,2422.481934,73.574600,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,2105.742432,2399.002686,18.860500,0.000000,0.000000,93.530899);
CreateDynamicObject(825,2015.589966,2500.786377,9.617400,0.000000,0.000000,-13.919990);
CreateDynamicObject(1412,2009.770264,2510.904297,11.083600,0.000000,0.000000,16.559999);
CreateDynamicObject(1293,2061.514404,2435.816406,10.048400,4.000000,90.000000,50.000000);
CreateDynamicObject(825,2015.296265,2498.848389,9.617400,0.000000,0.000000,-69.839996);
CreateDynamicObject(734,2005.398438,2517.826904,7.065340,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,2087.598633,2413.758789,49.028500,0.000000,0.000000,90.000000);
CreateDynamicObject(3594,2090.028320,2407.301270,10.325370,0.000000,0.000000,166.727524);
CreateDynamicObject(825,2012.588379,2499.587402,9.617400,0.000000,0.000000,-13.919990);
CreateDynamicObject(1431,2100.631348,2402.141357,59.804001,0.000000,180.000000,0.000000);
CreateDynamicObject(966,2054.014648,2437.284180,9.812520,0.000000,0.000000,180.000000);
CreateDynamicObject(968,2054.342773,2436.454834,9.990800,0.000000,90.000000,317.670471);
CreateDynamicObject(1413,2005.458008,2507.406982,9.994300,90.000000,0.000000,39.299999);
CreateDynamicObject(2049,2099.417969,2402.566650,61.150902,0.000000,0.000000,0.000000);
CreateDynamicObject(2060,2098.852539,2402.252197,59.861500,0.000000,0.000000,0.000000);
CreateDynamicObject(2060,2098.304932,2402.338135,60.050499,0.000000,0.000000,0.000000);
CreateDynamicObject(2060,2097.687500,2402.280273,59.861500,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2072.417725,2417.525635,27.549400,0.000000,0.000000,42.566479);
CreateDynamicObject(3593,2069.975342,2419.333496,23.166000,0.000000,0.000000,90.000000);
CreateDynamicObject(874,1990.390747,2537.966309,5.773360,0.000000,0.000000,-63.900009);
CreateDynamicObject(2068,2098.477051,2401.630615,62.881222,0.000000,0.000000,0.000000);
CreateDynamicObject(1431,2096.032471,2402.168213,59.804001,0.000000,180.000000,0.000000);
CreateDynamicObject(1897,2101.892334,2397.534180,59.972801,0.000000,180.000000,0.000000);
CreateDynamicObject(3594,2105.110596,2393.024658,49.109402,0.000000,0.000000,93.294403);
CreateDynamicObject(2057,2096.140381,2401.227051,59.987499,0.000000,0.000000,36.290470);
CreateDynamicObject(1225,2100.979492,2397.702881,60.198101,0.000000,0.000000,0.000000);
CreateDynamicObject(1897,2101.855713,2397.532715,62.197701,0.000000,0.000000,0.000000);
CreateDynamicObject(19898,2100.320801,2397.771240,59.841900,0.000000,0.000000,278.936340);
CreateDynamicObject(1218,2094.240723,2401.923096,60.282101,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1970.300415,2648.803711,9.647540,0.000000,0.000000,83.279999);
CreateDynamicObject(3594,2105.337891,2389.774414,36.201698,0.000000,0.000000,335.312531);
CreateDynamicObject(1225,2099.820068,2397.372803,60.198101,0.000000,0.000000,0.000000);
CreateDynamicObject(1431,2095.894531,2399.696533,59.804001,0.000000,180.000000,90.176773);
CreateDynamicObject(1218,2093.005615,2401.780273,60.282101,0.000000,0.000000,0.000000);
CreateDynamicObject(2912,2098.001709,2397.568848,59.820580,0.000000,0.000000,0.000000);
CreateDynamicObject(2894,2097.983643,2397.602783,60.509998,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,2094.916504,2394.350098,27.423361,0.000000,0.000000,330.127655);
CreateDynamicObject(1218,2096.272461,2398.008545,60.282101,0.000000,0.000000,0.000000);
CreateDynamicObject(1897,2095.168945,2397.413818,59.972801,0.000000,180.000000,0.000000);
CreateDynamicObject(3593,2094.005371,2392.961914,23.166000,0.000000,0.000000,90.000000);
CreateDynamicObject(1897,2095.142578,2397.412109,62.197701,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2069.923584,2410.192627,10.325370,0.000000,0.000000,92.631790);
CreateDynamicObject(1343,1962.729980,2641.535889,10.083400,0.000000,85.000000,112.260002);
CreateDynamicObject(3594,2007.111450,2473.618896,10.224300,0.000000,0.000000,-39.959999);
CreateDynamicObject(3594,2010.446533,2468.539551,10.224300,0.000000,0.000000,-137.760025);
CreateDynamicObject(3594,2095.004883,2384.690430,23.166000,0.000000,0.000000,29.086599);
CreateDynamicObject(3594,2073.931885,2398.174561,19.007500,0.000000,0.000000,44.138649);
CreateDynamicObject(1328,1969.701538,2742.173340,10.006200,0.000000,90.000000,-115.980003);
CreateDynamicObject(3593,2077.145752,2395.328369,10.241400,0.000000,0.000000,103.934013);
CreateDynamicObject(1441,1967.925659,2740.138428,10.303400,0.000000,0.000000,-45.660000);
CreateDynamicObject(874,1987.780762,2488.673096,9.828390,0.000000,0.000000,54.779999);
CreateDynamicObject(3460,1941.335449,2644.769775,9.945600,3.141600,90.000000,-133.740005);
CreateDynamicObject(3593,2078.114502,2388.705322,14.598200,0.000000,0.000000,22.033199);
CreateDynamicObject(874,1982.859985,2477.638916,9.828390,0.000000,0.000000,323.759918);
CreateDynamicObject(1412,1969.614990,2497.001221,9.899900,90.000000,0.000000,5.820000);
CreateDynamicObject(3594,2033.908081,2416.752930,10.061900,0.000000,0.000000,-38.220001);
CreateDynamicObject(874,1993.468872,2459.887939,9.816620,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,2028.744507,2419.247314,10.061900,0.000000,0.000000,85.800003);
CreateDynamicObject(3447,1993.794189,2456.620117,10.120000,90.000000,0.000000,-234.959961);
CreateDynamicObject(1413,1963.988403,2497.158447,10.955300,0.000000,0.000000,16.680000);
CreateDynamicObject(1225,2077.572754,2378.876953,27.398600,0.000000,0.000000,0.000000);
CreateDynamicObject(3460,2027.710205,2412.091064,9.925600,0.858400,270.000000,24.349199);
CreateDynamicObject(874,2018.454224,2418.277344,9.815630,0.000000,0.000000,64.439987);
CreateDynamicObject(849,1918.540039,2640.595459,9.945500,0.000000,0.000000,0.000000);
CreateDynamicObject(1225,2077.382813,2377.511475,27.377600,0.000000,90.000000,45.000000);
CreateDynamicObject(3459,1931.869263,2738.417969,9.840300,90.858398,90.000000,41.269199);
CreateDynamicObject(1264,1964.345459,2475.426758,9.996100,0.000000,0.000000,0.000000);
CreateDynamicObject(926,1961.670288,2478.140625,10.088800,0.000000,0.000000,9.060000);
CreateDynamicObject(1440,1963.625732,2472.348877,10.277600,0.000000,0.000000,37.679989);
CreateDynamicObject(874,1910.537598,2651.577637,10.322000,0.000000,0.000000,21.959999);
CreateDynamicObject(3593,2076.808594,2374.279785,35.949799,0.000000,0.000000,0.000000);
CreateDynamicObject(12957,1960.207275,2475.512695,10.515800,0.000000,0.000000,44.220001);
CreateDynamicObject(3593,2074.841064,2373.675537,14.577200,0.000000,0.000000,293.424286);
CreateDynamicObject(1264,1957.381714,2477.784424,10.116100,0.000000,0.000000,27.180000);
CreateDynamicObject(16305,2018.939087,2406.196289,13.000000,0.000000,0.000000,0.000000);
CreateDynamicObject(1225,1958.341187,2470.406006,10.233600,0.000000,90.000000,8.400000);
CreateDynamicObject(1225,2076.993164,2368.324951,27.377600,0.000000,90.000000,0.000000);
CreateDynamicObject(874,1907.543457,2711.485107,9.867440,0.000000,0.000000,-30.840000);
CreateDynamicObject(3502,1966.760864,2448.110596,11.400000,0.000000,0.000000,50.580002);
CreateDynamicObject(3594,1992.615723,2420.580078,10.325000,0.000000,0.000000,-49.860001);
CreateDynamicObject(818,2004.765869,2408.810547,9.477400,0.000000,0.000000,3.480000);
CreateDynamicObject(874,2011.012695,2403.271973,9.815630,0.000000,0.000000,0.000000);
CreateDynamicObject(10984,1957.379272,2451.544434,10.526900,0.000000,0.000000,24.840000);
CreateDynamicObject(1449,1998.806396,2408.271729,10.200300,-20.000000,0.000000,2.640000);
CreateDynamicObject(874,1909.931152,2755.561279,9.655710,0.000000,0.000000,-1.620000);
CreateDynamicObject(3865,1959.095215,2444.103271,11.260000,0.000000,0.000000,-47.580002);
CreateDynamicObject(11011,1984.486206,2417.161865,13.780000,0.000000,0.000000,271.860016);
CreateDynamicObject(874,1934.192993,2475.223145,9.817780,0.000000,0.000000,74.640007);
CreateDynamicObject(1290,1904.560913,2531.357178,5.961300,90.000000,0.000000,141.158340);
CreateDynamicObject(2674,1940.068726,2464.324463,9.839100,0.000000,0.000000,-120.299980);
CreateDynamicObject(1327,1992.880127,2408.029053,10.379400,30.000000,45.000000,67.019997);
CreateDynamicObject(2670,1890.829468,2714.509766,9.750300,0.000000,0.000000,48.180000);
CreateDynamicObject(874,1979.831055,2418.268066,10.958940,0.000000,0.000000,85.259987);
CreateDynamicObject(1442,1938.634521,2463.645264,10.178900,0.000000,90.000000,13.860000);
CreateDynamicObject(1332,1889.883423,2716.513672,10.197900,270.040009,90.000000,-24.240000);
CreateDynamicObject(1413,1923.690308,2483.923340,10.896300,0.000000,0.000000,15.960000);
CreateDynamicObject(1440,1969.097412,2423.444824,11.341600,0.000000,0.000000,58.500000);
CreateDynamicObject(1462,1939.058350,2455.596924,9.819120,0.000000,0.000000,87.539970);
CreateDynamicObject(1365,1931.493042,2465.067871,10.940000,0.000000,0.000000,177.839828);
CreateDynamicObject(874,1992.333984,2401.369141,9.811800,0.000000,0.000000,71.220001);
CreateDynamicObject(849,1933.914917,2459.296875,11.135700,0.000000,0.000000,16.379999);
CreateDynamicObject(1412,1918.467773,2480.695068,9.853500,90.000000,0.000000,0.360000);
CreateDynamicObject(1327,1937.361816,2452.290283,11.477000,0.000000,20.000000,90.540001);
CreateDynamicObject(734,1886.684082,2735.597412,9.696700,0.000000,0.000000,31.139999);
CreateDynamicObject(916,1970.544312,2411.636230,11.061000,0.000000,0.000000,-83.099983);
CreateDynamicObject(1413,1912.108032,2478.702148,9.937500,90.000000,0.000000,29.760000);
CreateDynamicObject(924,1969.250122,2411.735840,11.140700,0.000000,0.000000,-144.179993);
CreateDynamicObject(1230,1873.035278,2716.425781,10.065800,0.000000,0.000000,-58.020000);
CreateDynamicObject(1438,1921.558838,2455.707520,10.836300,0.000000,0.000000,61.619999);
CreateDynamicObject(3593,1933.510986,2440.845703,10.169100,0.000000,0.000000,-232.559906);
CreateDynamicObject(874,1880.723511,2525.000977,5.801620,0.000000,0.000000,-32.520000);
CreateDynamicObject(874,1963.819946,2408.718994,9.820310,0.000000,0.000000,0.000000);
CreateDynamicObject(1436,1918.409790,2456.855469,12.360000,0.000000,0.000000,-91.259949);
CreateDynamicObject(874,1927.953369,2443.477539,9.816920,0.000000,0.000000,0.000000);
CreateDynamicObject(2670,1919.337402,2450.445801,10.936100,0.000000,0.000000,75.779991);
CreateDynamicObject(1450,1920.580566,2444.572021,10.398100,0.000000,0.000000,90.839996);
CreateDynamicObject(10985,1959.406250,2403.551025,9.637700,0.000000,0.000000,24.240000);
CreateDynamicObject(874,1971.816040,2392.727295,9.662550,0.000000,0.000000,18.420000);
CreateDynamicObject(825,1905.898193,2459.705566,10.775600,0.000000,0.000000,22.680000);
CreateDynamicObject(1441,1917.863892,2437.946533,11.480000,0.000000,0.000000,87.300003);
CreateDynamicObject(1575,2149.906738,2602.084229,6.603160,0.000000,360.000000,300.000000);
CreateDynamicObject(19562,2159.631104,2605.387695,6.601960,0.000000,360.000000,300.000000);
CreateDynamicObject(734,2075.333984,2335.598633,10.181100,0.000000,0.000000,0.000000);
CreateDynamicObject(11088,1906.268188,2439.635254,16.200001,0.000000,0.000000,-90.779984);
CreateDynamicObject(1575,2139.718750,2595.458984,6.570320,0.000000,360.000000,300.000000);
CreateDynamicObject(19821,2129.071289,2597.846436,6.655900,0.000000,360.000000,300.000000);
CreateDynamicObject(1951,2125.502441,2593.078125,6.574730,0.000000,360.000000,300.000000);
CreateDynamicObject(952,1900.794556,2436.516846,12.118200,0.000000,0.000000,179.039948);
CreateDynamicObject(874,1910.471680,2422.210938,10.853190,0.000000,0.000000,0.000000);
CreateDynamicObject(1462,1916.141235,2413.424316,9.777700,0.000000,0.000000,89.039993);
CreateDynamicObject(960,1881.434326,2461.044922,11.236900,0.000000,0.000000,31.920000);
CreateDynamicObject(960,1883.781006,2455.523926,11.236900,0.000000,0.000000,18.239990);
CreateDynamicObject(1412,1874.899292,2470.348877,11.035500,0.000000,0.000000,12.420000);
CreateDynamicObject(874,1857.310059,2500.502197,5.983100,0.000000,0.000000,72.300003);
CreateDynamicObject(1412,1869.847290,2469.251709,11.035500,0.000000,0.000000,12.420000);
CreateDynamicObject(922,1902.831421,2416.387451,11.720000,0.000000,0.000000,-91.019997);
CreateDynamicObject(952,1900.442505,2417.204346,12.118200,0.000000,0.000000,356.219940);
CreateDynamicObject(1412,1864.795654,2468.140869,11.035500,0.000000,0.000000,12.420000);
CreateDynamicObject(1440,1888.433960,2426.908447,11.374100,0.000000,0.000000,93.959999);
CreateDynamicObject(874,1919.220825,2388.885254,9.819000,0.000000,0.000000,-33.180000);
CreateDynamicObject(960,1901.402954,2406.904297,10.198000,0.000000,0.000000,29.160000);
CreateDynamicObject(1413,1862.004761,2464.959961,10.996600,0.000000,0.000000,-452.879791);
CreateDynamicObject(928,1901.344116,2404.775146,10.078800,0.000000,0.000000,8.340000);
CreateDynamicObject(825,1916.886597,2387.834961,9.814840,0.000000,0.000000,59.700001);
CreateDynamicObject(926,1899.696777,2406.397705,10.078600,0.000000,0.000000,0.000000);
CreateDynamicObject(825,1917.931030,2386.284424,9.814840,0.000000,0.000000,34.500000);
CreateDynamicObject(1950,2128.686035,2599.082764,5.873437,0.000000,360.000000,250.000000);
CreateDynamicObject(825,1894.057495,2412.114746,9.814840,0.000000,0.000000,74.100014);
CreateDynamicObject(960,1899.032227,2404.093506,10.198000,0.000000,0.000000,-7.620000);
CreateDynamicObject(825,1891.095093,2412.202637,9.814840,0.000000,0.000000,59.700001);
CreateDynamicObject(19821,2102.854004,2585.436279,6.552720,0.000000,360.000000,300.000000);
CreateDynamicObject(874,1880.542847,2423.731689,10.848550,0.000000,0.000000,0.000000);
CreateDynamicObject(1440,1885.486084,2413.258545,11.336000,0.000000,0.000000,41.759998);
CreateDynamicObject(923,1875.886353,2412.672119,11.720000,0.000000,0.000000,-0.360000);
CreateDynamicObject(3594,1863.300537,2409.536133,10.334100,0.000000,0.000000,-65.459999);
CreateDynamicObject(874,1864.073730,2408.013428,9.818770,0.000000,0.000000,0.000000);
CreateDynamicObject(12957,1858.853638,2413.280518,10.498700,0.000000,0.000000,61.860001);
CreateDynamicObject(874,1857.304932,2408.539063,9.818770,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1820.419556,2708.463135,9.652220,0.000000,0.000000,-8.940010);
CreateDynamicObject(3593,1860.965698,2402.201416,10.172300,0.060000,0.000000,40.860001);
CreateDynamicObject(3594,1855.834473,2408.591553,10.334100,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1820.489136,2460.985596,12.439250,0.000000,0.000000,0.000000);
CreateDynamicObject(874,1793.534546,2546.229492,13.015300,0.000000,0.000000,0.000000);
CreateDynamicObject(1950,2089.566650,2590.256592,7.053867,0.000000,360.000000,250.000000);
CreateDynamicObject(874,1927.540161,2335.153564,9.665160,0.000000,0.000000,-20.340000);
CreateDynamicObject(11736,2107.610107,2650.129883,10.060000,0.000000,360.000000,300.000000);
CreateDynamicObject(841,2116.040039,2788.419922,9.920000,0.000000,360.000000,300.000000);
CreateDynamicObject(2671,2149.985840,2824.367676,897.685303,0.000000,0.000000,84.360008);
CreateDynamicObject(2308,2147.148926,2826.155273,897.664490,0.000000,0.000000,180.000000);
CreateDynamicObject(2608,2151.502441,2825.207520,900.017090,0.000000,0.000000,270.000000);
CreateDynamicObject(2610,2150.957520,2822.521973,898.492676,0.000000,0.000000,180.000000);
CreateDynamicObject(1569,2150.162842,2822.090088,897.663391,0.000000,0.000000,180.000000);
CreateDynamicObject(1806,2146.428223,2826.411621,897.945313,0.000000,90.000000,149.459991);
CreateDynamicObject(2610,2151.448486,2822.518555,898.492676,0.000000,0.000000,180.000000);
CreateDynamicObject(2611,2151.686035,2827.310303,900.127686,0.000000,10.000000,270.000000);
CreateDynamicObject(2191,2147.097656,2828.068115,897.655396,0.000000,0.000000,270.000000);
CreateDynamicObject(2610,2145.188721,2824.971191,898.492676,0.000000,0.000000,180.000000);
CreateDynamicObject(2674,2144.973389,2827.847168,897.686523,0.000000,0.000000,-259.979919);
CreateDynamicObject(2607,2143.729980,2825.011230,898.056030,0.000000,0.000000,0.000000);
CreateDynamicObject(1806,2146.374756,2829.721191,897.673279,0.000000,0.000000,0.000000);
CreateDynamicObject(1806,2143.675781,2826.053955,897.673279,0.000000,0.000000,216.899994);
CreateDynamicObject(2605,2146.221436,2830.642822,898.064026,0.000000,0.000000,0.000000);
CreateDynamicObject(1806,2143.973877,2829.241699,897.673279,0.000000,0.000000,38.639999);
CreateDynamicObject(630,2145.311279,2830.673584,898.614807,0.000000,20.000000,0.000000);
CreateDynamicObject(2610,2142.218506,2824.975342,898.492676,0.000000,0.000000,180.000000);
CreateDynamicObject(1998,2142.695801,2829.495850,897.663879,0.000000,0.000000,0.000000);
CreateDynamicObject(2605,2140.715088,2825.060059,898.064026,0.000000,0.000000,180.000000);
CreateDynamicObject(1806,2140.718262,2826.057129,897.785278,90.000000,0.000000,155.880112);
CreateDynamicObject(2671,2139.023438,2826.955078,897.685303,0.000000,0.000000,50.040009);
CreateDynamicObject(630,2138.769043,2825.566406,897.782776,0.000000,90.000000,138.119995);
CreateDynamicObject(2676,2145.817871,2835.651367,897.777405,0.000000,0.000000,-30.120001);
CreateDynamicObject(2671,2140.000977,2832.733154,897.685303,0.000000,0.000000,-25.859980);
CreateDynamicObject(630,2137.311768,2822.482666,898.686829,0.000000,0.000000,0.000000);
CreateDynamicObject(1230,2136.743896,2827.859619,898.078430,0.000000,0.000000,-191.400055);
CreateDynamicObject(2261,2136.591309,2822.634277,900.176880,0.000000,10.000000,180.000000);
CreateDynamicObject(1558,2136.853271,2829.260010,898.248901,0.000000,0.000000,31.260000);
CreateDynamicObject(2161,2136.067383,2822.111084,897.651978,0.000000,0.000000,180.000000);
CreateDynamicObject(1558,2136.799072,2830.765137,898.248901,0.000000,0.000000,0.000000);
CreateDynamicObject(2674,2142.464600,2837.346436,897.686523,0.000000,0.000000,0.000000);
CreateDynamicObject(2674,2134.757324,2823.838379,897.686523,0.000000,0.000000,-113.219948);
CreateDynamicObject(1806,2143.876221,2838.771729,897.817322,90.000000,0.000000,43.260010);
CreateDynamicObject(2164,2134.685059,2822.118896,897.657288,0.000000,0.000000,180.000000);
CreateDynamicObject(1806,2141.500244,2838.086670,897.673279,0.000000,0.000000,-47.880001);
CreateDynamicObject(1806,2137.514160,2834.722900,897.961304,0.000000,90.000000,28.620001);
CreateDynamicObject(2604,2142.799072,2839.392334,898.455505,0.000000,0.000000,0.000000);
CreateDynamicObject(2671,2146.843262,2840.778564,897.685303,0.000000,0.000000,28.440029);
CreateDynamicObject(2605,2136.758301,2835.148926,898.064026,0.000000,0.000000,90.000000);
CreateDynamicObject(2674,2150.704102,2841.643066,897.686523,0.000000,0.000000,-184.079926);
CreateDynamicObject(2674,2137.304443,2836.917480,897.686523,0.000000,0.000000,-59.880001);
CreateDynamicObject(2610,2140.635986,2839.594238,898.492676,0.000000,0.000000,0.000000);
CreateDynamicObject(2610,2136.658936,2836.656738,898.492676,0.000000,0.000000,90.000000);
CreateDynamicObject(2610,2140.146484,2839.599121,898.492676,0.000000,0.000000,0.000000);
CreateDynamicObject(2610,2136.658936,2837.152588,898.492676,0.000000,0.000000,90.000000);
CreateDynamicObject(1230,2149.029053,2842.813965,898.078430,0.000000,0.000000,-353.220123);
CreateDynamicObject(1806,2137.690186,2838.633789,897.673279,0.000000,0.000000,116.760002);
CreateDynamicObject(2610,2149.954346,2842.873291,897.689819,0.000000,0.000000,0.000000);
CreateDynamicObject(2610,2150.448975,2842.873047,898.099976,0.000000,0.000000,0.000000);
CreateDynamicObject(2610,2150.941406,2842.869385,898.099976,0.000000,0.000000,0.000000);
CreateDynamicObject(2610,2151.429443,2842.869385,898.099976,0.000000,0.000000,0.000000);
CreateDynamicObject(2199,2138.666504,2839.807861,897.663879,0.000000,0.000000,0.000000);
CreateDynamicObject(2162,2150.343018,2843.250244,899.723572,0.000000,0.000000,0.000000);
CreateDynamicObject(2607,2136.711426,2838.603760,898.056030,0.000000,0.000000,270.000000);
CreateDynamicObject(2611,2139.562988,2843.191650,900.127686,0.000000,-10.000000,0.000000);
CreateDynamicObject(2676,2135.046631,2841.096924,897.777405,0.000000,0.000000,44.280010);
CreateDynamicObject(19572,2135.308105,2842.862305,899.473816,0.000000,360.000000,300.000000);
CreateDynamicObject(2191,2134.768555,2842.675781,897.655396,0.000000,0.000000,0.000000);
CreateDynamicObject(630,2133.905518,2842.845459,898.686829,0.000000,0.000000,51.180000);
CreateDynamicObject(14598,2147.518799,2799.572754,913.192017,0.000000,0.000000,0.000000);
CreateDynamicObject(2687,2103.273438,2622.587402,799.431824,0.000000,-15.000000,0.000000);
CreateDynamicObject(2674,2086.077148,2627.765869,798.034302,0.000000,0.000000,145.000000);
CreateDynamicObject(2169,2105.632324,2621.991211,798.003418,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.794678,2622.291504,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(2687,2098.049805,2622.580078,799.431824,0.000000,0.000000,0.000000);
CreateDynamicObject(1208,2100.194580,2622.291504,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2622.291504,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2622.291504,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2621.619385,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2621.619385,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2621.619385,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(2688,2106.140869,2619.709473,799.431824,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2621.619385,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2620.948486,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2620.948486,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(2169,2105.632324,2620.029785,798.003418,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.794678,2620.948486,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2620.948486,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2620.270020,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2620.270020,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(2674,2097.563477,2621.142090,798.034302,0.000000,0.000000,145.000000);
CreateDynamicObject(1208,2100.794678,2620.270020,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(2843,2104.017090,2619.495117,798.016418,0.000000,0.000000,25.000000);
CreateDynamicObject(1208,2100.194580,2620.270020,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2619.593994,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1722,2098.438721,2620.411621,798.335327,0.000000,90.000000,222.387177);
CreateDynamicObject(1208,2100.194580,2619.593994,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(2169,2095.903809,2621.029541,798.003418,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2619.593994,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2619.593994,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2618.919922,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2618.919922,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(2169,2105.632324,2618.066895,798.003418,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.794678,2618.919922,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2618.919922,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2618.244385,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2618.244385,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2618.244385,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2618.244385,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2617.570068,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(2674,2103.666504,2617.252930,798.034302,0.000000,0.000000,45.000000);
CreateDynamicObject(1208,2100.194580,2617.570068,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(2169,2095.903809,2619.066406,798.003418,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2617.570068,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(2688,2106.140869,2615.632324,799.431824,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2617.570068,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2616.901123,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2616.901123,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(2169,2105.632324,2616.102783,798.003418,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.794678,2616.901123,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2616.901123,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2616.223389,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2616.223389,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2616.223389,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2616.223389,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1722,2103.432373,2615.314697,798.335327,0.000000,90.000000,317.062439);
CreateDynamicObject(1208,2100.794678,2615.550049,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(2169,2095.903809,2617.104736,798.003418,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.194580,2615.550049,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2615.550049,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(2846,2098.732666,2615.915527,798.016418,0.000000,0.000000,15.000000);
CreateDynamicObject(1208,2100.194580,2615.550049,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1209,2100.489990,2614.923340,797.780579,0.000000,0.000000,0.000000);
CreateDynamicObject(2844,2101.524170,2614.359375,798.016418,0.000000,0.000000,15.000000);
CreateDynamicObject(2670,2103.311523,2613.380615,798.114197,0.000000,0.000000,0.000000);
CreateDynamicObject(2169,2095.903809,2615.142822,798.003418,0.000000,0.000000,90.000000);
CreateDynamicObject(14520,2096.522217,2614.805176,798.335571,0.000000,0.000000,150.000000);
CreateDynamicObject(1715,2105.536377,2612.786133,798.014893,0.000000,0.000000,-45.000000);
CreateDynamicObject(2684,2106.074463,2611.713623,799.431824,0.000000,0.000000,-90.000000);
CreateDynamicObject(1722,2099.939941,2613.629639,798.057007,90.000000,90.000000,239.291107);
CreateDynamicObject(1885,2095.587646,2614.226563,798.253418,90.000000,0.000000,46.483200);
CreateDynamicObject(2684,2106.074463,2611.273682,799.391785,0.000000,15.000000,-90.000000);
CreateDynamicObject(2684,2106.074463,2610.833740,799.431824,0.000000,0.000000,-90.000000);
CreateDynamicObject(1537,2095.268066,2613.251953,798.015930,0.000000,0.000000,90.000000);
CreateDynamicObject(2008,2103.777588,2611.089600,798.010071,0.000000,0.000000,90.000000);
CreateDynamicObject(1514,2102.765137,2610.816895,798.234802,0.000000,-90.000000,45.000000);
CreateDynamicObject(1537,2095.268066,2611.765625,798.015930,0.000000,0.000000,90.000000);
CreateDynamicObject(2673,2100.553467,2610.448730,798.094604,0.000000,0.000000,0.000000);
CreateDynamicObject(2688,2106.140869,2608.045166,799.431824,0.000000,0.000000,-90.000000);
CreateDynamicObject(2169,2105.632324,2608.651855,798.003418,0.000000,0.000000,-90.000000);
CreateDynamicObject(956,2100.492676,2609.391113,798.337585,0.000000,0.000000,180.000000);
CreateDynamicObject(1208,2100.794678,2608.639893,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2608.639893,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2608.639893,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(2670,2102.411377,2608.131348,798.114197,0.000000,0.000000,170.000000);
CreateDynamicObject(1208,2100.194580,2608.639893,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2607.969971,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1885,2095.872803,2609.507080,798.030396,0.000000,0.000000,0.000000);
CreateDynamicObject(1208,2100.194580,2607.969971,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2607.969971,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(2845,2103.775635,2607.243408,798.016418,0.000000,0.000000,15.000000);
CreateDynamicObject(1208,2100.194580,2607.969971,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2607.300049,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(2169,2105.632324,2606.691162,798.003418,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2607.300049,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2607.300049,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2607.300049,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2606.629883,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1722,2102.375488,2606.266602,798.690002,-135.000000,0.000000,70.000000);
CreateDynamicObject(1208,2100.194580,2606.629883,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(2674,2098.413086,2607.443115,798.034302,0.000000,0.000000,0.000000);
CreateDynamicObject(1208,2100.794678,2606.629883,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(2169,2095.930908,2607.673828,798.003418,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.194580,2606.629883,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1722,2097.890869,2606.979736,798.335327,0.000000,90.000000,120.000000);
CreateDynamicObject(1208,2100.794678,2605.959961,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2605.959961,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2605.959961,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(2688,2106.140869,2604.137207,799.431824,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2605.959961,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(2169,2105.632324,2604.729980,798.003418,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.794678,2605.290039,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2605.290039,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(2819,2102.250732,2605.229248,797.975586,0.000000,-3.000000,180.000000);
CreateDynamicObject(1208,2100.794678,2605.290039,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2605.290039,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2604.620117,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(2843,2099.795410,2605.228027,798.016418,0.000000,0.000000,125.000000);
CreateDynamicObject(1208,2100.194580,2604.620117,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2604.620117,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(2169,2095.930908,2605.709229,798.003418,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.194580,2604.620117,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2603.949951,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2603.949951,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2603.949951,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2603.949951,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(2169,2105.632324,2602.760986,798.003418,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.794678,2603.280029,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2603.280029,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(2844,2097.671387,2604.227051,798.016418,0.000000,0.000000,150.000000);
CreateDynamicObject(1208,2100.794678,2603.280029,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2603.280029,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2602.612305,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1722,2103.727051,2602.220703,798.335327,0.000000,90.000000,63.845371);
CreateDynamicObject(1208,2100.194580,2602.612305,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(2169,2095.930908,2603.746582,798.003418,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2602.612305,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2602.612305,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2601.940186,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(2687,2104.040527,2600.977295,799.431824,0.000000,0.000000,180.000000);
CreateDynamicObject(1722,2098.439941,2602.794678,798.057007,90.000000,90.000000,51.000000);
CreateDynamicObject(1208,2100.194580,2601.940186,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(2687,2102.598633,2600.977295,799.431824,0.000000,0.000000,180.000000);
CreateDynamicObject(1208,2100.794678,2601.940186,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2601.940186,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2601.262207,798.924011,0.000000,0.000000,-90.000000);
CreateDynamicObject(1208,2100.194580,2601.262207,798.924011,0.000000,0.000000,90.000000);
CreateDynamicObject(1208,2100.794678,2601.262207,798.014282,0.000000,0.000000,-90.000000);
CreateDynamicObject(2687,2098.825928,2600.977295,799.431824,0.000000,15.000000,180.000000);
CreateDynamicObject(1208,2100.194580,2601.262207,798.014282,0.000000,0.000000,90.000000);
CreateDynamicObject(2169,2095.930908,2601.784180,798.003418,0.000000,0.000000,90.000000);
CreateDynamicObject(14520,2099.567139,2596.617432,798.335571,0.000000,0.000000,305.074097);
CreateDynamicObject(3460,1770.061035,2713.850830,9.825600,2.141600,90.000000,-139.559998);
CreateDynamicObject(18451,1768.611572,2774.861572,10.332200,0.000000,0.000000,-61.200001);
CreateDynamicObject(1257,1762.432739,2700.395508,10.727700,0.000000,90.000000,-68.820000);
CreateDynamicObject(852,1747.957764,2725.168701,9.786400,0.000000,0.000000,0.000000);
CreateDynamicObject(901,1766.884155,2641.511475,7.657700,0.000000,20.000000,-130.980011);
CreateDynamicObject(3593,1776.723267,2618.345215,10.194800,0.000000,0.000000,-122.160004);
CreateDynamicObject(1441,1762.567627,2635.852051,10.427400,0.000000,0.000000,61.320000);
CreateDynamicObject(1950,2034.729980,2722.840088,10.130000,0.000000,360.000000,300.000000);
CreateDynamicObject(874,1731.317139,2715.083740,9.664920,0.000000,0.000000,50.639999);
CreateDynamicObject(874,1757.171631,2613.884521,9.665660,0.000000,0.000000,-95.879990);
CreateDynamicObject(854,1736.975464,2624.788574,10.030900,0.000000,0.000000,0.000000);
CreateDynamicObject(734,1754.562988,2587.856201,9.729400,-0.020000,0.000000,-101.219994);
CreateDynamicObject(1299,1735.079956,2626.746582,10.210700,0.000000,0.000000,-21.240000);
CreateDynamicObject(1357,1733.982788,2625.644043,10.092600,0.000000,0.000000,-43.619999);
CreateDynamicObject(1412,1710.516602,2720.566895,9.889400,90.858398,0.000000,-46.139999);
CreateDynamicObject(19576,1970.630005,2741.780029,9.930000,0.000000,360.000000,300.000000);
obj=CreateDynamicObject(2590,220.721329,1824.011230,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,220.679688,1824.012451,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,220.633163,1823.563965,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,220.515915,1822.723755,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.941010,1824.385010,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.940247,1824.385132,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.782333,1823.408325,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);
obj=CreateDynamicObject(2590,218.599030,1821.715088,6.810000,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj,0,10770,"carrier_sfse","ws_shipmetal4",-16711808);

CreateDynamicObject(3657,385.630005,2393.820068,1889.069946,0.000000,0.000000,269.970001);
CreateDynamicObject(3657,385.649994,2386.739990,1889.069946,0.000000,0.000000,269.970001);
CreateDynamicObject(3657,383.000000,2393.820068,1889.069946,0.000000,0.000000,269.970001);
CreateDynamicObject(3657,383.000000,2386.739990,1889.069946,0.000000,0.000000,269.970001);
CreateDynamicObject(19461,391.339996,2390.659912,1890.310059,0.000000,0.000000,0.000000);
CreateDynamicObject(3494,389.320007,2386.080078,1892.339966,0.000000,0.000000,0.000000);
CreateDynamicObject(14638,391.290009,2388.889893,1888.569946,0.000000,0.000000,0.000000);
CreateDynamicObject(14638,391.290009,2391.899902,1888.569946,0.000000,0.000000,180.000000);
CreateDynamicObject(3494,389.320007,2395.320068,1892.339966,0.000000,0.000000,0.000000);
CreateDynamicObject(19461,391.500000,2390.760010,1893.780029,0.000000,0.000000,0.000000);
CreateDynamicObject(3657,380.279999,2393.820068,1889.069946,0.000000,0.000000,269.970001);
CreateDynamicObject(19366,392.790009,2390.389893,1893.530029,0.000000,0.000000,90.000000);
CreateDynamicObject(3657,380.239990,2386.739990,1889.069946,0.000000,0.000000,269.970001);
CreateDynamicObject(19366,392.809998,2390.419922,1894.290039,0.000000,-90.000000,90.000000);
CreateDynamicObject(2869,380.760010,2395.429932,1888.469971,95.000000,0.000000,133.160004);
CreateDynamicObject(6959,379.959991,2389.500000,1895.540039,0.000000,0.000000,0.000000);
CreateDynamicObject(2208,390.359985,2383.590088,1888.579956,0.000000,0.000000,269.950012);
CreateDynamicObject(19461,391.480011,2383.840088,1890.310059,0.000000,0.000000,0.000000);
CreateDynamicObject(19461,391.429993,2397.389893,1890.310059,0.000000,0.000000,0.000000);
CreateDynamicObject(19461,391.480011,2383.840088,1893.790039,0.000000,0.000000,0.000000);
CreateDynamicObject(2284,390.850006,2398.139893,1890.329956,0.000000,0.000000,-90.000000);
CreateDynamicObject(2869,390.410004,2382.270020,1889.449951,0.000000,0.000000,45.639999);
CreateDynamicObject(2869,382.679993,2381.949951,1889.449951,0.000000,0.000000,338.059998);
CreateDynamicObject(19461,391.429993,2397.389893,1893.790039,0.000000,0.000000,0.000000);
CreateDynamicObject(1950,390.630005,2398.649902,1889.600098,0.000000,360.000000,300.000000);
CreateDynamicObject(2869,382.390015,2398.750000,1888.469971,95.000000,0.000000,348.850006);
CreateDynamicObject(2869,381.470001,2382.120117,1889.449951,0.000000,0.000000,138.990005);
CreateDynamicObject(3657,377.399994,2393.820068,1889.069946,0.000000,0.000000,269.970001);
CreateDynamicObject(1950,382.350006,2399.070068,1889.600098,0.000000,360.000000,300.000000);
CreateDynamicObject(2869,382.760010,2399.239990,1889.449951,0.000000,0.000000,295.809998);
CreateDynamicObject(2869,380.890015,2382.590088,1888.469971,95.000000,0.000000,206.649994);
CreateDynamicObject(3657,377.399994,2386.639893,1889.069946,0.000000,0.000000,269.970001);
CreateDynamicObject(2869,380.940002,2381.770020,1889.449951,0.000000,0.000000,304.450012);
CreateDynamicObject(2208,380.420013,2381.879883,1888.579956,0.000000,0.000000,0.000000);
CreateDynamicObject(2869,380.769989,2399.219971,1889.449951,0.000000,0.000000,350.109985);
CreateDynamicObject(2869,390.440002,2400.020020,1889.449951,0.000000,0.000000,68.860001);
CreateDynamicObject(2208,380.420013,2399.189941,1888.579956,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19461,386.619995,2379.050049,1890.310059,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj, 0,9931,"churchsfe","church_sfe1");
CreateDynamicObject(2869,380.519989,2399.810059,1888.469971,95.000000,0.000000,206.649994);
CreateDynamicObject(2208,390.359985,2400.629883,1888.579956,0.000000,0.000000,269.950012);
obj=CreateDynamicObject(19461,386.619995,2379.050049,1893.790039,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj, 0,9931,"churchsfe","church_sfe2");
obj=CreateDynamicObject(19461,386.619995,2402.250000,1890.310059,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj, 0,9931,"churchsfe","church_sfe1");
obj=CreateDynamicObject(19461,386.619995,2402.250000,1893.790039,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj, 0,9931,"churchsfe","church_sfe2");
CreateDynamicObject(3494,374.429993,2396.409912,1892.339966,0.000000,0.000000,0.000000);
CreateDynamicObject(3494,374.429993,2383.830078,1892.339966,0.000000,0.000000,0.000000);
CreateDynamicObject(14394,372.000000,2391.080078,1888.790039,0.000000,0.000000,179.440002);
obj=CreateDynamicObject(19461,377.000000,2379.050049,1890.310059,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj, 0,9931,"churchsfe","church_sfe1");
obj=CreateDynamicObject(19461,377.000000,2379.050049,1893.790039,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj, 0,9931,"churchsfe","church_sfe2");
obj=CreateDynamicObject(19461,377.000000,2402.250000,1890.310059,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj, 0,9931,"churchsfe","church_sfe1");
obj=CreateDynamicObject(19461,377.000000,2402.229980,1893.790039,0.000000,0.000000,90.000000);
SetDynamicObjectMaterial(obj, 0,9931,"churchsfe","church_sfe2");
CreateDynamicObject(14394,371.920013,2383.100098,1888.790039,0.000000,0.000000,179.440002);
CreateDynamicObject(14394,372.079987,2399.070068,1888.790039,0.000000,0.000000,179.440002);
CreateDynamicObject(2894,368.820007,2390.229980,1890.469971,0.000000,0.000000,269.399994);
CreateDynamicObject(2868,368.809998,2391.409912,1890.469971,0.000000,0.000000,0.000000);
CreateDynamicObject(2868,368.809998,2388.969971,1890.469971,0.000000,0.000000,0.000000);
CreateDynamicObject(18693,368.829987,2391.399902,1889.430054,0.000000,0.000000,0.000000);
CreateDynamicObject(2208,368.809998,2391.500000,1889.599976,0.000000,0.000000,269.950012);
CreateDynamicObject(18693,368.829987,2388.969971,1889.430054,0.000000,0.000000,0.000000);
CreateDynamicObject(3462,368.559998,2384.330078,1891.069946,0.000000,0.000000,223.899994);
CreateDynamicObject(3462,368.559998,2396.820068,1891.069946,0.000000,0.000000,-223.899994);
CreateDynamicObject(19461,368.760010,2382.439941,1890.310059,0.000000,0.000000,45.000000);
CreateDynamicObject(19461,368.760010,2382.439941,1893.790039,0.000000,0.000000,45.000000);
CreateDynamicObject(19461,368.760010,2398.850098,1890.310059,0.000000,0.000000,-45.000000);
CreateDynamicObject(19461,368.760010,2398.850098,1893.790039,0.000000,0.000000,-45.000000);
CreateDynamicObject(19461,365.440002,2390.620117,1890.310059,0.000000,0.000000,0.000000);
CreateDynamicObject(6959,350.410004,2389.239990,1889.630005,0.000000,0.000000,0.000000);
CreateDynamicObject(11712,-794.719971,1555.609985,28.010000,0.000000,0.000000,0.000000);
CreateDynamicObject(11712,-794.719971,1558.449951,28.010000,0.000000,0.000000,0.000000);
CreateDynamicObject(8131,-793.099976,1557.079956,24.889999,0.000000,0.000000,90.000000);
CreateDynamicObject(11712,-794.710022,1557.050049,32.419998,0.000000,0.000000,0.000000);
CreateDynamicObject(874,-793.559998,1570.079956,25.430000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,-810.049988,1567.040039,25.889999,0.000000,0.000000,0.000000);
CreateDynamicObject(365,-789.270020,1575.680054,26.459999,0.000000,360.000000,300.000000);
CreateDynamicObject(3593,-789.580017,1575.939941,26.320000,0.060000,0.000000,334.260010);
CreateDynamicObject(773,-771.690002,1547.260010,25.690001,0.000000,0.000000,11.300000);
CreateDynamicObject(3275,-790.729980,1583.989990,26.559999,0.000000,0.000000,0.000000);
CreateDynamicObject(874,-768.869995,1569.910034,25.980000,0.000000,0.000000,0.000000);
CreateDynamicObject(1440,-797.890015,1588.170044,26.590000,0.000000,0.000000,342.839996);
CreateDynamicObject(1440,-795.150024,1589.650024,26.590000,0.000000,0.000000,91.970001);
CreateDynamicObject(16404,-789.650024,1589.560059,27.280001,0.000000,0.000000,84.029999);
CreateDynamicObject(3275,-801.859985,1595.689941,26.459999,0.000000,0.000000,272.820007);
CreateDynamicObject(874,-772.020020,1518.880005,25.129999,0.000000,0.000000,322.309998);
CreateDynamicObject(11443,-774.650024,1515.489990,24.510000,-19.200001,-6.180000,241.330002);
CreateDynamicObject(874,-845.299988,1545.619995,21.870001,0.000000,0.000000,0.000000);
CreateDynamicObject(874,-840.659973,1582.119995,24.480000,0.000000,0.000000,0.000000);
CreateDynamicObject(649,-853.150024,1550.760010,22.430000,356.859985,0.000000,3.140000);
CreateDynamicObject(874,-853.919983,1555.000000,22.379999,0.000000,0.000000,0.000000);
CreateDynamicObject(1265,-837.450012,1513.290039,19.680000,-0.040000,0.000000,354.470001);
CreateDynamicObject(1338,-853.190002,1537.229980,22.250000,0.180000,-4.380000,51.330002);
CreateDynamicObject(1338,-852.729980,1535.420044,21.870001,-89.339996,-61.799999,51.330002);
CreateDynamicObject(874,-841.809998,1593.530029,25.400000,0.000000,0.000000,0.000000);
CreateDynamicObject(1440,-836.929993,1511.530029,19.690001,0.780000,-4.500000,0.000000);
CreateDynamicObject(1265,-836.109985,1509.709961,19.590000,0.000000,0.000000,0.000000);
CreateDynamicObject(1441,-834.840027,1508.040039,19.690001,5.340000,6.240000,271.390015);
CreateDynamicObject(1265,-837.789978,1509.689941,19.450001,0.000000,0.000000,33.610001);
CreateDynamicObject(1265,-836.989990,1508.959961,19.430000,0.000000,0.000000,33.610001);
CreateDynamicObject(1265,-836.049988,1506.880005,19.330000,-0.060000,0.000000,33.610001);
CreateDynamicObject(874,-778.799988,1495.709961,21.950001,0.000000,0.000000,322.309998);
CreateDynamicObject(874,-809.690002,1492.859985,18.639999,0.000000,0.000000,0.000000);
obj=CreateDynamicObject(19993,-769.256714,1611.948242,29.204700,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj, 0,1453,"break_farm","CJ_HAY");
CreateDynamicObject(874,-861.729980,1554.869995,22.170000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,-767.320007,1494.689941,22.830000,0.000000,0.000000,281.679993);
CreateDynamicObject(13591,-864.940002,1565.239990,24.129999,1.680000,-4.620000,96.989998);
CreateDynamicObject(1340,-800.530029,1626.839966,26.820000,2.880000,-23.580000,113.320000);
CreateDynamicObject(926,-858.270020,1514.900024,21.830000,-0.020000,0.000000,342.950012);
CreateDynamicObject(874,-839.169983,1615.390015,26.370001,0.000000,0.000000,0.000000);
CreateDynamicObject(1431,-859.849976,1515.329956,22.100000,0.020000,0.000000,0.000000);
CreateDynamicObject(926,-861.380005,1515.099976,21.850000,0.000000,0.000000,342.950012);
CreateDynamicObject(12957,-839.229980,1492.439941,17.840000,2.040000,-8.340000,37.220001);
CreateDynamicObject(874,-851.690002,1502.300049,18.110001,0.000000,0.000000,0.000000);
CreateDynamicObject(874,-852.940002,1608.000000,25.860001,0.000000,0.000000,0.000000);
CreateDynamicObject(874,-861.460022,1508.930054,20.530001,0.000000,0.000000,0.000000);
CreateDynamicObject(11435,-863.700012,1611.550049,30.260000,3.620000,18.299999,2.710000);
CreateDynamicObject(735,-880.190002,1610.400024,24.010000,0.000000,0.000000,206.070007);
CreateDynamicObject(1440,-901.590027,1549.500000,25.350000,0.000000,0.000000,311.809998);
CreateDynamicObject(874,-846.369995,1462.300049,14.340000,0.000000,0.000000,359.899994);
CreateDynamicObject(3171,-905.099976,1555.959961,26.030001,-1.780000,-91.620003,1.310000);
obj=CreateDynamicObject(19993,-903.513977,1529.669678,27.776501,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj, 0,1453,"break_farm","CJ_HAY");
CreateDynamicObject(874,-815.359985,1442.250000,13.040000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,-797.510010,1438.949951,12.730000,0.000000,0.000000,240.399994);
CreateDynamicObject(874,-781.619995,1438.979980,12.630000,0.000000,0.000000,291.559998);
CreateDynamicObject(1224,-841.780029,1446.050049,14.230000,0.000000,0.000000,287.559998);
CreateDynamicObject(1468,-838.489990,1441.439941,13.270000,-79.559998,-144.479996,337.320007);
CreateDynamicObject(874,-808.179993,1432.650024,12.600000,0.000000,0.000000,0.000000);
CreateDynamicObject(1224,-840.690002,1439.770020,13.630000,0.000000,0.000000,0.000000);
CreateDynamicObject(1357,-844.390015,1435.670044,13.140000,0.000000,0.000000,70.010002);
CreateDynamicObject(1357,-845.510010,1435.199951,13.120000,0.000000,0.000000,260.869995);
CreateDynamicObject(874,-824.130005,1426.890015,12.600000,0.000000,0.000000,0.000000);
CreateDynamicObject(1441,-833.969971,1429.119995,13.530000,0.000000,0.000000,262.149994);
CreateDynamicObject(790,-912.739746,1490.419922,25.557791,0.000000,0.000000,0.000000);
CreateDynamicObject(1224,-836.640015,1427.829956,13.470000,0.000000,0.000000,0.000000);
CreateDynamicObject(1468,-837.460022,1424.750000,13.030000,-87.059998,-145.080002,0.000000);
obj=CreateDynamicObject(19993,-896.056091,1664.939209,35.751701,0.000000,0.000000,0.000000);
SetDynamicObjectMaterial(obj, 0,1453,"break_farm","CJ_HAY");
CreateDynamicObject(874,-831.909973,1411.189941,12.320000,0.000000,0.000000,359.279999);
CreateDynamicObject(771,-820.068115,1404.496216,11.268700,0.000000,0.000000,0.000000);
CreateDynamicObject(3569,-842.856873,1408.866211,14.881000,-1.000000,0.000000,-156.719894);
CreateDynamicObject(735,-929.270020,1472.569946,30.240000,0.000000,0.000000,232.300003);
CreateDynamicObject(735,-854.080017,1702.839966,22.020000,0.000000,0.000000,189.029999);
CreateDynamicObject(735,-721.340027,1415.900024,13.270000,0.000000,0.000000,230.419998);
CreateDynamicObject(926,-838.738525,1400.162109,12.854000,0.000000,0.000000,0.000000);
CreateDynamicObject(2671,-839.822632,1400.142456,12.622000,0.000000,0.000000,37.199989);
CreateDynamicObject(928,-837.819580,1398.827393,12.854000,0.000000,0.000000,0.000000);
CreateDynamicObject(1219,-835.139893,1397.955688,12.663500,0.000000,0.000000,0.000000);
CreateDynamicObject(1230,-838.879028,1398.338989,13.009300,0.000000,0.000000,0.000000);
CreateDynamicObject(2671,-838.491272,1397.623901,12.622000,0.000000,0.000000,0.000000);
CreateDynamicObject(1356,-836.440002,1396.069702,12.735300,0.000000,0.000000,0.000000);
CreateDynamicObject(735,-873.960022,1410.589966,9.440000,0.000000,0.000000,202.630005);
CreateDynamicObject(3594,-819.800903,1368.717651,13.011800,0.000000,0.000000,78.239998);
CreateDynamicObject(3594,-797.015503,1368.887085,-10.040260,0.000000,0.000000,0.000000);
CreateDynamicObject(3593,-799.607788,1365.547852,-8.898500,0.000000,30.000000,0.000000);
CreateDynamicObject(735,-994.109985,1522.630005,39.939999,0.000000,0.000000,264.809998);
CreateDynamicObject(3594,-801.270203,1351.939209,13.726700,-15.000000,0.000000,149.220001);
CreateDynamicObject(3593,-807.698425,1347.948975,13.019400,0.000000,0.000000,-96.720001);
CreateDynamicObject(874,-805.384521,1346.513428,12.406600,0.000000,0.000000,0.000000);
CreateDynamicObject(3594,-802.726746,1343.349731,13.080300,0.000000,0.000000,-130.260101);
CreateDynamicObject(11443,-914.219971,1736.109985,34.730000,21.059999,-30.240000,0.000000);
CreateDynamicObject(874,-742.210022,1320.930054,11.810000,0.000000,0.000000,318.869995);
CreateDynamicObject(874,-765.679993,1315.459961,12.600000,0.000000,0.000000,318.869995);
CreateDynamicObject(773,-925.400024,1763.540039,49.130001,0.000000,0.000000,11.300000);
CreateDynamicObject(773,-1044.780029,1579.020020,33.029999,0.000000,0.000000,327.829987);
CreateDynamicObject(874,-697.469971,1327.290039,8.520000,0.000000,0.000000,318.869995);
CreateDynamicObject(3594,-983.690002,1724.189941,30.370001,0.000000,0.000000,285.059998);
CreateDynamicObject(874,-768.599976,1303.880005,12.300000,0.000000,0.000000,318.869995);
CreateDynamicObject(874,-693.969971,1319.459961,8.630000,0.000000,0.000000,318.869995);
CreateDynamicObject(874,-686.650024,1321.160034,8.110000,0.000000,0.000000,318.869995);
CreateDynamicObject(874,-890.409973,1795.349976,60.400002,0.000000,0.000000,303.369995);
CreateDynamicObject(1327,-1003.630005,1718.079956,30.770000,70.260002,-62.580002,0.000000);
CreateDynamicObject(874,-881.570007,1802.209961,60.400002,0.000000,0.000000,8.000000);
CreateDynamicObject(735,-974.320007,1359.119995,34.610001,0.000000,0.000000,264.809998);
CreateDynamicObject(3593,-999.530029,1727.699951,30.389999,0.000000,0.000000,32.750000);
CreateDynamicObject(874,-928.289978,1323.199951,38.459999,0.000000,0.000000,208.419998);
CreateDynamicObject(735,-669.936279,1321.720581,2.063320,0.000000,0.000000,354.195374);
CreateDynamicObject(3593,-760.119995,1288.760010,13.320000,0.000000,0.000000,0.000000);
CreateDynamicObject(735,-1034.300049,1683.719971,20.410000,0.000000,0.000000,189.029999);
CreateDynamicObject(1327,-1012.390015,1723.189941,29.969999,0.000000,90.000000,0.000000);
CreateDynamicObject(773,-1067.560059,1512.140015,32.209999,0.000000,0.000000,0.000000);
CreateDynamicObject(874,-725.369995,1291.469971,9.810000,0.000000,0.000000,318.869995);
CreateDynamicObject(3363,-1066.859985,1500.719971,32.240002,18.000000,2.700000,280.079987);
CreateDynamicObject(1327,-1019.039978,1718.609985,30.770000,-9.000000,-104.339996,0.000000);
CreateDynamicObject(1327,-1021.280029,1719.109985,30.770000,-4.200000,-145.320007,0.000000);
CreateDynamicObject(874,-705.869995,1292.770020,8.980000,0.000000,0.000000,318.869995);
CreateDynamicObject(874,-687.020020,1299.989990,8.280000,0.000000,0.000000,0.000000);
CreateDynamicObject(735,-1053.839966,1443.229980,31.830000,0.000000,0.000000,264.809998);
CreateDynamicObject(874,-931.909973,1797.989990,60.599998,0.000000,0.000000,303.369995);
CreateDynamicObject(1327,-1024.130005,1719.079956,30.770000,-27.360001,-80.400002,0.000000);
CreateDynamicObject(874,-853.849976,1828.839966,60.099998,0.000000,0.000000,8.000000);
CreateDynamicObject(874,-691.929993,1291.900024,8.170000,0.000000,0.000000,318.869995);
CreateDynamicObject(3594,-1022.000000,1728.660034,30.549999,0.000000,0.000000,285.059998);
CreateDynamicObject(1646,-700.030029,1288.050049,9.320000,-6.540000,8.460000,259.029999);
CreateDynamicObject(1645,-702.450012,1286.729980,9.400000,0.000000,0.000000,28.610001);
CreateDynamicObject(1646,-706.750000,1284.410034,9.480000,-1.020000,0.300000,259.029999);
CreateDynamicObject(735,-837.809998,1837.310059,57.730000,0.000000,0.000000,196.690002);
CreateDynamicObject(1645,-699.659973,1285.050049,9.220000,0.000000,0.000000,199.350006);
CreateDynamicObject(1645,-702.039978,1283.780029,9.400000,0.000000,90.000000,342.690002);
CreateDynamicObject(1327,-1026.550049,1731.410034,30.030001,0.000000,90.000000,0.000000);
CreateDynamicObject(3593,-1031.849976,1726.670044,30.430000,0.000000,0.000000,149.199997);
CreateDynamicObject(874,-852.219971,1838.760010,60.099998,0.000000,0.000000,8.000000);
CreateDynamicObject(874,-846.419983,1841.349976,60.099998,0.000000,0.000000,8.000000);
CreateDynamicObject(1646,-683.650024,1282.420044,8.430000,0.000000,0.000000,50.439999);
CreateDynamicObject(874,-694.140015,1278.219971,7.920000,0.000000,0.000000,0.000000);
CreateDynamicObject(819,-679.169983,1284.260010,6.410000,0.000000,0.000000,0.000000);
CreateDynamicObject(874,-944.599976,1297.670044,38.580002,0.000000,0.000000,208.419998);
CreateDynamicObject(3364,-1022.960022,1361.900024,34.459999,11.520000,0.360000,303.160004);
CreateDynamicObject(3593,-1039.430054,1726.800049,30.469999,0.000000,0.000000,89.599998);
CreateDynamicObject(1645,-683.849976,1280.270020,8.420000,0.000000,0.000000,82.889999);
CreateDynamicObject(1598,-687.289978,1277.640015,8.480000,0.000000,0.000000,0.000000);
CreateDynamicObject(1645,-683.760010,1278.729980,8.460000,1.860000,92.459999,45.200001);
CreateDynamicObject(2034,-799.179993,1587.969971,26.330000,0.000000,360.000000,300.000000);
CreateDynamicObject(11748,-794.090027,1589.170044,26.330000,0.000000,360.000000,300.000000);
CreateDynamicObject(874,-862.169983,1893.020020,60.139999,0.000000,0.000000,8.000000);
CreateDynamicObject(1461,-671.059998,1281.719971,7.940000,1.740000,-32.099998,288.989990);
CreateDynamicObject(1646,-681.969971,1274.670044,8.110000,0.000000,0.000000,326.609985);
CreateDynamicObject(1645,-685.859985,1273.319946,8.320000,0.000000,0.000000,103.070000);
CreateDynamicObject(874,-658.229980,1282.209961,4.870000,0.000000,0.000000,0.000000);
CreateDynamicObject(1645,-688.260010,1269.319946,8.590000,0.000000,0.000000,40.779999);
CreateDynamicObject(1598,-677.650024,1271.410034,7.880000,0.000000,0.000000,0.000000);
CreateDynamicObject(1810,-679.190002,1269.359985,7.850000,0.000000,0.000000,49.959999);
CreateDynamicObject(1810,-677.609985,1269.770020,7.740000,0.480000,90.000000,48.669998);
CreateDynamicObject(2763,-678.770020,1268.270020,8.270000,0.000000,0.000000,351.279999);
CreateDynamicObject(1810,-679.830017,1267.250000,7.980000,0.480000,90.000000,304.850006);
CreateDynamicObject(1810,-683.390015,1265.550049,8.170000,0.480000,90.000000,275.640015);
CreateDynamicObject(1810,-676.320007,1268.010010,7.710000,0.000000,0.000000,304.850006);


///////////////////////////////////////////////// DRAW_BLACK_SCREEN - черный текстдрав на весь экран
	TextDrawCreate(-1.0,-1.0,"LD_BUM:blkdot");
	TextDrawFont(DRAW_BLACK_SCREEN,4);
	TextDrawTextSize(DRAW_BLACK_SCREEN,641.0,450.0);
	TextDrawColor(DRAW_BLACK_SCREEN,0x000000FF);
///////////////////////////////////////////////// DRAW_BLACK_SCREEN

	TextDrawCreate(29.6000, 322.3001, "Box"); // черный прозрачный бокс  под картой
	TextDrawLetterSize(DRAW_BOX_KPK, 0.0000, 13.3000);
	TextDrawTextSize(DRAW_BOX_KPK, 143.0000, 0.0000);
	TextDrawAlignment(DRAW_BOX_KPK, 1);
	TextDrawColor(DRAW_BOX_KPK, -1);
	TextDrawUseBox(DRAW_BOX_KPK, 1);
	TextDrawBoxColor(DRAW_BOX_KPK, 0x00000037);
//	TextDrawBackgroundColor(DRAW_BOX_KPK, 0x00000037);
	TextDrawFont(DRAW_BOX_KPK, 1);
	TextDrawSetProportional(DRAW_BOX_KPK, 1);
	TextDrawSetShadow(DRAW_BOX_KPK, 0);

	TextDrawCreate(73.0000, 324.0000,"00:00");//73.0000, 324.0000, "17:22"); // часы
	TextDrawLetterSize(DRAW_GLOBAL_TIME,0.3000,1.3000);// 0.2894, 1.4400);
	TextDrawAlignment(DRAW_GLOBAL_TIME, 1);
	TextDrawColor(DRAW_GLOBAL_TIME, 1251016959);
	TextDrawSetOutline(DRAW_GLOBAL_TIME, 2);
	TextDrawBackgroundColor(DRAW_GLOBAL_TIME, 255);
	TextDrawFont(DRAW_GLOBAL_TIME, 3);
	TextDrawSetProportional(DRAW_GLOBAL_TIME, 1);
	TextDrawSetShadow(DRAW_GLOBAL_TIME, 0);

	TextDrawCreate(500.000000, 5.000000, "GTA SAMP SEKTOR 2"); // ?????
	TextDrawLetterSize(DRAW_GTA_SAMP_logotype, 0.360000, 1.100000);
	TextDrawAlignment(DRAW_GTA_SAMP_logotype, 1);
	TextDrawColor(DRAW_GTA_SAMP_logotype, 0xFD5402AA);
	TextDrawSetOutline(DRAW_GTA_SAMP_logotype, 1);
	TextDrawBackgroundColor(DRAW_GTA_SAMP_logotype, 255);
	TextDrawFont(DRAW_GTA_SAMP_logotype, 3);
	TextDrawSetProportional(DRAW_GTA_SAMP_logotype, 1);
	TextDrawSetShadow(DRAW_GTA_SAMP_logotype, 2);

	//////////////////////////////////////////////////////////////////////////////////////////

	TextDrawCreate(183.750000, 185.851807, "Box");  //основное желтое меню инвентаря
	TextDrawLetterSize(INV_YELLOY_MENU, 0.000000, 24.975000);
	TextDrawTextSize(INV_YELLOY_MENU, 391.000000, 0.000000);
	TextDrawAlignment(INV_YELLOY_MENU, 1);
	TextDrawColor(INV_YELLOY_MENU, -1);
	TextDrawUseBox(INV_YELLOY_MENU, 1);
	TextDrawBoxColor(INV_YELLOY_MENU, 0x9B9759BA);
	TextDrawBackgroundColor(INV_YELLOY_MENU, 0x000000A3);
	TextDrawFont(INV_YELLOY_MENU, 1);
	TextDrawSetProportional(INV_YELLOY_MENU, 1);
	TextDrawSetShadow(INV_YELLOY_MENU, 0);

	TextDrawCreate(181.500000, 410.855591, "Box"); // 1 полоска  инвентаря
	TextDrawLetterSize(INV_BLACK_A, 0.000000, 0.224900);
	TextDrawTextSize(INV_BLACK_A, 460.000000 ,0.000000);
	TextDrawAlignment(INV_BLACK_A, 1);
	TextDrawColor(INV_BLACK_A, -1);
	TextDrawUseBox(INV_BLACK_A, 1);
	TextDrawBoxColor(INV_BLACK_A, 0x000000FF);
	TextDrawBackgroundColor(INV_BLACK_A, 0x000000FF);
	TextDrawFont(INV_BLACK_A, 1);
	TextDrawSetProportional(INV_BLACK_A, 1);
	TextDrawSetShadow(INV_BLACK_A, 0);

	TextDrawCreate(181.500000, 182.241592, "Box"); // 2 полоска  инвентаря
	TextDrawLetterSize(INV_BLACK_B, 0.000000, 0.224900);
	TextDrawTextSize(INV_BLACK_B, 460.000000 ,0.000000);
	TextDrawAlignment(INV_BLACK_B, 1);
	TextDrawColor(INV_BLACK_B, -1);
	TextDrawUseBox(INV_BLACK_B, 1);
	TextDrawBoxColor(INV_BLACK_B, 0x000000FF);
	TextDrawBackgroundColor(INV_BLACK_B, 0x000000FF);
	TextDrawFont(INV_BLACK_B, 1);
	TextDrawSetProportional(INV_BLACK_B, 1);
	TextDrawSetShadow(INV_BLACK_B, 0);

	TextDrawCreate(181.500000, 182.241592, "Box");  //3 полоска  инвентаря
	TextDrawLetterSize(INV_BLACK_C, 0.000000, 25.624901);
	TextDrawTextSize(INV_BLACK_C, 183.370300, 0.000000);
	TextDrawAlignment(INV_BLACK_C, 1);
	TextDrawColor(INV_BLACK_C, -1);
	TextDrawUseBox(INV_BLACK_C, 1);
	TextDrawBoxColor(INV_BLACK_C, 0x000000FF);
	TextDrawBackgroundColor(INV_BLACK_C, 0x000000FF);
	TextDrawFont(INV_BLACK_C, 1);
	TextDrawSetProportional(INV_BLACK_C, 1);
	TextDrawSetShadow(INV_BLACK_C, 0);

	TextDrawCreate(392.112793 ,182.241592, "Box"); // 4 полоска  инвентаря
	TextDrawLetterSize(INV_BLACK_D, 0.000000, 25.624901);
	TextDrawTextSize(INV_BLACK_D, 393.983093 ,0.000000);
	TextDrawAlignment(INV_BLACK_D, 1);
	TextDrawColor(INV_BLACK_D, -1);
	TextDrawUseBox(INV_BLACK_D, 1);
	TextDrawBoxColor(INV_BLACK_D, 0x000000FF);
	TextDrawBackgroundColor(INV_BLACK_D, 0x000000FF);
	TextDrawFont(INV_BLACK_D, 1);
	TextDrawSetProportional(INV_BLACK_D, 1);
	TextDrawSetShadow(INV_BLACK_D, 0);

	TextDrawCreate(458.216797, 182.241592, "Box"); // 5 полоска  инвентаря
	TextDrawLetterSize(INV_BLACK_E, 0.000000, 25.624901 );
	TextDrawTextSize(INV_BLACK_E, 460.087189 ,0.000000);
	TextDrawAlignment(INV_BLACK_E, 1);
	TextDrawColor(INV_BLACK_E, -1);
	TextDrawUseBox(INV_BLACK_E, 1);
	TextDrawBoxColor(INV_BLACK_E, 0x000000FF);
	TextDrawBackgroundColor(INV_BLACK_E, 0x000000FF);
	TextDrawFont(INV_BLACK_E, 1);
	TextDrawSetProportional(INV_BLACK_E, 1);
	TextDrawSetShadow(INV_BLACK_E, 0);

	TextDrawCreate(392.112793, 209.619400, "Box");  //6 полоска  инвентаря
	TextDrawLetterSize(INV_BLACK_F, 0.000000, 0.249900);
	TextDrawTextSize(INV_BLACK_F, 457.000000, 0.000000);
	TextDrawAlignment(INV_BLACK_F, 1);
	TextDrawColor(INV_BLACK_F, -1);
	TextDrawUseBox(INV_BLACK_F, 1);
	TextDrawBoxColor(INV_BLACK_F, 0x000000FF);
	TextDrawBackgroundColor(INV_BLACK_F, 0x000000FF);
	TextDrawFont(INV_BLACK_F, 1);
	TextDrawSetProportional(INV_BLACK_F, 1);
	TextDrawSetShadow(INV_BLACK_F, 0);

	TextDrawCreate(395.162811, 256.571686, "Box");  //7 полоска  инвентаря
	TextDrawLetterSize(INV_BLACK_G, 0.000000, 0.249900);
	TextDrawTextSize(INV_BLACK_G, 458.000000, 0.000000);
	TextDrawAlignment(INV_BLACK_G, 1);
	TextDrawColor(INV_BLACK_G, -1);
	TextDrawUseBox(INV_BLACK_G, 1);
	TextDrawBoxColor(INV_BLACK_G, 0x000000FF);
	TextDrawBackgroundColor(INV_BLACK_G, 0x000000FF);
	TextDrawFont(INV_BLACK_G, 1);
	TextDrawSetProportional(INV_BLACK_G, 1);
	TextDrawSetShadow(INV_BLACK_G, 0);

	TextDrawCreate(393.750000, 187.096298, "Box");  //левое прозрачное (черного цвета) часть инвентаря
	TextDrawLetterSize(INV_POLY_BLACK_RIGHT_PANEL, 0.000000, 24.699900);
	TextDrawTextSize(INV_POLY_BLACK_RIGHT_PANEL, 459.000000, 0.000000);
	TextDrawAlignment(INV_POLY_BLACK_RIGHT_PANEL, 1);
	TextDrawColor(INV_POLY_BLACK_RIGHT_PANEL, -1);
	TextDrawUseBox(INV_POLY_BLACK_RIGHT_PANEL, 1);
	TextDrawBoxColor(INV_POLY_BLACK_RIGHT_PANEL, 0x0000003F);
//	TextDrawBackgroundColor(INV_POLY_BLACK_RIGHT_PANEL, 0x000000FF);
	TextDrawFont(INV_POLY_BLACK_RIGHT_PANEL, 1);
	TextDrawSetProportional(INV_POLY_BLACK_RIGHT_PANEL, 1);
	TextDrawSetShadow(INV_POLY_BLACK_RIGHT_PANEL, 0);

	TextDrawCreate(440.950012,190.244400, "LD_BEAT:cross");  //крестик инвенторя
	TextDrawLetterSize(INV_CROSS, 0.000000, 1.300000);
	TextDrawTextSize(INV_CROSS, 14.700000, 14.000000);
	TextDrawColor(INV_CROSS, 0xE1E1E1FF);
	TextDrawBoxColor(INV_CROSS, 0x80808080);
//	TextDrawBackgroundColor(INV_POLY_BLACK_RIGHT_PANEL, 0x000000FF);
	TextDrawFont(INV_CROSS, 4);
	TextDrawSetSelectable(INV_CROSS, true);
//	TextDrawSetProportional(INV_CROSS, 1);
//	TextDrawSetShadow(INV_CROSS, 0);

	TextDrawCreate(431.951904, 219.0/*267.818298*/, " ");  // доллар в инвентаре
	TextDrawLetterSize(INV_TORG, 0.000000, 0.0);//по сути ничего не меняет но так было в хуке
	TextDrawTextSize(INV_TORG, 20.000000, 31.000000);
	TextDrawFont(INV_TORG, 5);
	TextDrawColor(INV_TORG, -1);
	TextDrawBackgroundColor(INV_TORG, 0x000000F1);
	TextDrawSetPreviewModel(INV_TORG, 1274);
	TextDrawSetPreviewRot(INV_TORG, 180.0, 180.0,0.0, 1.020300);
	TextDrawSetSelectable(INV_TORG, true);

/*	TextDrawCreate(430.148712, 214.661499, " ");  // синяя рубашка в инвентаре
	TextDrawLetterSize(INV_BLUE_CLOTH, 0.000000, 0.0);//по сути ничего не меняет но так было в хуке
	TextDrawTextSize(INV_BLUE_CLOTH, 20.000000, 31.000000);
	TextDrawFont(INV_BLUE_CLOTH, 5);
	TextDrawColor(INV_BLUE_CLOTH, -1);
	TextDrawBackgroundColor(INV_BLUE_CLOTH, 0);
	TextDrawSetPreviewModel(INV_BLUE_CLOTH, 1275);
	TextDrawSetPreviewRot(INV_BLUE_CLOTH, 0.0, 0.0,0.0, 0.981200);

	TextDrawCreate(401.148193,219.151901, " ");  // череп в инвентаре
	TextDrawLetterSize(INV_SKULL, 0.000000, 0.0);//по сути ничего не меняет но так было в хуке
	TextDrawTextSize(INV_SKULL, 16.000000, 16.000000);
	TextDrawFont(INV_SKULL, 5);
	TextDrawColor(INV_SKULL, -1);
	TextDrawBackgroundColor(INV_SKULL, 0);
	TextDrawSetPreviewModel(INV_SKULL, 1254);
	TextDrawSetPreviewRot(INV_SKULL, 0.0, 0.0,0.0, 0.981200);*/

    TextDrawCreate(382.449890, 316.777710, " ");  // рюкзак справа в инвентаре
	TextDrawLetterSize(INV_RIGHT_PACK, 0.0, 0.0);//по сути ничего не меняет но так было в хуке
	TextDrawTextSize(INV_RIGHT_PACK, 87.000000, 102.000000);
	TextDrawFont(INV_RIGHT_PACK, 5);
	TextDrawColor(INV_RIGHT_PACK, -1);
	TextDrawBackgroundColor(INV_RIGHT_PACK, 0);
	TextDrawSetPreviewModel(INV_RIGHT_PACK, 371);


	TextDrawCreate(399.949890, 219.0/*263.620911267.818298*/, " ");  // кпк (в виде ноутбука) справа в инвентаре
	TextDrawLetterSize(INV_KPK_MODEL_LAPTOP, 0.0, 0.0);//по сути ничего не меняет но так было в хуке
	TextDrawTextSize(INV_KPK_MODEL_LAPTOP, 20.000000, 31.000000);
	TextDrawFont(INV_KPK_MODEL_LAPTOP, 5);
	TextDrawColor(INV_KPK_MODEL_LAPTOP, -1);
	TextDrawSetSelectable(INV_KPK_MODEL_LAPTOP, true);
	TextDrawBackgroundColor(INV_KPK_MODEL_LAPTOP, 0x000000F1);
	TextDrawSetPreviewModel(INV_KPK_MODEL_LAPTOP, 19893);
	TextDrawSetPreviewRot(INV_KPK_MODEL_LAPTOP, 155.0, 180.0,0.0, 0.770100);
//	TextDrawSetPreviewRot(INV_RIGHT_PACK, 0.0, 0.0,0.0, 0.981200);

//	TextDrawSetProportional(INV_YELLOY_MENU, 1);
//	TextDrawSetShadow(INV_YELLOY_MENU, 0);


	TextDrawCreate(-1.0,-1.0,"LD_BUM:blkdot");
	TextDrawFont(DRAW_RED_SCREEN,4);
	TextDrawTextSize(DRAW_RED_SCREEN,641.0,450.0);
	TextDrawColor(DRAW_RED_SCREEN,0xFF32143C);

	TextDrawCreate(-1.0,-1.0,"particle:waterwake");
	TextDrawFont(DRAW_HOLOD,4);
	TextDrawTextSize(DRAW_HOLOD,655.0,451.0);
	TextDrawColor(DRAW_HOLOD,0xFFFFFF14);
   // for(new i;i<10;i++)
//	{
	//	mysor[i]=0;
//	}

	GangZoneCreate(91.0,1781.0,360.0,1948.0);// зз в бункере
	GangZoneCreate(-3000.0,-3000,3000.0,3000.0);// черная карта
//	printf("gang=%d blckkk=%d",gang,blckkk);

	//пикапы
	//ниже пикапы бункера


	SetPreciseTimer("pickups",100,0);
	SetPreciseTimer("labeltext",100,0);
    SetPreciseTimer("actores",100,0);
    SetPreciseTimer("mapicons",100,0);
 ///////////////////////////////////////////////////////////////




 /*
	FCNPC_Create("Ivanish");

	FCNPC_Spawn(1,290 , 242.932159,1856.489990,8.757813);

	SetPlayerFacingAngle(1,269.460266);
	new str[11],
		zombie_skins[]={77,78,79,135,213,239};



	for(new i;i<50;i++)
	{
	    format(str,11,"ZOMBIE_%d",i+1);
	    npc_id[i]=FCNPC_Create(str);
	    FCNPC_SetHealth(npc_id[i],100);
	    FCNPC_SetArmour(npc_id[i],0);
	    FCNPC_Spawn(npc_id[i], zombie_skins[random(sizeof(zombie_skins))], 0,0,15);
		SetPlayerColor(npc_id[i],0x80ff00FF);
		SetPlayerAttachedObject(npc_id[i], 1, 18698, 1);
	//	npc_zone[i]=CreateDynamicCircle(Float:x, Float:y, 25.0, 0,0);
//	}

*/

//гитара одно и тоже


/*
дубинка-SetPlayerAttachedObject(56,1, 334,1, 0.199999, -0.139999, 0.030000, 0.500007, -115.000000, 0.000000, 1.000000, 1.000000, 1.000000);

м4-SetPlayerAttachedObject(plaeyrid,5, 356,1, -0.143000, -0.120900, -0.069900, -179.889999, 3.590000, 3.000000, 1.000000, 1.000000, 1.000000);
////////////////////////////////////////////////////////////
скин игрока рокфелер (джинсы + коричневая кофта)
рюкзак
attac(9,371,1,-0.022000,-0.103000,0.000000,5.000000,90.089996,-3.990000,1.000000,1.000000,1.000000)////60

////////////////////////////////////////////////////////////
новичок

рюкзак
attac(9,371,1,0.089000,-0.063000,0.000000,4.990000,89.790001,-3.500000,0.710000,1.000000,0.670000)////2

////////////////////////////////////////////////////////////
S.W.A.T.
новогодняя шапка
attac(2,19065,2,0.134000,0.005000,0.002900,86.489998,92.199997,-5.800000,1.250000,1.210000,1.240000)////285

рюкзак
attac(9,371,1,-0.057000,-0.094000,-0.003000,0.000000,88.190002,-0.890000,1.160000,1.190000,1.040000)////285

////////////////////////////////////////////////////////////
элвис рюкзак
attac(9,371,1,0.002900,-0.098900,0.000000,6.690000,89.089996,0.700000,0.830000,1.000000,0.820000)////84

////////////////////////////////////////////////////////
шахтер гитара
attac(8,19317,1,0.064000,-0.111900,0.057900,-1.590000,75.089996,2.390000,0.710000,1.000000,0.690000)////16

шахтер рюкзак неизве
attac(9,371,1,0.002900,-0.098900,0.000000,6.690000,89.089996,0.700000,0.830000,1.000000,0.820000)////16

//-------------------------------------------------
рюкзак на полицейского неизвестный размер
attac(9,371,1,0.089000,-0.063000,0.000000,4.990000,89.790001,-3.500000,0.710000,1.000000,0.670000)////280

новогодняя шапка на полицейского
attac(2,19065,2,0.134000,0.005000,0.002900,86.489998,92.199997,-5.800000,1.250000,1.210000,1.240000)////280

рация на полицейского
attac(7,363,8,0.124900,0.078900,0.060000,90.000000,-87.589996,9.790000,0.330000,0.500000,0.470000)////280

////......CreateActor..CreateActor.-----------------------------------------------

рюкзак на военного тип неизвестен
attac(9,371,1,-0.057000,-0.094000,-0.003000,0.000000,88.190002,-0.890000,1.160000,1.190000,1.040000)////287

гитара военика
attac(8,19317,1,0.064000,-0.111900,0.057900,-1.590000,75.089996,2.390000,0.710000,1.000000,0.690000)////287

рация военика 363 рация
attac(7,363,8,0.124900,0.078900,0.060000,90.000000,-87.589996,9.790000,0.330000,0.500000,0.470000)////287

//узи военика 352 модель узи
attac(4,352,7,0.000000,-0.100000,-0.080000,-95.000000,-10.000000,0.000000,1.000000,1.000000,1.000000)////287

респик военика
attac(0,19472,18,0.120900,-0.013000,0.008000,86.690002,-17.990000,0.000000,1.000000,1.000000,1.000000)////287

броник военика
attac(1,19515,1,0.036000,0.045900,0.013000,0.000000,0.000000,0.000000,1.130000,1.270000,1.150000)////287

шлем военика
attac(6,19514,2,0.061900,0.039900,0.004900,0.000000,0.000000,26.389999,1.510000,1.230000,1.120000)////287

*/





	{
	    new Float:point_of_bynker[]=
		{
		    200.0,1874.1,
			238.0,1874.1,
			238.0,1181.0,
			333.0,1181.0,
		    333.0,1796.0,
		    200.0,1796.1
		};
		CreateDynamicPolygon(point_of_bynker,0.0,15.7);//бункер
	}
    CreateDynamicRectangle(209.2703,1872.4502 , 218.5275,1880.1680 );//ворота

    CreateDynamicSphere( 256.579102,1845.569946,8.895500,3.000000);//аренда комнаты

	CreateDynamicSphere( 308.557678,1830.822510,6.9768,1.000000);
	CreateDynamicSphere( 306.158386,1830.822510,6.9768,1.000000);//столы пошивки
	CreateDynamicSphere( 303.954315,1830.822510,6.9768,1.000000);

    CreateDynamicSphere( 308.809601,1833.592651,6.9768,1.000000);
    CreateDynamicSphere( 306.227112,1833.592651,6.9768,1.000000);//столы пошивки
    CreateDynamicSphere( 303.870514,1833.592651,6.9768,1.000000);

    CreateDynamicSphere( 308.736511,1835.484253,6.9768,1.000000);
    CreateDynamicSphere( 306.440491,1835.484253,6.9768,1.000000);//столы пошивки
    CreateDynamicSphere( 304.335999,1835.484253,6.9768,1.000000);

    CreateDynamicSphere( 316.494751,1834.342041,6.9768,2.000000);// готовая продукция на пошиве

    Streamer_SetVisibleItems(STREAMER_TYPE_OBJECT, 1000);

    {
     //   Streamer_ToggleItemCallbacks();
    	new types[STREAMER_MAX_TYPES] =
        {
                STREAMER_TYPE_OBJECT,
                STREAMER_TYPE_AREA,
                STREAMER_TYPE_3D_TEXT_LABEL,
                STREAMER_TYPE_PICKUP,
                STREAMER_TYPE_MAP_ICON,
                STREAMER_TYPE_ACTOR,
                STREAMER_TYPE_CP,
                STREAMER_TYPE_RACE_CP
        };
        Streamer_SetTypePriority(types);
	}
//	SetPreciseTimer("OXPAHA",17000,1);


	SetPreciseTimer("TimeUP",2500,1);
	SetPreciseTimer("podskazki",192000,1);//3:12 - 3 минуты 12 секунд
	SetPreciseTimer("info",349000,1);//5 минут 49 секунд
	SetPreciseTimer("SecondTimer",1000,1);
	SetPreciseTimer("MainVehicle",40000,1);

	SetPreciseTimer("UpSpeed",500,1);
	printf("end init");
	return 1;
}
forward mapicons();
public mapicons()
{
	/////////////////////////////////////////////////////////////////////////////

	CreateDynamicMapIcon(214.073792,1875.694458,12.119150, 31, 0, 0, 0);//зеленая иконка домика

	CreateDynamicMapIcon(-315.609985,829.820007,13.830000,6,0);//аммо фк
	CreateDynamicMapIcon(-217.699997,979.150024,19.150000,30,0);//police fk
	CreateDynamicMapIcon(-318.737610,1048.512207,20.051861,22,0);//больница фк
    CreateDynamicMapIcon(-145.789993,1173.739990,19.670000,45,0);//одежда фк
    CreateDynamicMapIcon(-53.900002,1188.890015,19.120001,29,0);//ресторан фк
    CreateDynamicMapIcon(-99.110001,1083.459961,19.430000,34,0);//radio fk
    CreateDynamicMapIcon(70.446220,1218.442383,17.812820,55,0);//заправка фк

    CreateDynamicMapIcon(-227.350006,2711.550049,62.700001,29,0);// ресторан на горе сверху от бункера
    CreateDynamicMapIcon(-736.987061,2746.067871,46.222099,55,0);//бензоправка на пути в дальний городок


    CreateDynamicMapIcon(-1271.339966,2713.290039,49.970001,14,0);//дальний городок магазин
    CreateDynamicMapIcon(-1327.560669,2677.431641,49.809299,55,0);//дальний городок заправка
    CreateDynamicMapIcon(-1390.089966,2638.560059,55.689999,30,0);//дальний городок police
    CreateDynamicMapIcon(-1508.949951,2610.229980,55.560001,6,0);//дальний городок аммо
    CreateDynamicMapIcon(-1514.716431,2519.642822,55.753170,22,0);//дальний городок больница



    CreateDynamicMapIcon(-1941.819946,2379.459961,49.430000,48,0);//дискотека за дальним городком

    CreateDynamicMapIcon(-2454.530029,2254.060059,4.800000,47,0);// молокозавод

    CreateDynamicMapIcon(-2665.034180,639.538879,14.261390,22,0);//болька сф
    CreateDynamicMapIcon(-2625.891602,208.968979,4.422340,6,0);//аммо сф

    CreateDynamicMapIcon(-2027.550537,157.428802,28.835899,55,0);//сф заправка напротив вокзала
    CreateDynamicMapIcon(-1679.459473,412.512909,6.997300,55,0);//сф заправка напротив морской военой базы


    CreateDynamicMapIcon(-1605.483765,711.284851,13.78795,30,0);//сф полицейский участок

    CreateDynamicMapIcon(-1694.737305,951.618103,24.556601,45,0);//сф одежда

	CreateDynamicMapIcon(-794.729980,1557.000000,26.860001,20,0);
	
	CreateDynamicMapIcon(242.188004,-178.389008,1.191000,6,0);//аммо справа от деревни
	
}
forward actores();
public actores()
{
	printf("FSDFSDFSDF");
	//скин 287 - военный
	CreateDynamicActor(287, 262.543213, 1807.255127, 34.436218,  216.545776,.worldid = 0, .interiorid=0 );//0 100.000000
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	CreateDynamicActor(183, 248.539993, 1875.339966, 8.770000,  193.220001,.worldid = 0, .interiorid=0 );//1 100.000000
	ApplyDynamicActorAnimation(ACTR_bynker_a,"GANGS","prtial_gngtlkF",4.100000, 1, 1,1,0,0);
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	CreateDynamicActor(2, 279.903229, 1860.278198, 9.434600,  0.000000,.worldid = 0, .interiorid=0 );//2 100.000000 ACTR_hospital_a
	ApplyDynamicActorAnimation(ACTR_hospital_a,"CRACK","crckdeth4",4.100000, 0, 1,1,1,0);
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	//военный на выходе из госпиталя
	CreateDynamicActor(287, 318.470001, 1855.339966, 7.700000,  48.779999,.worldid = 0, .interiorid=0 );//3 100.000000
	ApplyDynamicActorAnimation(ACTR_voen,"GANGS","prtial_gngtlkG",4.100000, 1, 1,1,0,0);
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	CreateDynamicActor(125, 250.960007, 1862.150024, 8.750000,  334.549988,.worldid = 0, .interiorid=0 );//4 100.000000 ACTR_bynker_b
	ApplyDynamicActorAnimation(ACTR_bynker_b,"GANGS","prtial_gngtlkG",4.100000, 1, 1,1,0,0);
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////////////

	CreateDynamicActor(29, 245.929993, 1846.489990, 8.760000,  84.760002,.worldid = 0, .interiorid=0 );//5 100.000000 ACTR_bynker_c
	ApplyDynamicActorAnimation(ACTR_bynker_c,"GANGS","prtial_gngtlkE",4.100000, 1, 1,1,0,0);
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	//скин байкера (стоит и разговаривает слева от аренды комнат)
	CreateDynamicActor(248, 262.100006, 1852.619995, 8.760000,  90.000000,.worldid = 0, .interiorid=0 );//6 100.000000
	ApplyDynamicActorAnimation(ACTR_bynker_d,"GANGS","prtial_gngtlkH",4.100000, 1, 1,1,0,0);
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	//раненый (леежит на койке согнувшись в калачик :D )
	CreateDynamicActor(261, 279.937805, 1855.269043, 9.434600,  4.741220,.worldid = 0, .interiorid=0 );//7 100.000000
	ApplyDynamicActorAnimation(ACTR_hospital_b,"CRACK","crckdeth4",4.100000, 0, 1,1,1,0);
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	// медик в зеленой футболке
	CreateDynamicActor(276, 280.316742, 1872.572144, 8.691450,  319.113007,.worldid = 0, .interiorid=0 );//8 100.000000
	ApplyDynamicActorAnimation(ACTR_vrach_a,"GANGS","prtial_gngtlkF",4.100000, 1, 1,1,0,0);
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	// темнокожий медик в белой форме
	CreateDynamicActor(274, 272.396729, 1873.146851, 8.691450,  232.447052,.worldid = 0, .interiorid=0 );//9 100.000000
	ApplyDynamicActorAnimation(ACTR_vrach_b,"GANGS","prtial_gngtlkG",4.100000, 1, 1,1,0,0);
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////////////

	CreateDynamicActor(70, 265.597382, 1862.257935, 8.770510,  273.334076,.worldid = 0, .interiorid=0 );//10 100.000000
	CreateDynamicActor(250, 281.496765, 1873.418091, 8.691450,  141.904129,.worldid = 0, .interiorid=0 );//11 100.000000
	CreateDynamicActor(308, 273.721588, 1872.851563, 8.691450,  89.849113,.worldid = 0, .interiorid=0 );//12 100.000000
	CreateDynamicActor(112, 317.600006, 1855.969971, 7.640000,  231.690002,.worldid = 0, .interiorid=0 );//13 100.000000
	CreateDynamicActor(272, 260.459991, 1852.239990, 8.760000,  294.619995,.worldid = 0, .interiorid=0 );//14 100.000000
	CreateDynamicActor(127, 249.279999, 1874.079956, 8.770000,  57.560001,.worldid = 0, .interiorid=0 );//15 100.000000
	CreateDynamicActor(250, 248.089996, 1873.959961, 8.770000,  316.450012,.worldid = 0, .interiorid=0 );//16 100.000000
	CreateDynamicActor(24, 245.080002, 1846.680054, 8.780000,  291.079987,.worldid = 0, .interiorid=0 );//17 100.000000
	CreateDynamicActor(184, 250.520004, 1862.750000, 8.750000,  211.880005,.worldid = 0, .interiorid=0 );//18 100.000000
	CreateDynamicActor(101, 251.750000, 1862.500000, 8.750000,  147.990005,.worldid = 0, .interiorid=0 );//19 100.000000

	//спорзал

	CreateDynamicActor(203, 762.390747, -35.613621, 1000.713623,  215.693375,.worldid = 0, .interiorid=0 );//20 100.000000
	ApplyDynamicActorAnimation(ACTR_sportzal_a,"GANGS","prtial_gngtlkF",4.100000, 1, 1,1,0,0);

	CreateDynamicActor(80, 769.023804, -23.163919, 1001.619507,  303.370911,.worldid = 0, .interiorid=0 );//21 100.000000
	ApplyDynamicActorAnimation(ACTR_sportzal_b,"GANGS","prtial_gngtlkG",4.100000, 1, 1,1,0,0);

	CreateDynamicActor(49, 773.588440, -32.568298, 1000.713562,  134.629730,.worldid = 0, .interiorid=0 );//22 100.000000 сенсей
	CreateDynamicActor(81, 763.169922, -19.156401, 1000.713196,  180.000000,.worldid = 0, .interiorid=0 );//23 100.000000
	CreateDynamicActor(204, 762.911438, -36.742779, 1000.713623,  20.178070,.worldid = 0, .interiorid=0 );//24 100.000000
	CreateDynamicActor(80, 769.859619, -22.221300, 1001.619507,  131.893280,.worldid = 0, .interiorid=0 );//25 100.000000

	//спортзал сверху


	CreateDynamicActor(80, 254.753296, 1830.826538, 4.728300,  35.378361,.worldid = 0, .interiorid=0 );//26 100.000000
	ApplyDynamicActorAnimation(ACTR_sportzal_c,"GANGS","prtial_gngtlkH",4.100000, 1, 1,1,0,0);

	CreateDynamicActor(203, 254.408234, 1831.604004, 4.728300,  218.374466,.worldid = 0, .interiorid=0 );//27 100.000000

	CreateDynamicActor(287, 290.365234, 1814.062256, 4.832580,  45.000000,.worldid = 0, .interiorid=0 );//64 100.000000
	CreateDynamicActor(287, 255.449707, 1813.867310, 5.088100,  335.598114,.worldid = 0, .interiorid=0 );//65 100.000000
	CreateDynamicActor(287, 126.037102, 1865.240234, 18.135401,  301.762085,.worldid = 0, .interiorid=0 );//66 100.000000
	CreateDynamicActor(287, 162.519867, 1846.056763, 20.679600,  123.460190,.worldid = 0, .interiorid=0 );//67 100.000000
	CreateDynamicActor(287, 230.149200, 1931.198608, 28.119499,  167.832794,.worldid = 0, .interiorid=0 );//68 100.000000
	CreateDynamicActor(1, 286.985413, 1831.777344, 8.731000,  250.417694,.worldid = 0, .interiorid=0 );//69 100.000000
	CreateDynamicActor(287, 291.503815, 1826.128052, 8.344200,  229.372253,.worldid = 0, .interiorid=0 );//70 100.000000
	CreateDynamicActor(50, 150.247192, 1824.905884, 18.199301,  330.191406,.worldid = 0, .interiorid=0 );//78 100.000000
	CreateDynamicActor(242, 241.699371, 1837.195068, 5.152140,  224.568497,.worldid = 0, .interiorid=0 );//79 100.000000

	//CreateDynamicActor(255, 239.934494, 1846.936279, 8.886800,  274.051300);//92 100.000000 проводник - нафиг не нужен

	//магазин одежды в бункере
	CreateDynamicActor(3, 316.916504, 2053.787109, 895.696106,  180.000000,.worldid = 0, .interiorid=0 );//28 продавес одежды

	//актеры для мужчин (магазин одежды в бункере)
	CreateDynamicActor(287, 317.434509, 2056.488037, 896.600830,  180.000000);//29 100.000000
	CreateDynamicActor(285, 315.359192, 2056.460938, 896.600830,  180.000000);//30 100.000000
	CreateDynamicActor(248, 319.436188, 2056.437500, 896.600830,  180.000000);//31 100.000000
	CreateDynamicActor(125, 321.943115, 2053.383545, 896.600830,  90.000000);//32 100.000000
	CreateDynamicActor(112, 321.943115, 2049.846680, 896.600830,  90.000000);//33 100.000000
	CreateDynamicActor(111, 321.958008, 2045.808716, 896.600830,  90.000000);//34 100.000000
	CreateDynamicActor(29, 313.186310, 2049.846680, 896.600830,  -90.000000);//35 100.000000
	CreateDynamicActor(60, 321.943115, 2038.197998, 896.600830,  90.000000);//36 100.000000
	CreateDynamicActor(115, 321.943115, 2034.770752, 896.600830,  90.000000);//37 100.000000
	CreateDynamicActor(120, 321.943115, 2042.021851, 896.600830,  90.000000);//38 100.000000
	CreateDynamicActor(123, 321.943115, 2030.992065, 896.600830,  90.000000);//39 100.000000
	CreateDynamicActor(186, 313.042847, 2030.992065, 896.600830,  -90.000000);//40 100.000000
	CreateDynamicActor(183, 313.108795, 2034.770752, 896.600830,  -90.000000);//41 100.000000
	CreateDynamicActor(126, 313.144531, 2038.197998, 896.600830,  -90.000000);//42 100.000000
	CreateDynamicActor(104, 313.185425, 2042.021851, 896.600830,  -90.000000);//43 100.000000
	CreateDynamicActor(101, 313.178925, 2053.383545, 896.600830,  -90.000000);//44 100.000000
	CreateDynamicActor(113, 313.144226, 2045.808716, 896.600830,  -90.000000);//45 100.000000

	//выше актеры для мужчин (магазин одежды в бункере)
	////////////////////////////////////////////////////////////////////////////////////////////
	//актеры для женчин (магазин одежды в бункере)
	CreateDynamicActor(3, 316.916504, 2053.787109, 895.696106,  180.000000);//46 100.000000
	CreateDynamicActor(191, 317.434509, 2056.488037, 896.600830,  180.000000);//47 100.000000
	CreateDynamicActor(285, 315.359192, 2056.460938, 896.600830,  180.000000);//48 100.000000
	CreateDynamicActor(192, 319.436188, 2056.437500, 896.600830,  180.000000);//49 100.000000
	CreateDynamicActor(93, 321.943115, 2053.383545, 896.600830,  90.000000);//50 100.000000
	CreateDynamicActor(76, 321.943115, 2049.846680, 896.600830,  90.000000);//51 100.000000
	CreateDynamicActor(151, 321.958008, 2045.808716, 896.600830,  90.000000);//52 100.000000
	CreateDynamicActor(190, 313.186310, 2049.846680, 896.600830,  -90.000000);//53 100.000000
	CreateDynamicActor(233, 321.943115, 2038.197998, 896.600830,  90.000000);//54 100.000000
	CreateDynamicActor(65, 321.943115, 2034.770752, 896.600830,  90.000000);//55 100.000000
	CreateDynamicActor(172, 321.943115, 2042.021851, 896.600830,  90.000000);//56 100.000000
	CreateDynamicActor(169, 321.943115, 2030.992065, 896.600830,  90.000000);//57 100.000000
	CreateDynamicActor(194, 313.042847, 2030.992065, 896.600830,  -90.000000);//58 100.000000
	CreateDynamicActor(131, 313.108795, 2034.770752, 896.600830,  -90.000000);//59 100.000000
	CreateDynamicActor(198, 313.144531, 2038.197998, 896.600830,  -90.000000);//60 100.000000
	CreateDynamicActor(55, 313.185425, 2042.021851, 896.600830,  -90.000000);//61 100.000000
	CreateDynamicActor(211, 313.178925, 2053.383545, 896.600830,  -90.000000);//62 100.000000
	CreateDynamicActor(11, 313.144226, 2045.808716, 896.600830,  -90.000000);//63 100.000000
//выше актеры для женчин (магазин одежды в бункере)
}
forward labeltext();
public labeltext()
{
	CreateDynamic3DTextLabel("{CC0000}ИВАНЫЧ\n\
{00FF00}Нажмите {FF0000}F\n\
{00FF00}чтобы посмотреть меню",-65366,244.490005,1856.699951,8.310000,20.000000, INVALID_PLAYER_ID,  INVALID_VEHICLE_ID,0);

	CreateDynamic3DTextLabel("{CC0000}Мусорка\n\
{00FF00}тут можно выбросить лут\n\
{00FF00}или покопаться в мусоре: {FF0000}Alt",-65366,255.368195,1842.661499,8.568430,20.000000, INVALID_PLAYER_ID,  INVALID_VEHICLE_ID,1);

	CreateDynamic3DTextLabel("{CC0000}СПОРТЗАЛ",-65366,255.528381,1834.383667,4.217800,25.000000, INVALID_PLAYER_ID,  INVALID_VEHICLE_ID,1);

	CreateDynamic3DTextLabel("{CC0000}БУКМЕКЕР\n\
{0080FF}Мотогонки\n\
{00FF00}Нажмите {FF0000}F ",-65366,241.699371,1837.195068,5.152140,25.000000, INVALID_PLAYER_ID,  INVALID_VEHICLE_ID,1);

	CreateDynamic3DTextLabel("{CC0000}ПОРТНОЙ\n\
{009B00}Тут можно купить крутую одежду\n\
{009B00}или заработать респиратор",-65366,287.566772,1813.401245,4.519990,20.000000, INVALID_PLAYER_ID,  INVALID_VEHICLE_ID,1);

	CreateDynamic3DTextLabel("{CC0000}МАСТЕР\n\
{009B00}Тут можно изготовить оружие\n\
{009B00}или взять задание",-65366,293.367035,1825.987305,7.533810,20.000000, INVALID_PLAYER_ID,  INVALID_VEHICLE_ID,1);

	CreateDynamic3DTextLabel("{CC0000}Мастер\n\
{00FF00}Нажмите {FF0000}F\n\
{00FF00}чтобы посмотреть меню",-65366,289.565369,1831.734253,7.139110,20.000000,INVALID_PLAYER_ID,  INVALID_VEHICLE_ID,1);

	CreateDynamic3DTextLabel("{00FF00}Нажмите {FF0000}F\n\
 {00FF00}чтобы поговорить с Сансеем",-65366,773.588440,-32.568298,1000.713562,20.000000, INVALID_PLAYER_ID,  INVALID_VEHICLE_ID,0);


 	CreateDynamic3DTextLabel("{00FF00}Нажмите {FF0000}F\n\
 {00FF00}чтобы поговорить с Тренером",-65366,763.169922,-19.156401,1000.713196,20.000000, INVALID_PLAYER_ID,  INVALID_VEHICLE_ID,0);

	CreateDynamic3DTextLabel("{CC0000}Готовая продукция",-65366,316.494751,1834.342041,6.581740,10.000000, INVALID_PLAYER_ID,  INVALID_VEHICLE_ID,1);

	CreateDynamic3DTextLabel("{CC0000}ЛИФТ",-65366,200.571869,1869.500854,12.782000,20.000000,INVALID_PLAYER_ID,  INVALID_VEHICLE_ID,1);

	CreateDynamic3DTextLabel("{00FF00}Нажмите {FF0000}F\n\
 {00FF00}чтобы поговорить со Стрелком",-65366,74.580803,1969.253174,823.367554,20.000000,INVALID_PLAYER_ID,  INVALID_VEHICLE_ID,0);

    CreateDynamic3DTextLabel("{FFFFFF}Нажмите {FF0000}ALT\n\
 {FFFFFF}чтобы поговорить с Шрамом",-65366,190.859177,1821.470581,1217.362915,35.000000,INVALID_PLAYER_ID,  INVALID_VEHICLE_ID,0);

 	CreateDynamic3DTextLabel("{FFFFFF}Нажмите {FF0000}ALT\n\
 {FFFFFF}чтобы поговорить с Механиком",-65366,150.247192,1824.905884,18.199301,35.000000,INVALID_PLAYER_ID,  INVALID_VEHICLE_ID,0);

	CreateDynamic3DTextLabel("{CC0000}ГОСПИТАЛЬ\n\
{00D7D7}нажмите {00A800}F\n\
{00D7D7}для разговора с врачом",-65366,267.749176,1862.402832,8.162060,15.000000,INVALID_PLAYER_ID,  INVALID_VEHICLE_ID,1);

	CreateDynamic3DTextLabel("{00FF00}Нажмите {FF0000}F\n\
	 {00FF00}для покупки одежды",-65366,316.925537,2052.035156,894.932556,20.000000);

	CreateDynamic3DTextLabel("ТОПОВЫЙ ШМОТ\n\
	{FF702B}Модель {FF0000}№ 1.\n\
	{00AE00}Одежда военного.\n\
	{FF702B}Тепло: {FF0000}Хорошее!\n\
	{FF702B}Защита от вирусов: {FF0000}до 3!\n\
	{FF702B}Цена: {FF0000}20 000 $",-16777046,317.434509,2056.488037,896.600830,30.000000);

	CreateDynamic3DTextLabel("ТОПОВЫЙ ШМОТ\n\
	{FF702B}Модель {FF0000}№ 2.\n\
	{00AE00}Одежда спецназа.\n\
	{FF702B}Тепло: {FF0000}Хорошее!\n\
	{FF702B}Защита от вирусов: {FF0000}до 3!\n\
	{FF702B}Цена: {FF0000}20 000 $",-16777046,315.359192,2056.460938,896.600830,30.000000);

	CreateDynamic3DTextLabel("ТОПОВЫЙ ШМОТ\n\
	{FF702B}Модель {FF0000}№ 3.\n\
	{00AE00}Одежда байкера.\n\
	{FF702B}Тепло: {FF0000}Хорошее!\n\
	{FF702B}Защита от вирусов: {FF0000}до 3!\n\
	{FF702B}Цена: {FF0000}20 000 $",-16777046,319.436188,2056.437500,896.600830,30.000000);

	CreateDynamic3DTextLabel("ТОПОВЫЙ ШМОТ\n\
	{FF702B}Модель {FF0000}№ 4.\n\
	{00AE00}Одежда бандита.\n\
	{FF702B}Тепло: {FF0000}Хорошее!\n\
	{FF702B}Защита от вирусов: {FF0000}до 3!\n\
	{FF702B}Цена: {FF0000}20 000 $",-16777046,321.943115,2053.383545,896.600830,30.000000);

	CreateDynamic3DTextLabel("{FF702B}Модель {FF0000}№ 5.\n\
	{00AE00}Одежда бандита-2.\n\
	{FF702B}Тепло: {FF0000}Среднее\n\
	{FF702B}Цена: {FF0000}200 $",-16777046,321.943115,2049.846680,896.600830,30.000000);

	CreateDynamic3DTextLabel("{FF702B}Модель {FF0000}№ 6.\n\
	{00AE00}Одежда здоровяка.\n\
	{FF702B}Тепло: {FF0000}Среднее\n\
	{FF702B}Цена: {FF0000}200 $",-16777046,321.958008,2045.808716,896.600830,30.000000);

	CreateDynamic3DTextLabel("{FF702B}Модель {FF0000}№ 7.\n\
	{00AE00}Одежда барыги.\n\
	{FF702B}Тепло: {FF0000}Среднее\n\
	{FF702B}Цена: {FF0000}200 $",-16777046,313.186310,2049.846680,896.600830,30.000000);

	CreateDynamic3DTextLabel("{FF702B}Модель {FF0000}№ 8.\n\
	{00AE00}Одежда гражданская-2.\n\
	{FF702B}Тепло: {FF0000}Среднее\n\
	{FF702B}Цена: {FF0000}200 $",-16777046,321.943115,2038.197998,896.600830,30.000000);

	CreateDynamic3DTextLabel("{FF702B}Модель {FF0000}№ 9.\n\
	{00AE00}Одежда рэпера.\n\
	{FF702B}Тепло: {FF0000}Среднее\n\
	{FF702B}Цена: {FF0000}200 $",-16777046,321.943115,2034.770752,896.600830,30.000000);

	CreateDynamic3DTextLabel("{FF702B}Модель {FF0000}№ 10.\n\
	{00AE00}Одежда костюм.\n\
	{FF702B}Тепло: {FF0000}Среднее\n\
	{FF702B}Цена: {FF0000}200 $",-16777046,321.943115,2042.021851,896.600830,30.000000);

	CreateDynamic3DTextLabel("{FF702B}Модель {FF0000}№ 11.\n\
	{00AE00}Одежда восточная.\n\
	{FF702B}Тепло: {FF0000}Среднее\n\
	{FF702B}Цена: {FF0000}200 $",-16777046,321.943115,2030.992065,896.600830,30.000000);

	CreateDynamic3DTextLabel("{FF702B}Модель {FF0000}№ 12.\n\
	{00AE00}Одежда костюм-2.\n\
	{FF702B}Тепло: {FF0000}Среднее\n\
	{FF702B}Цена: {FF0000}200 $",-16777046,313.042847,2030.992065,896.600830,30.000000);

	CreateDynamic3DTextLabel("{FF702B}Модель {FF0000}№ 13.\n\
	{00AE00}Одежда хиппи.\n\
	{FF702B}Тепло: {FF0000}Среднее\n\
	{FF702B}Цена: {FF0000}200 $",-16777046,313.108795,2034.770752,896.600830,30.000000);

	CreateDynamic3DTextLabel("ТОПОВЫЙ ШМОТ\n\
	{FF702B}Модель {FF0000}№ 14.\n\
	{00AE00}Одежда гражданская-3.\n\
	{FF702B}Тепло: {FF0000}Хорошее!\n\
	{FF702B}Защита от вирусов: {FF0000}до 3!\n\
	{FF702B}Цена: {FF0000}20 000 $",-16777046,313.178925,2053.383545,896.600830,30.000000);

	CreateDynamic3DTextLabel("{FF702B}Модель {FF0000}№ 15.\n\
	{00AE00}Одежда костюм-3.\n\
	{FF702B}Тепло: {FF0000}Среднее\n\
	{FF702B}Цена: {FF0000}200 $",-16777046,313.144226,2045.808716,896.600830,30.000000);

	CreateDynamic3DTextLabel("{FF702B}Модель {FF0000}№ 16.\n\
	{00AE00}Одежда рэпера-2.\n\
	{FF702B}Тепло: {FF0000}Среднее\n\
	{FF702B}Цена: {FF0000}200 $",-16777046,313.185425,2042.021851,896.600830,30.000000);

	CreateDynamic3DTextLabel("{FF702B}Модель {FF0000}№ 17.\n\
	{00AE00}Одежда бандита-3.\n\
	{FF702B}Тепло: {FF0000}Среднее\n\
	{FF702B}Цена: {FF0000}200 $",-16777046,313.144531,2038.197998,896.600830,30.000000);


	CreateDynamic3DTextLabel("{CC0000}ХРАМ\n\
{00FF00}тут можно помолиться\n\
{00FF00}нажмите {FF0000}ALT" ,0xFFFF00AA,370.029999,2390.199951,1890.359985, 20.000000);
}
forward pickups();
public pickups()
{
	CreateDynamicPickup(19523,2,256.579102,1845.569946,8.895500);//вход в свою комнату  1
	
	CreateDynamicPickup(19523,23,235.218933,1886.997559,817.612366);//выход из комнаты  2

	CreateDynamicPickup(19804,2,226.668259,1890.632202,817.423828);//сейф в комнате 3

	CreateDynamicPickup(1318,23,293.367035,1825.987305,7.563810);// master  4

	CreateDynamicPickup(1318,23,293.294037,1827.895386,7.833810); //exit master 5

	CreateDynamicPickup(1318,23,255.528381,1834.383667,4.417800); //sportzal    6

	CreateDynamicPickup(1318,23,200.571869,1869.500854,12.782000); //lift naemnik,strelbishe    7

	CreateDynamicPickup(1318,23,287.566772,1813.401245,4.519990);// пошив одежды новичкам + магазин 8

	CreateDynamicPickup(1318,23,304.064636,1826.981323,6.682030);//fabrica exit 9

	CreateDynamicPickup(19134,2,315.285492,1828.477905,6.920700); //  10

	CreateDynamicPickup(19134,2,317.244110,1828.477905,6.920700);// 11

	CreateDynamicPickup(19134,2,319.345612,1828.477905,6.920700);//12

	CreateDynamicPickup(19134,2,321.361206,1828.477905,6.920700);//13

	CreateDynamicPickup(1318,23,193.515503,1825.759644,1217.303589);//shop_exit 14

	CreateDynamicPickup(1318,23,763.075378,-50.564400,1000.150330);//exit sportzl 15

	CreateDynamicPickup(1318,23,72.594299,1954.125122,823.104370);//strelbiwe_exit  16

	CreateDynamicPickup(1318,23,193.515503,1825.759644,1217.303589);//shram_exit 17
	//выше пикапы бункера

	//ниже форт карсон - деревня под бункером
	CreateDynamicPickup(1318,23,-217.699997,979.150024,19.150000);//полиция фк
	CreateDynamicPickup(1318,23,-315.609985,829.820007,13.830000);//аммо фк
	CreateDynamicPickup(1318,23,-318.737610,1048.512207,20.051861);// больница фк
	CreateDynamicPickup(1318,23,-99.110001,1083.459961,19.430000);//радио фк
	CreateDynamicPickup(1318,23,-145.789993,1173.739990,19.670000);// магазин одежды фк
	CreateDynamicPickup(1318,23,-53.900002,1188.890015,19.120001);// ресторан фк
	CreateDynamicPickup(1318,23,-19.099581,1175.855713,19.262100);// магазин праздник (там можно найти валентинку)
	CreateDynamicPickup(19130,23,-301.738800,1219.271973,20.395300);// вход в канализацию фк

	CreateDynamicPickup(1318,23,-227.350006,2711.550049,62.700001);//вход в закусочную на горе
	CreateDynamicPickup(1318,23,377.119995,-193.169998,1000.340027);//выход из закусочной на горе



	CreateDynamicPickup(19130,23,-1453.497803,2536.114502,56.395000);//дальний городок каналиация
	CreateDynamicPickup(1318,23,-1390.089966,2638.560059,55.689999);//дальний городок полиция
	CreateDynamicPickup(1318,23,-1508.949951,2610.229980,55.560001);// дальний городок аммо
	CreateDynamicPickup(1318,23,-1514.716431,2519.642822,55.753170);//дальний городок больница


	CreateDynamicPickup(1318,23,-1941.819946,2379.459961,49.430000);//дискотека вход
	CreateDynamicPickup(1318,23,493.369995,-24.790001,1000.309998);//дискотека выход

	CreateDynamicPickup(1318,23,-2454.530029,2254.060059,4.800000);//молокозавод
	CreateDynamicPickup(1318,23,-2437.489990,2294.830078,841.369995);//выход из молокозавода


	CreateDynamicPickup(1318,23,-2665.034180,639.538879,14.261390);//больница сф
	CreateDynamicPickup(1318,23,379.226715,163.187775,1019.678284);//больница сф выход
	//|
	CreateDynamicPickup(1318,23,-2625.891602,208.968979,4.422340);//аммо sf
	//|
	CreateDynamicPickup(19130,23,-1960.027344,486.967377,31.707899);//метро сф вход
	CreateDynamicPickup(19134,23,2565.936279,-426.979401,797.525635);//метро сф вход
	//|
	CreateDynamicPickup(1318,23,-2026.650024,67.139999,28.580000);//пожарное отделение сф
	CreateDynamicPickup(1318,23,-1932.810059,377.290009,993.859985);//пожарное отделение сф
	//|
	CreateDynamicPickup(1318,23,-1605.483765,711.284851,13.787950);// полиция сф

	//|
	CreateDynamicPickup(1318,23,-1694.737305,951.618103,24.556601);//магазин одежды сф
	
	CreateDynamicPickup(1318,23,-794.729980,1557.000000,26.860001);//храм вход с улицы
	CreateDynamicPickup(1318,23,390.630005,2390.409912,1889.209961);//храм выход
}

#define AttachPack_9 9

#define BONE_Left_Hand_5 5
#define BONE_Spina_1 1
stock SetPlayerPack(playerid,packid)
{
    RemovePlayerAttachedObject(playerid, AttachPack_9);
	pInfo[playerid][pack]=packid;
	if(packid==1)//на 10 слотов
	{
	    SetPlayerAttachedObject(playerid,AttachPack_9, 371,BONE_Spina_1, 0.089000, -0.063000, 0.000000, 4.990000, 89.790001, -3.500000, 0.710000, 1.000000,0.670000);////2
	}
	else if(packid==2)//на 20 слотов
	{
	    SetPlayerAttachedObject(playerid,AttachPack_9, 371,BONE_Spina_1, 0.002900, -0.098900, 0.000000, 6.690000, 89.089996, 0.700000, 0.830000, 1.000000, 0.820000);//183
	}
	else if(packid==3)//на 30 слотов
	{
	    SetPlayerAttachedObject(playerid,AttachPack_9, 371,BONE_Spina_1, -0.022000, -0.103000, 0.000000, 5.000000, 90.089996, -3.990000, 1.000000, 1.000000, 1.000000);//93
	}
	else if(packid==4)//на 40 слотов
	{
	    SetPlayerAttachedObject(playerid,AttachPack_9, 371,BONE_Spina_1, -0.057000, -0.094000, -0.003000, 0.000000, 88.190002, -0.890000, 1.160000, 1.190000, 1.040000);//211
	}
	else if(packid==5)//на 50 слотов
	{
	    SetPlayerAttachedObject(playerid,AttachPack_9, 371,BONE_Spina_1, -0.042000, -0.122900, -0.009000, 1.000000, 89.000000, 2.390000, 1.380000, 1.150000, 1.310000);//192
	}

	new str_kolvo[7];
	format(str_kolvo,7,"%d/%d",pInfo[playerid][slot],packid*10);
	PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][21],str_kolvo);
}
#define BONE_JAW_18 18
#define AttachRespik_0 0
stock AttachResp(playerid)
{
	if(IsPlayerInDynamicArea(playerid,AREA_BUNKER)==0)
	{
	    RemovePlayerAttachedObject(playerid, AttachPack_9);

	    new skinid=GetSkin(playerid);//getskin - это #define pInfo[playerid][skin]

		if(skinid==2)//ид скина новичка мужкского пола
		{
		    SetPlayerAttachedObject(playerid, 0, 19472,18, 0.099900, -0.012000, 0.002900, 90.290001, -4.890000, 3.400000, 0.920000, 1.100000, 1.210000);//2
		}
		else if(skinid==24)//темнокожий в джинсах и синей куртке
		{
		    SetPlayerAttachedObject(playerid, 0, 19472,18, 0.102000, -0.028000, 0.003000, 87.190002, -13.700000, 2.490000, 0.870000, 1.000000, 1.000000);
		}
		else if(skinid==41)//новичок женский
		{
		    SetPlayerAttachedObject(20,0, 19472,18, 0.089000, -0.030900, 0.006000, -84.000000, -168.190002, -178.600006, 0.880000, 1.170000, 1.000000);
		}
		else if(skinid==104)//оджеда балласа с черными очками
		{
		    SetPlayerAttachedObject(playerid, 0, 19472,18, 0.130900, -0.045000, -0.008000, 84.000000, -35.990002, -3.700000, 1.000000, 1.000000, 1.000000);
		}
		else if(skinid==125)//топовая одежда бандита
		{
			SetPlayerAttachedObject(playerid, 0, 19472,18, 0.092000, -0.020000, 0.001900, 92.500000, -12.990000, 2.100000, 0.760000, 1.060000, 1.200000);//125
		}
		else if(skinid==172)//женский
		{
		    SetPlayerAttachedObject(29, 0, 19472,18, 0.102900, -0.025000, -0.005000, 82.889999, -23.190001, -2.500000, 1.000000, 1.000000, 1.000000);//172
		}
		else if(skinid==211)// женский - гражданского 3
		{
	        SetPlayerAttachedObject(playerid, 0, 19472,18, 0.092900, -0.034000, -0.002900, -91.790001, -156.800003, 177.100006, 1.000000, 1.000000, 1.000000);//211
		}
		else if(skinid==248)// топ скин байкера
		{
	        SetPlayerAttachedObject(playerid, 0, 19472,18, 0.122900, -0.027000, 0.002000, 90.099998, -26.799999, 2.490000, 1.040000, 1.270000, 1.500000);//248
		}
		else if(skinid==252)//мужской голый скин трусы в сердечко
		{
	        SetPlayerAttachedObject(playerid, 0, 19472,18, 0.092900, -0.037900, 0.004000, 87.690002, -17.900000, 1.190000, 1.000000, 1.140000, 1.040000);
		}
		else if(skinid==271)//райдер в кепке
		{
		    SetPlayerAttachedObject(playerid, 0, 19472,18, 0.105900, -0.046900, -0.001000, 90.199997, -29.290001, -0.800000, 1.000000, 1.000000, 1.000000);
		}
		else if(skinid==277)// пожарник светлокожий
		{
	        SetPlayerAttachedObject(playerid, 0, 19472,18, 0.127900, -0.035900, -0.002000, 87.599998, -22.400000, -4.400000, 1.030000, 1.110000, 1.080000);//277
		}
		else if(skinid==285)//скин спецназовца - вроде как у обоих полов
		{
	        SetPlayerAttachedObject(playerid, 0, 19472,18, 0.117000, -0.048000, 0.010900, 82.599998, -32.290001, 10.000000, 1.000000, 0.920000, 1.000000);//285
		}
		else if(skinid==294)//вузи
		{
		    SetPlayerAttachedObject(playerid, 0, 19472,18, 0.104900, -0.026000, 0.002900, 89.389999, -19.799999, -1.500000, 1.000000, 1.000000, 1.000000);//294
		}
		else if(skinid==299)//скин клода
		{
	        SetPlayerAttachedObject(playerid, 0, 19472,18, 0.102000, -0.057900, 0.004900, 92.889999, -31.299999, 1.600000, 1.000000, 1.000000, 1.000000);
		}
		// ДОГАДКА

		//докадки выше
    }
}

public OnVehicleStreamIn(vehicleid, forplayerid)
{
	Iter_AAdd(PlayerPerhapsVehicle[forplayerid],vehicleid);
    return 1;
}
public OnVehicleStreamOut(vehicleid, forplayerid)
{
	Iter_ARemove(PlayerPerhapsVehicle[forplayerid],vehicleid);
    return 1;
}

/*
public Streamer_OnItemStreamIn(type, id, forplayerid)
{
	if(type==STREAMER_TYPE_3D_TEXT_LABEL)
	{
	
	}
}

public Streamer_OnItemStreamOut(type, id, forplayerid)
{
	if(type==STREAMER_TYPE_3D_TEXT_LABEL)
	{

	}
}*/
stock SetPlayerFacingPos(playerid, Float:x, Float:y)
{
    new Float:ax, Float:ay, Float:az;
    GetPlayerPos(playerid, ax, ay, az);
    SetPlayerFacingAngle(playerid, atan2(y-ay, x-ax)-90.00);
}
stock PrintGreenInRadius(const message[],Float:x,Float:y,Float:z)
{
	foreach(Player,i)
	{
	    if(IsPlayerInRangeOfPoint(i,30.0,x,y,z))
	    {
	        SendClientMessage(i,7930026,message);
	    }
	}
}
KickPlayerVehicle(playerid,vehicleid)
{
	new Float:vs,Float:vy,Float:vz;
	GetVehiclePos(vehicleid,vs,vy,vz);
	SetPlayerPos(playerid,vs+0.5,vy,vz+1.0);
}
stock UpdateImmynitet(playerid)
{
	new str_immy[8];
	format(str_immy,8,"~g~%d",pInfo[playerid][immynitet]);
    PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][13],str_immy);
}
stock UpdateTemp(playerid)
{
	new str_temper[8];
	format(str_temper,8,"~g~%d",pInfo[playerid][temperatura]);
    PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][16],str_temper);
}
stock UpdateWater(playerid)
{
	new str_voda[8];
	format(str_voda,8,"~g~%d",pInfo[playerid][voda]);
	PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][15],str_voda);
	
	if(pInfo[playerid][voda]>69)
	{
	    PlayerTextDrawColor(playerid,PLAYER_DRAWS[playerid][5],0xFFFFFFAA);
	}
	else if (pInfo[playerid][voda]>29)
	{
	    PlayerTextDrawColor(playerid,PLAYER_DRAWS[playerid][5],0xFFFF00AA);
	}
	else if (pInfo[playerid][voda]>=0)
	{
	    PlayerTextDrawColor(playerid,PLAYER_DRAWS[playerid][5],0xFF0000AA);
	}
	PlayerTextDrawShow(playerid,PLAYER_DRAWS[playerid][5]);
}
stock UpdateGolod(playerid)
{
	new str_golod[8];
	format(str_golod,8,"~g~%d",pInfo[playerid][golod]);
	PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][14],str_golod);

	if(pInfo[playerid][golod]>69)
	{
	    PlayerTextDrawColor(playerid,PLAYER_DRAWS[playerid][6],0xFFFFFFAA);
	}
	else if (pInfo[playerid][golod]>29)
	{
	    PlayerTextDrawColor(playerid,PLAYER_DRAWS[playerid][6],0xFFFF00AA);
	}
	else if (pInfo[playerid][golod]>=0)
	{
	    PlayerTextDrawColor(playerid,PLAYER_DRAWS[playerid][6],0xFF0000AA);
	}
	PlayerTextDrawShow(playerid,PLAYER_DRAWS[playerid][6]);
}
stock SwitchDrawDownVirus(playerid)
{
	if(pInfo[playerid][preVirus]==1)
	{
		PlayerTextDrawColor(playerid,PLAYER_DRAWS[playerid][2],0xFFFF00AA);
		PlayerTextDrawShow(playerid,PLAYER_DRAWS[playerid][2]);
	}
}
stock SwitchDrawInRainOrWater(playerid)
{
	PlayerTextDrawColor(i,PLAYER_DRAWS[i][2],0xFFFFFFAA);
	PlayerTextDrawShow(i,PLAYER_DRAWS[i][2]);
}

stock GetRandom(value)
{
	if(random(100)<value)return 0;
	return 1;
}
new preGolod,
	preWater,
	preKrovotech,
	preYstalost;
forward SecondTimer();
public SecondTimer()
{
    preGolod++;
    preWater++;
    preKrovotech++;
    preYstalost++;
    
    foreach(Player, i)
	{
		if(pInfo[i][afktime]<3)//==0)
		{
		
		    
		    if(pInfo[i][Virus]==0)
		    {
		        if(pInfo[i][preVirus]>0)
		        {
		        	PlayerTextDrawColor(i,PLAYER_DRAWS[i][2],0x000000AA);
		        	PlayerTextDrawShow(i,PLAYER_DRAWS[i][2]);
		        	pInfo[i][preVirus]=0;
				}
		    }
			if(pInfo[i][Virus]==1)
			{
			    pInfo[i][preVirus]++;
			    SwitchDrawDownVirus(i);
			    if(pInfo[i][preVirus]==11)// за 11 секунд
			    {
			        if(pInfo[i][immynitet]>0)
			        {
			        	pInfo[i][immynitet]--;
			        	UpdateImmynitet(i);
					}
                    
                    pInfo[i][preVirus]=0;
			    }
			}
			else if(pInfo[i][Virus]==2)
			{
			    pInfo[i][preVirus]++;
			    SwitchDrawDownVirus(i);
			    if(pInfo[i][preVirus]==6)// за 6 секунд
			    {
					if(pInfo[i][immynitet]>0)
			        {
			        	pInfo[i][immynitet]--;
						UpdateImmynitet(i);
					}
                    
                    pInfo[i][preVirus]=0;
			    }
			}
			else if(pInfo[i][Virus]==3)
			{
			    pInfo[i][preVirus]++;
			    SwitchDrawDownVirus(i);
			    if(pInfo[i][preVirus]==3)// за 3 секунды
			    {
			        if(pInfo[i][immynitet]>0)
			        {
			        	pInfo[i][immynitet]--;
			        	UpdateImmynitet(i);
					}
                    pInfo[i][preVirus]=0;
			    }
			}
			else if(pInfo[i][Virus]==5)
			{
			}
			else if(pInfo[i][Virus]==7)
			{
			}
			else if(pInfo[i][Virus]==10)//буря
			{
			
			}
			
/////////////////////////////////////////////////////////////////////////////////////

			if(pInfo[i][Temp]<-4)//ночь
			{
			    if(pInfo[i][temperatura]>0)
			    {
			    	pInfo[i][temperatura]--;
			    	UpdateTemp(i);
			    }
				
			    
				if(pInfo[i][Temp]<-7)//-8 дождь , если игрок в трусах(обосанной одежде то дождь может давать -10)
				{
					if(pInfo[i][temperatura]<70)//если идет дождь и темпло игрока меньше 70 то
					{
					    if(GetRandom(70)==1)
					    {
							//заболеть
					    }
					}
				}
   //	pInfo[i][preVirus]
//	pInfo[i][preTemp]
			}
			else if(pInfo[i][Temp]==-3)//дождь
			{

			}
			else if(pInfo[i][Temp]==0)//ночь
			{
                pInfo[i][preTemp]++;
                if(pInfo[i][preTemp]==10)
                {
				    if(pInfo[i][temperatura]>0)
				    {
				    	pInfo[i][temperatura]--;
				    	UpdateTemp(i);
				    }
					pInfo[i][preTemp]=0;
				    
                }
			}
			else if(pInfo[i][Temp]==5)//дождь
			{
                pInfo[i][preTemp]++;
                if(pInfo[i][preTemp]==11)
                {
                    
					if(pInfo[i][temperatura]>0)
				    {
				    	pInfo[i][temperatura]--;
				    	UpdateTemp(i);
				    }
				    pInfo[i][preTemp]=0;
					
                }
			}
			else if(pInfo[i][Temp]>17)//костер ночью: 18 в бункере температура: 20
			{
				if(pInfo[i][temperatura]<100)
				{
				    pInfo[i][temperatura]++;
				    UpdateTemp(i);
				}
			}
			////////////////////////////////////////////////////////////////////
		    if(preGolod==53)
		    {
		        if(pInfo[i][golod]>0)
		        {
	                pInfo[i][golod]--;
					UpdateGolod(i);
				}
		    }
		    if(preWater==27)
		    {
		        if(pInfo[i][voda]>0)
		        {
			        pInfo[i][voda]--;
					UpdateWater(i);
				}
		        
		    }
		    if(pInfo[i][krov]==true&&preKrovotech==98)
		    {
		        new Float:heal;
		        GetPlayerHealth(i,heal);
				SetPlayerHealth(i,heal-6);
		    }
		    if(preYstalost==110)
			{
			    if(pInfo[i][son]>0)
			    {
			     //   new pson=pInfo[i][son]-1;
			       // if(pson>69)
			        pInfo[i][son]--;
					new str_ystl[8];
					format(str_ystl,8,"~g~%d",pInfo[i][son]);
				    PlayerTextDrawSetString(i,PLAYER_DRAWS[i][17],str_ystl);
				    
                    if(pInfo[i][son]>69)
					{
						   PlayerTextDrawColor(i,PLAYER_DRAWS[i][9],0xFFFFFFAA);
					}
					else if (pInfo[i][son]>29)
					{
					    PlayerTextDrawColor(i,PLAYER_DRAWS[i][9],0xFFFF00AA);
					}
					else if (pInfo[i][son]>=0)
					{
					    PlayerTextDrawColor(i,PLAYER_DRAWS[i][9],0xFF0000AA);
					}
					PlayerTextDrawShow(i,PLAYER_DRAWS[i][9]);
				    
			    }
			}
			if(pInfo[i][temperatura]<=49&&pInfo[i][effect]!=0)
			{
			    new tempa=pInfo[i][temperatura];
			    
			    if(tempa>=45)
			    {
			        TextDrawColor(DRAW_HOLOD,0xFFFFFF14);
			    }
			    else if(tempa>=40)
			    {
			        TextDrawColor(DRAW_HOLOD,0xFFFFFF1E);
			    }
			    else if(tempa>=35)
			    {
			        TextDrawColor(DRAW_HOLOD,0xFFFFFF32);
			    }
			    else if(tempa>=30)
			    {
			        TextDrawColor(DRAW_HOLOD,0xFFFFFF3C);
			    }
			    else if(tempa>=25)
			    {
			        TextDrawColor(DRAW_HOLOD,0xFFFFFF46);
			    }
			    else //if(tempa>=20)
			    {
			        TextDrawColor(DRAW_HOLOD,0xFFFFFF50);
			    }
			    TextDrawShowForPlayer(i,DRAW_HOLOD);
			    pInfo[i][effect]=2;
			}
			else if(pInfo[i][effect]==2)
			{
			    TextDrawHideForPlayer(i,DRAW_HOLOD);
			}
		    if(pInfo[i][afktime]>0)// 1,2
		    {
		        SetPlayerChatBubble(i,"[AFK] [0:1]",0x8000FFAA,10.0,1200);
		    }
	    }
	    else
	    {
	        if(pInfo[i][afktime]<62)
	        {
				new str_afk[40];


			//	af_sec==60?af://8421631 10.000000 time:1200
				format(str_afk,sizeof(str_afk),"Отошел: {CE0909}%d:%d{008080} мин. назад",pInfo[i][afktime]/60,pInfo[i][afktime]-1);

				SetPlayerChatBubble(i,str_afk,0x008080FF,10.0,1200);
			}
			else if(pInfo[i][torg]==false)
			{
				SetPlayerVirtualWorld(i,1);
			}
	    }
	//    new weaponid=GetPlayerWeapon(i);
	    if(GetPlayerWeapon(i)!=0)
	    {
	        if(IsPlayerInZZ(i))
	        {
	            SendClientMessage(i,0xFF000000,!"Вы находитесь в безопасной зоне! Тут запрещено доставать оружие!");
	            SetPlayerArmedWeapon(i,0);
	        }
	        if(GetLVL(i))
	        {
	            SendClientMessage(i,0xD2000000,!"У вас слишком мало авторитета, вам нельзя воевать, иначе вас выгонят из общины бункера!");
	            SetPlayerArmedWeapon(i,0);
	        }
	    }
	    pInfo[i][afktime]++;
	}
	if(preGolod==53)
	{
	    preGolod=0;
	}
	if(preWater==27)
	{
		preWater=0;
	}
	if(preKrovotech==98)
	{
	    preKrovotech=0;
	}
	if(preKrovotech==98)
	{
	    preKrovotech=0;
	}
	if(preYstalost==110)
	{
	    preYstalost=0;
	}
}
new hour,minute;
forward TimeUP();
public TimeUP()
{

    minute++;
	if(minute==60)
	{
	    minute=0;
	    hour++;
	    if(hour==24)
	    {
	    	hour=0;
	    }
	}
	
	else if(minute==23)//сменяемость погоды
	{
	    switch(random(20))
		{
			case 0..20:
			{
			}
		}
	}
	else if(minute==40)//сменяемость вируса
	{
	
	}
	
	
    foreach(Player, i)
	{
	    if(GetPlayerVirtualWorld(i)==0)
	    {
	        SetPlayerTime(i,hour,minute);
	        
	    }
	}
	
	
	new timestr[8];
	if(hour<10)
	{
	    format(timestr,sizeof(timestr),"0%d:",hour);
	}
	else
	{
	    format(timestr,sizeof(timestr),"%d:",hour);
	}
	if(minute<10)
	{
	    format(timestr,sizeof(timestr),"%s0%d",timestr,minute);
	}
	else
	{
	    format(timestr,sizeof(timestr),"%s%d",timestr,minute);
	}
	TextDrawSetString(DRAW_GLOBAL_TIME,timestr);
	
	if(hour==23&&minute==56)
	{
	    SendClientMessageToAll(0x80FF00AA,!"[ЗОМБИ] {C40000}На поверхности гуляет много зараженных!");
	    
	    switch(random(50))
	    {
	        case 20..30:
	        {
                SendClientMessageToAll(0x51FF0FAA,!"••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••");
                SendClientMessageToAll(0x80FF00AA,!"Как тут играть? {FF0000}Смотри:");
                SendClientMessageToAll(0x00DADFAA,!"1. {FF0000}Получи респиратор! {FFFF00}Его дают за работу на портного, он защитит тебя от вируса.");
                SendClientMessageToAll(0x00DADFAA,!"2. {FF0000}Выходи наповерхность! {FFFF00}Подбегай к разбитым машинам, ящикам, коробкам, ищи лут!");
                SendClientMessageToAll(0x00DADFAA,!"3. {FF0000}Заходи в здания! {FFFF00}Самый крутой лут ждет тебя в зданиях!");
                SendClientMessageToAll(0x00DADFAA,!"4. {FF0000}Выбирай время с умом! {FFFF00}Лут появляется в полночь, но в это время очень холодно.");
                SendClientMessageToAll(0x00DADFAA,!"5. {FF0000}Покупай снаряжение! {FFFF00}Большие рюкзаки, теплая одежда, транспорт и многое другое!");
                SendClientMessageToAll(0x51FF0FAA,!"••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••");
	        }
			case 31..40:
			{
			    SendClientMessageToAll(0xFF0000AA, !"••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••");
                SendClientMessageToAll(0x51FF0FAA, !"Респавн лута происходит в полночь (по игровому времени) или каждый час (по реальному).");
                SendClientMessageToAll(0x51FF0FAA, !"Поэтому, старайся успеть залутать выгодные места первым, сразу после полуночи!");
                SendClientMessageToAll(0x51FF0FAA, !"Бороться с холодом тебе поможет костер, теплый шмот, автомобиль с печкой или растирка!");
			    SendClientMessageToAll(0xFF0000AA, !"••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••");
			}
	    }
	    
	}
}

stock SetPlayerVW(playerid,world)
{
	if(world>0)
	{
		SendClientMessage(playerid,0xFF0000FF,"Не выходите из игры в этом здании!");
		
	}
	SetPlayerVirtualWorld(playerid,world);
}
#define SET_POS_ANGL(%0,%1,%2,%3,%4) SetPlayerPos(%0,%1,%2,%3),SetPlayerFacingAngle(%0,%4)

Float:GetPlayerSpeed(playerid)
{
    new Float:vx,Float:vy,Float:vz;
    if(IsPlayerInAnyVehicle(playerid)==0)
	{
		GetPlayerVelocity(playerid,vx, vy, vz);
	}
//	else
//	{
//		GetVehicleVelocity(GetPlayerVehicleID(playerid),vx, vy, vz);
//	}
    return /*floatround(*/floatsqroot(floatpower(floatabs(vx), 2.0) + floatpower(floatabs(vy), 2.0) + floatpower(floatabs(vz), 2.0)) * 105.0/*)*/;
}

public OnPlayerUpdate(playerid)
{
    pInfo[playerid][afktime]=0;
///////////////////////////////////////////////////////
    new anim=GetPlayerAnimationIndex(playerid);
    if(anim==1129||
        anim==1203||
        anim==1204 )
	{
	    if(pInfo[playerid][vivih]==false)
	    {
	        PlayerPlaySound(playerid,6003, 0.000000, 0.000000, 0.000000);
	        SendClientMessage(playerid,0xD20000AA,!"ОПАСНОСТЬ! {C0C0C0}У вас вывих! Используйте бинт или аптечку для перевязки!");
	        pInfo[playerid][vivih]=true;
	        PlayerTextDrawColor(playerid,PLAYER_DRAWS[playerid][11],0xFFFFFFAA);
	        PlayerTextDrawShow(playerid,PLAYER_DRAWS[playerid][11]);
	    }
	}
	if(anim==1195&&pInfo[playerid][vivih]==true)
	{
	    SetPlayerVelocity(playerid,0.0,0.0,0.0);
	    SendClientMessage(playerid,0xAFAFAFAA,!"Вы не можете прыгать или бежать, у вас вывих! Найдите бинты или аптечку!");
	}
	if(GetPlayerSpeed(playerid)>18.0&&pInfo[playerid][vivih]==true)
	{
	    SetPlayerVelocity(playerid,0.0,0.0,0.0);
	    SendClientMessage(playerid,0xAFAFAFAA,!"Вы не можете бежать, у вас вывих! Найдите бинты или аптечку!");
		ApplyAnimation(playerid,"WUZI","CS_Dead_Guy",4.000000, 0, 0,0,0,0);
	}

	GetPlayerPos(playerid,pInfo[playerid][pos_x],pInfo[playerid][pos_y],pInfo[playerid][pos_z]);

    return 1;
}
public OnPlayerSpawn(playerid)
{
	if(IsPlayerNPC(playerid)==0)
	{
		if(pInfo[playerid][spawned]==false)
		{
		    GivesPlayerMoney(playerid,50000);
		    Iter_Add(Player,playerid);
		    
		    pInfo[playerid][Temp]=20;
		    
		    pInfo[playerid][pol]=true;
		    
		    pInfo[playerid][immynitet]=100;
			pInfo[playerid][golod]=100;
			pInfo[playerid][voda]=100;
			pInfo[playerid][temperatura]=100;
			pInfo[playerid][son]=100;
			pInfo[playerid][nyjda]=100;
			pInfo[playerid][nastroenie]=100;
			
		    GivePlayerWeapon(playerid, 38, 5000);
		    SetPlayerColor(playerid,0xEAEAEAAA);
			TextDrawShowForPlayer(playerid, DRAW_BOX_KPK);
			TextDrawShowForPlayer(playerid, DRAW_GLOBAL_TIME);
			TextDrawShowForPlayer(playerid, DRAW_GTA_SAMP_logotype);

			ApplyAnimation(playerid,"COP_AMBIENT","Copbrowse_shake",4.099900, 0, 1,1,1,0);
			ApplyAnimation(playerid,"WUZI","CS_Dead_Guy",4.000000, 0, 0,0,0,0);
			ApplyAnimation(playerid,"CRACK","crckdeth4",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"PED","IDLE_ARMED",4.000000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"BD_FIRE","wash_up",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"PED","getup_front",4.000000, 0, 0,1,0,0);
			ApplyAnimation(playerid,"GRENADE","WEAPON_THROW",4.000000, 0, 0,1,0,0);
			ApplyAnimation(playerid,"FOOD","EAT_Vomit_P",4.000000, 0, 0,0,0,0);
			ApplyAnimation(playerid,"UZI","UZI_RELOAD",4.100000, 0, 1,1,0,0);
			ApplyAnimation(playerid,"PAULNMAC","PISS_LOOP",4.100000, 0, 1,1,0,0);
			ApplyAnimation(playerid,"SMOKING","M_smklean_loop",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"PED","fucku",4.000000, 0, 0,0,0,0);
			ApplyAnimation(playerid,"PED","SEAT_down",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"INT_OFFICE","OFF_Sit_Crash",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"Freeweights","gym_free_pickup",4.100000, 0, 0,0,1,0);
			ApplyAnimation(playerid,"Freeweights","gym_free_up_smooth",4.100000, 0, 0,0,1,0);
			ApplyAnimation(playerid,"Freeweights","gym_free_A",4.100000, 0, 0,0,1,0);
			ApplyAnimation(playerid,"Freeweights","gym_free_B",4.100000, 0, 0,0,1,0);
			ApplyAnimation(playerid,"Freeweights","gym_free_putdown",4.100000, 0, 0,0,1,0);
			ApplyAnimation(playerid,"BEACH","ParkSit_W_Loop",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"BEACH","SitnWait_loop_W",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"BEACH","Lay_Bac_Loop",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"GANGS","hndshkba",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"GANGS","smkcig_prtl",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"DANCING","dnce_M_b",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"DANCING","dnce_M_a",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"DANCING","dnce_M_b",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"DANCING","DAN_Down_A",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"DANCING","DAN_Left_A",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"DANCING","DAN_Loop_A",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"DEALER","DEALER_DEAL",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"DEALER","DEALER_IDLE_01",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"DEALER","DEALER_IDLE_03",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"DEALER","DRUGS_BUY",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"RYDER","RYD_Die_PT1",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"PED","facsurp",4.100000, 0, 1,1,0,0);
			ApplyAnimation(playerid,"GRAVEYARD","mrnF_loop",4.100000, 0, 1,1,0,0);
			ApplyAnimation(playerid,"INT_SHOP","shop_cashier",4.100000, 0, 1,1,0,0);
			ApplyAnimation(playerid,"OTB","wtchrace_win",4.100000, 0, 1,1,0,0);
			ApplyAnimation(playerid,"RAPPING","Laugh_01",4.000000, 0, 0,0,0,0);
			ApplyAnimation(playerid,"GANGS","hndshkfa_swt",4.000000, 0, 0,0,0,0);
			ApplyAnimation(playerid,"SHOP","ROB_Shifty",4.000000, 0, 0,0,0,0);
			ApplyAnimation(playerid,"DEALER","DRUGS_BUY",4.100000, 0, 1,1,0,0);
			ApplyAnimation(playerid,"BOMBER","BOM_Plant_Loop",2.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"PED","facgum",4.100000, 0, 1,1,1,0);
			ApplyAnimation(playerid,"CARRY","crry_prtial",4.000000, 0, 0,0,0,0);


			SetPlayerSkin(playerid,2);

			pInfo[playerid][spawned]=true;

			new PlayerText:textdrawid;


	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,34.0998, 333.3464, "~g~t: 20"); //
			PlayerTextDrawLetterSize(playerid,textdrawid, 0.2500, 1.2042);
			PlayerTextDrawAlignment(playerid,textdrawid, 1);
		//	PlayerTextDrawColor(playerid,textdrawid, 540875519);
			PlayerTextDrawSetOutline(playerid,textdrawid, 1);
		//	PlayerTextDrawBackgroundColor(playerid,textdrawid, 255);
			PlayerTextDrawFont(playerid,textdrawid, 1);
			PlayerTextDrawSetProportional(playerid,textdrawid, 1);
			PlayerTextDrawSetShadow(playerid,textdrawid, 0);

	        PLAYER_DRAWS[playerid][0]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,116.6026, 332.5396, "~g~v: 0"); // ?????
			PlayerTextDrawLetterSize(playerid,textdrawid, 0.2500, 1.0800);
			PlayerTextDrawAlignment(playerid,textdrawid, 1);
		//	PlayerTextDrawColor(playerid,textdrawid, 540875519);
			PlayerTextDrawSetOutline(playerid,textdrawid, 1);
		//	PlayerTextDrawBackgroundColor(playerid,textdrawid, 255);
			PlayerTextDrawFont(playerid,textdrawid, 1);
			PlayerTextDrawSetProportional(playerid,textdrawid, 1);
			PlayerTextDrawSetShadow(playerid,textdrawid, 0);

	        PLAYER_DRAWS[playerid][1]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////




			textdrawid = CreatePlayerTextDraw(playerid,475.000000,39.000000,"hud:radar_LocoSyndicate");

		//	PlayerTextDrawTextSize();
			PlayerTextDrawTextSize(playerid,textdrawid,15.000000,15.000000);

			PlayerTextDrawColor(playerid,textdrawid,0x000000AA);
	        PlayerTextDrawFont(playerid,textdrawid, 4);

	        PLAYER_DRAWS[playerid][2]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,595.000000,99.000000,"hud:radar_mafiaCasino");

			PlayerTextDrawTextSize(playerid,textdrawid,15.000000,15.000000);

			PlayerTextDrawColor(playerid,textdrawid,0xFFFFFFAA);
	        PlayerTextDrawFont(playerid,textdrawid, 4);
	        PLAYER_DRAWS[playerid][3]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,575.000000,99.000000,"hud:radar_centre");

			PlayerTextDrawTextSize(playerid,textdrawid,15.000000,15.000000);

			PlayerTextDrawColor(playerid,textdrawid,0xFFFFFFAA);
	        PlayerTextDrawFont(playerid,textdrawid, 4);
	        PLAYER_DRAWS[playerid][4]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,515.000000,99.000000,"hud:radar_diner");

			PlayerTextDrawTextSize(playerid,textdrawid,15.000000,15.000000);

			PlayerTextDrawColor(playerid,textdrawid,0xFFFFFFAA);
	        PlayerTextDrawFont(playerid,textdrawid, 4);
	        PLAYER_DRAWS[playerid][5]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,495.000000,99.000000,"hud:radar_dateFood");

			PlayerTextDrawTextSize(playerid,textdrawid,15.000000,15.000000);

			PlayerTextDrawColor(playerid,textdrawid,0xFFFFFFAA);
	        PlayerTextDrawFont(playerid,textdrawid, 4);
	        PLAYER_DRAWS[playerid][6]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,535.000000,99.000000,"hud:radar_tshirt");

			PlayerTextDrawTextSize(playerid,textdrawid,15.000000,15.000000);

			PlayerTextDrawColor(playerid,textdrawid,0xFFFFFFAA);
			PlayerTextDrawFont(playerid,textdrawid, 4);
			PLAYER_DRAWS[playerid][7]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,475.000000,99.000000,"hud:radar_girlfriend");

			PlayerTextDrawTextSize(playerid,textdrawid,15.000000,15.000000);

			PlayerTextDrawColor(playerid,textdrawid,0xFFFFFFAA);
			PlayerTextDrawFont(playerid,textdrawid, 4);
			PLAYER_DRAWS[playerid][8]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,555.000000,99.000000,"hud:radar_propertyG");

			PlayerTextDrawTextSize(playerid,textdrawid,15.000000,15.000000);

			PlayerTextDrawColor(playerid,textdrawid,0xFFFFFFAA);
			PlayerTextDrawFont(playerid,textdrawid, 4);
			PLAYER_DRAWS[playerid][9]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////


			textdrawid = CreatePlayerTextDraw(playerid,475.000000,79.000000,"particle:bloodpool_64");

			PlayerTextDrawTextSize(playerid,textdrawid,15.000000,15.000000);

			PlayerTextDrawColor(playerid,textdrawid,0x000000AA);
			PlayerTextDrawFont(playerid,textdrawid, 4);
			PLAYER_DRAWS[playerid][10]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,475.000000,19.000000,"particle:handman");

			PlayerTextDrawTextSize(playerid,textdrawid,15.000000,15.000000);

			PlayerTextDrawColor(playerid,textdrawid,0x000000AA);
			PlayerTextDrawFont(playerid,textdrawid, 4);
			PLAYER_DRAWS[playerid][11]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,475.000000,59.000000,"hud:radar_hostpital");

			PlayerTextDrawTextSize(playerid,textdrawid,15.000000,15.000000);

			PlayerTextDrawColor(playerid,textdrawid,0x000000AA);
			PlayerTextDrawFont(playerid,textdrawid, 4);
			PLAYER_DRAWS[playerid][12]=textdrawid;

	/////////////////////////////////////////////////////////////////////////////////


	/////////////////////////////////////////////////////////////////////////////////


			textdrawid = CreatePlayerTextDraw(playerid,478.000000,116.000000,"~g~100");//иммунитет
			PlayerTextDrawFont(playerid,textdrawid, 1);
			PlayerTextDrawSetShadow(playerid, textdrawid, 2);
			PlayerTextDrawSetOutline(playerid, textdrawid, 1);
	        PlayerTextDrawLetterSize(playerid,textdrawid,0.200000,1.000000);
	        PLAYER_DRAWS[playerid][13]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,498.000000,116.000000,"~g~100");//голод
			PlayerTextDrawFont(playerid,textdrawid, 1);
	        PlayerTextDrawSetShadow(playerid, textdrawid, 2);
			PlayerTextDrawSetOutline(playerid, textdrawid, 1);
	        PlayerTextDrawLetterSize(playerid,textdrawid,0.200000,1.000000);
	        PLAYER_DRAWS[playerid][14]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,518.000000,116.000000,"~g~100");//вода
			PlayerTextDrawFont(playerid,textdrawid, 1);
			PlayerTextDrawSetShadow(playerid, textdrawid, 2);
			PlayerTextDrawSetOutline(playerid, textdrawid, 1);
	        PlayerTextDrawLetterSize(playerid,textdrawid,0.200000,1.000000);
	        PLAYER_DRAWS[playerid][15]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,538.000000,116.000000,"~g~100");//тепло
			PlayerTextDrawFont(playerid,textdrawid, 1);
			PlayerTextDrawSetShadow(playerid, textdrawid, 2);
			PlayerTextDrawSetOutline(playerid, textdrawid, 1);
	        PlayerTextDrawLetterSize(playerid,textdrawid,0.200000,1.000000);
	        PLAYER_DRAWS[playerid][16]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,558.000000,116.000000,"~g~100");//усталость
			PlayerTextDrawFont(playerid,textdrawid, 1);
			PlayerTextDrawSetShadow(playerid, textdrawid, 2);
			PlayerTextDrawSetOutline(playerid, textdrawid, 1);
	        PlayerTextDrawLetterSize(playerid,textdrawid,0.200000,1.000000);
	        PLAYER_DRAWS[playerid][17]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,578.000000,116.000000,"~g~100");//моча
			PlayerTextDrawFont(playerid,textdrawid, 1);
			PlayerTextDrawSetShadow(playerid, textdrawid, 2);
			PlayerTextDrawSetOutline(playerid, textdrawid, 1);
	        PlayerTextDrawLetterSize(playerid,textdrawid,0.200000,1.000000);
	        PLAYER_DRAWS[playerid][18]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,598.000000,116.000000,"~g~100");//настроение
			PlayerTextDrawFont(playerid,textdrawid, 1);
			PlayerTextDrawSetShadow(playerid, textdrawid, 2);
			PlayerTextDrawSetOutline(playerid, textdrawid, 1);
	        PlayerTextDrawLetterSize(playerid,textdrawid,0.200000,1.000000);
	        PLAYER_DRAWS[playerid][19]=textdrawid;
	/////////////////////////////////////////////////////////////////////////////////



			{
		        new yr,monh,day;
		        getdate(yr,monh,day);
				new str_name[30];
		        format(str_name,sizeof(str_name),"~g~%s %d.%d.%d",pInfo[playerid][Name],day,monh,yr);

		        textdrawid = CreatePlayerTextDraw(playerid,547.000000,20.000000,str_name);//ник

		        PlayerTextDrawAlignment(playerid,textdrawid, 1);
				PlayerTextDrawSetOutline(playerid,textdrawid, 1);
				PlayerTextDrawBackgroundColor(playerid,textdrawid, 255);
				PlayerTextDrawSetProportional(playerid,textdrawid, 1);
				PlayerTextDrawSetShadow(playerid,textdrawid, 2);
				PlayerTextDrawFont(playerid,textdrawid, 1);
		        PlayerTextDrawLetterSize(playerid,textdrawid,0.170000,1.000000);

		        PLAYER_DRAWS[playerid][20]=textdrawid;
			}
			//////////////////////////////////////////////////////////////////////////////////////////////////
			textdrawid = CreatePlayerTextDraw(playerid, 417.250092, 188.081497,"0/0");//количество слотов лута в инвентаре

		    PlayerTextDrawAlignment(playerid,textdrawid, 2);
			PlayerTextDrawSetOutline(playerid,textdrawid, 1);
			PlayerTextDrawSetProportional(playerid,textdrawid, 1);
			PlayerTextDrawSetShadow(playerid,textdrawid, 0);
			PlayerTextDrawFont(playerid,textdrawid, 2);
			PlayerTextDrawColor(playerid,textdrawid,0x88FF00FF);
		    PlayerTextDrawLetterSize(playerid,textdrawid,0.233200, 1.732700);

			PLAYER_DRAWS[playerid][21]=textdrawid;

			////////////////////////////////////////////////////////////////////////////////////////////////

			textdrawid = CreatePlayerTextDraw(playerid,73.2000, 427.0000, "0 km/h"); // скорость
			PlayerTextDrawLetterSize(playerid,textdrawid, 0.300, 1.300);
			PlayerTextDrawAlignment(playerid,textdrawid, 1);
			PlayerTextDrawColor(playerid,textdrawid, 0xE1E1E1FF);
			PlayerTextDrawSetOutline(playerid,textdrawid, 1);
			PlayerTextDrawSetShadow(playerid,textdrawid, 2);
			PlayerTextDrawFont(playerid,textdrawid, 1);
			PlayerTextDrawSetProportional(playerid,textdrawid, 1);

	        PLAYER_DRAWS[playerid][22]=textdrawid;
	        
			////
			
			textdrawid = CreatePlayerTextDraw(playerid,130.0000, 427.0000, "~r~F"); // бензин
			PlayerTextDrawLetterSize(playerid,textdrawid, 0.300, 1.300);
			PlayerTextDrawAlignment(playerid,textdrawid, 1);
			PlayerTextDrawColor(playerid,textdrawid, 0xE1E1E1FF);
			PlayerTextDrawSetOutline(playerid,textdrawid, 1);
			PlayerTextDrawSetShadow(playerid,textdrawid, 2);
			PlayerTextDrawFont(playerid,textdrawid, 1);
			PlayerTextDrawSetProportional(playerid,textdrawid, 1);

	        PLAYER_DRAWS[playerid][23]=textdrawid;
			
			////
			
			textdrawid = CreatePlayerTextDraw(playerid,33.0000, 427.0000, "~r~+/-"); // аккумулятор
			PlayerTextDrawLetterSize(playerid,textdrawid, 0.300, 1.300);
			PlayerTextDrawAlignment(playerid,textdrawid, 1);
			PlayerTextDrawColor(playerid,textdrawid, 0xE1E1E1FF);
			PlayerTextDrawSetOutline(playerid,textdrawid, 1);
			PlayerTextDrawSetShadow(playerid,textdrawid, 2);
			PlayerTextDrawFont(playerid,textdrawid, 1);
			PlayerTextDrawSetProportional(playerid,textdrawid, 1);

	        PLAYER_DRAWS[playerid][24]=textdrawid;
	        ////////////////////////////////////////////////////////////////////////////////////////////////
	        for(new i=0;i<21;i++)
	        {
	            PlayerTextDrawShow(playerid,PLAYER_DRAWS[playerid][i]);
	        }
	        
	        pInfo[playerid][indikat]=true;
            SetPlayerPos(playerid,276.593231 ,1861.701904, 9.844080);//214.554916 ,1870.582642, 13.337500);

            
			SetPlayerPack(playerid,5);
			
		    GivePlayerLoot(playerid, 1);
		    GivePlayerLoot(playerid, 2);
		    GivePlayerLoot(playerid, 3);
		    
		    GivePlayerLoot(playerid, 14);
		    GivePlayerLoot(playerid, 15);
		    GivePlayerLoot(playerid, 16);
		    GivePlayerLoot(playerid, 17);
		    GivePlayerLoot(playerid, 18);
		    
		    GivePlayerLoot(playerid, 19);
		    GivePlayerLoot(playerid, 20);
		    GivePlayerLoot(playerid, 21);
		    GivePlayerLoot(playerid, 22);
		    GivePlayerLoot(playerid, 23);
		    
		    GivePlayerLoot(playerid, 24);
		    GivePlayerLoot(playerid, 25);
		    GivePlayerLoot(playerid, 26);
		    GivePlayerLoot(playerid, 27);
		    GivePlayerLoot(playerid, 28);

		    GivePlayerLoot(playerid, 29);
		    GivePlayerLoot(playerid, 30);
		    GivePlayerLoot(playerid, 31);
		    GivePlayerLoot(playerid, 32);
		    GivePlayerLoot(playerid, 33);
		    
			
		}
		else
		{
			SendClientMessage(playerid,0xFCAB14FF,"ПОДСКАЗКА: {FF8000}Онлайн-радио 'Сектор'! {00FF00}Нажмите N - КПК - Включить радио!");
			SendClientMessage(playerid,0x00FFFFFF,"ПОДСКАЗКА: {00AE00}Клавиши: {FF0000}Y {00AE00}- рюкзак, {FF0000}N {00AE00}- меню, {FF0000}F {00AE00}- подобрать предмет.");

			TogglePlayerControllable(playerid, true);
			SetPlayerPos(playerid,276.593231 ,1861.701904, 9.844080);
			

		}
		//SetPlayerPos(playerid,386.209991 ,2390.320068, 1890.949951);
        ShowPlayerDialog(playerid, 105, 0, !"{51FF0F}Справка", !"{FF8600}Справочная информация:\n\n{00FFFF}Новички могут работать на пошиве одежды, чтобы получить первый респиратор.\n{00FFFF}В госпитале новички могут получить бесплатное лечение от всех видов болезней!\n{FF8600}Основные индикаторы самочувствия:\n\n{E8D699}Индикаторы меняют цвет от состояния. При нулевых показателях вы начнете терять сознание!\n{FF0000}Голод:{E8D699} Отображается в виде ножа и вилки. Еду можно найти на поверхности.\n{FF0000}Жажда:{E8D699} Отображается в виде стакана. Воду можно найти на поверхности.\n{FF0000}Холод:{E8D699} Отображается в виде футболки. Не выходите ночью и в дождь.\n{FF0000}Иммунитет:{E8D699} Отображается в виде сердца. Не выходите без респиратора.\n{FF0000}Усталость:{E8D699} Отображается в виде домика. Нужно регулярно спать.\n{FF0000}Нужда:{E8D699} Отображается в виде капли. При нуле вы наделаете в штаны и испортите одежду!\n{FF0000}Настроение:{E8D699} Отображается в виде кубика. При нуле вы впадете в депрессию!\n\n{FF8600}Скрытые индикаторы (по умолчанию, чёрные):\n\n{FF0000}Опасность:{E8D699} Отображается в виде черепа. Зеленый: холод/вирус, Синий: влажность, Красный: бой.\n{FF0000}Вывих:{E8D699} Отображается в виде белой ладони и человека. Лечится бинтами или аптечкой!\n{FF0000}Вонь:{E8D699} Отображается в виде красной ладони и человека. Причина: в содержимом рюкзака.\n{FF0000}Болезнь:{E8D699} Отображается в виде медицинского креста. Лечится снадобьем.\n{FF0000}Кровотечение:{E8D699} Отображается в виде кляксы крови. Лечится бинтами или аптечкой.\n\n{FF8600}Датчики:\n\n{E8D699}У вас имеется КПК, который принимает письма и отображает следующие датчики:\n{FF0000}Тепловизор:{E8D699} Отображает метки людей рядом с вами.\n{FF0000}Часы:{E8D699} Отображает местное время.\n{FF0000}Сканер вирусов:{E8D699} Отображает наличие опасных вирусов рядом с вами. Используйте респиратор.\n{FF0000}Датчик температуры:{E8D699} Показывает вашу потерю тепла. При красном значении расходуется тепло, при зелёном накапливается.\n\n{FF8600}Команды:\n\n{E8D699}Клавиша {FF0000}Y{E8D699} открывает рюкзак. {E8D699}Клавиша {FF0000}N{E8D699} открывает личное меню.\n{FF0000}/жалоба{E8D699} Отправить жалобу на игрока.\n{FF0000}/фикс{E8D699} Вернуть личный байк туда, где вы его оставили (если он есть).\n", "Ок", "");

	}
	else
	{
	    if(playerid==0)//иваныч
	    {
	        SetPlayerSkin(0,290);//устанавливаем скин иванычу
    		SetPlayerPos(0,242.932159, 1856.489990, 8.757813);
			SetPlayerFacingAngle(0,269.460266);
	        SetPlayerColor(0,0xFFFFFF00);
	    }
	    else if(playerid==1)
	    {
	        printf("START_BRITVA");
	        SetPlayerSkin(1,287);//устанавливаем скин иванычу
    		SetPlayerPos(1,241.792740, 1849.141235, 8.764990);
			SetPlayerFacingAngle(1,269.460266);
	        SetPlayerColor(1,0xEAEAEAAA);
	        GivePlayerWeapon(1, 24, 1);
	    }
	}
	return 1;
	
}


public OnPlayerPickUpDynamicPickup(playerid, pickupid)
{
	printf("this->PICK:%d",pickupid);
	switch(pickupid)
	{
        case PICK_HOME:
        {
            SetPlayerChatBubble(playerid,"ищет ключи",0x007900AA,30.0,10000);
		
			ShowPlayerDialog(playerid,5000,2,"{D5D500}Аренда комнаты","{D1DBD0}Справка\n\
{D1DBD0}Зайти в свою комнату\n\
{D1DBD0}Зайти в чужую комнату\n\
{D1DBD0}Арендовать комнату {6CD900}5000 $\n\
","Ок","Нет");

        }
		case PICK_HOME_EXIT:
        {
        }
		case PICK_HOME_SEIF:
        {
        }
		case PICK_MASTER:
        {
            SET_POS_ANGL(playerid,291.9861,1831.1617,8.0244,334.2157);
        }
		case PICK_MASTER_EXIT:
        {
        	SET_POS_ANGL(playerid,296.5717,1824.6709,7.8281,81.7582);
        }

		case PICK_SPORTZAL:
        {
            SET_POS_ANGL(playerid,766.3372,-45.8374,1000.5859,355.0000);
            SetPlayerInterior(playerid,6);
        }

		case PICK_CLOTHES: // пошив одежды подработка новичкам или магазин одежды
        {
	        ShowPlayerDialog(playerid, 9525,2,"{FF0000}Куда вы хотите?","Магазин одежды\n\
	Подработка новичкам (получение респиратора)","Выбрать","Отмена");
        }
		case PICK_FABRICK_CLOTHES_EXIT:
        {
            pInfo[playerid][Clothes]=0;
        	pInfo[playerid][Ready_clothe]=0;
        	RemovePlayerAttachedObject(playerid,8);
            SET_POS_ANGL(playerid,284.3024,1814.6575,4.7031,400.0000);
        }
		case PICK_FABRICK_CLOTHES_A,
		    PICK_FABRICK_CLOTHES_B,
		  PICK_FABRICK_CLOTHES_C,
		PICK_FABRICK_CLOTHES_D:
        {
            if(pInfo[playerid][Clothes]<10&&IsPlayerHaveResp(playerid)==false)
            {
                ApplyAnimation(playerid,"CARRY","crry_prtial",4.1,0,1,1,1,1);
			    pInfo[playerid][Ready_clothe]=1;
            	SendClientMessage(playerid,0x008800FF,"Отправляйтесь к свободному столу!");
            	SetPlayerAttachedObject(playerid,8,1579,6, 0.071900,-0.105900,-0.118000,-111.500000,-0.200000,77.089996,1.000000,1.000000,1.000000);
            }
        }
		case PICK_SHOP_EXIT:
        {
            SET_POS_ANGL(playerid,284.3024,1814.6575,4.7031,40.0000);
            
        }
		case PICK_SPORTZAL_EXIT:
        {
        	SET_POS_ANGL(playerid,252.0831,1837.0751,4.7109,40.0000);
        	SetPlayerInterior(playerid,0);
        }
		case PICK_STELBISHE_EXIT,
			 PICK_SHRAM_EXIT:
		{
		    SET_POS_ANGL(playerid,206.0502,1867.1287,13.1375,302.6129);
        }
		case PICK_LIFT:
		{
			ShowPlayerDialog(playerid, 15222, 2, "{D5D500}ЛИФТ СЕКТОР?-2", "{D1DBD0}Стрельбище (обучение стрельбе)\n{D1DBD0}Шрам (наёмные убийцы)", "Ок", "Нет");
		}

	}
	printf("end pick");
	return 1;
}


public OnPlayerDeath(playerid, killerid, reason)
{

	pInfo[playerid][body_object]=CreateDynamicObject(2907,pInfo[playerid][pos_x],pInfo[playerid][pos_y],pInfo[playerid][pos_z]-1.0,    0.0,0.0,0.0,-1,-1,-1,30.0,30.0);
	pInfo[playerid][hand_object]=CreateDynamicObject(2906,pInfo[playerid][pos_x],pInfo[playerid][pos_y]+1.0,pInfo[playerid][pos_z]-1.0,0.0,0.0,0.0,-1,-1,-1,30.0,30.0);

	return 1;
}

public OnDialogResponse(playerid, dialogid, response, listitem, inputtext[])
{
	if(dialogid==1)
	{
	    if(response)
	    {
	    
	    	if(strlen(inputtext)>0)// ввведеном тексте больше нуля символов
	    	{
				if(strcmp(inputtext,pInfo[playerid][Password])==0)//если строка пароля совапало с тем что ввел игрок
				{
				    TextDrawShowForPlayer(playerid,DRAW_BLACK_SCREEN);
				    if(GetPVarInt(playerid,"reg")==0)
				    {
						if(GetPVarInt(playerid,"virtual")==0)
						{
						
						}
						else
						{

SendClientMessage(playerid, 0xFF0000AA,!"••••••••••••••••••••••••••••• АНТИ-БАГОЮЗ ••••••••••••••••••••••••••••");
SendClientMessage(playerid, 0xD20000AA,!"Вы покинули игру внутри здания. Это запрещено!");
SendClientMessage(playerid, 0xD20000AA,!"Вы очнулись в госпитале, все ващи вещи были утеряны.");

						}
				    }
				    else//если игрок только что зарегистрировался
				    {
						ShowPlayerDialog(playerid, 6,0,"\t", !"{51FF0F}Ваш пол?", !"Мужской", !"Женский");
				    }
				
				}
				else// если введеный текст не совпалс паролем
				{
					SetPVarInt(playerid,"er",GetPVarInt(playerid,"er")-1);
				    if(GetPVarInt(playerid,"er")==0)
					{
					    Kick(playerid);
					}
					else if(GetPVarInt(playerid,"er")==1)
	                   	ShowPlayerDialog(playerid, 4, 0,!"{FF0000}Ошибка!", !"{FF6347}Это неверный пароль!{FF6347}У тебя осталось {FF0000}1 {FF6347}попытка!" , !"Повтор", !"Выйти");
                    else
                    {
                    	ShowPlayerDialog(playerid, 4, 0,!"{FF0000}Ошибка!", !"{FF6347}Это неверный пароль!{FF6347}У тебя осталось {FF0000}2 {FF6347}попытки!" , !"Повтор", !"Выйти");
                    }
				}
	    	}
	    	else
	    	{
	    		new login_[140];
				format(login_,140, "\n{E8D699}Начни свой путь, {FF9900}%s!\n\n{FF0000}Введи свой пароль:",pInfo[playerid][Name]);
	            ShowPlayerDialog(playerid, 1, 3,"{51FF0F}Авторизация", login_, "Войти", "Отмена");
	    	}
		}
		else //если игрок в авторизации нажал esc
		{
			Kick(playerid);
		}
	}
	else if(dialogid==2)//диалог регистрации
	{
	    if(response)
	    {
	        //правила авторизация сюжет справка
			if(strlen(inputtext)>0)//если придуманный пароль больше 0 символов
			{
				ShowPlayerDialog(playerid, 3, 0, !"{51FF0F}Правила сервера", !"{FF0000}Правила GTA SA:MP SEKTOR-2:\n\n{00FF00}1.{E8D699} Все игровые аккаунты и их имущество является собственностью администрации проекта.\n{00FF00}2.{E8D699} Администрация не несет ответственности за утерянные игровые ценности.\n{00FF00}3.{E8D699} Пользователи (игроки) имеют право бесплатно пользоваться игрой, не нарушая предоставленных правил.\n{00FF00}4.{E8D699} За любое нарушение правил, игрок может быть заблокирован или оштрафован.\n{00FF00}5.{E8D699} Пожертвования проекту (донат) являются добровольным желанием и не являются обязательным условием.\n\n{FF0000}Запрещено:\n\n{E8D699}Использовать нецензурные, оскорбительные, провокационные, рекламные, нечитаемые и схожие ники!\n{E8D699}Использовать ЛЮБЫЕ сторонние программы, читы, скрипты, моды! {00FF00}Рекомендуем скачать GTA с нашего сайта.\n{E8D699}Заменять файлы в папке с игрой, в том числе устанавливать аддоны и сторонние русификаторы.\n{E8D699}Использовать или скрывать от администрации любые баги и ошибки в игре!\n{E8D699}Рекламировать и обсуждать ЛЮБЫЕ другие программы, игры и сайты. Делать массовые зазывы в соц сети и мессенджеры!\n{E8D699}Использовать ESC или сворачивать игру в целях ухода от погони/смерти.\n{E8D699}Оскорблять других игроков, а так же угрожать им расправой в реальной жизни.\n{E8D699}Нецензурно выражаться в чате, писать одно и тоже, писать сообщения без смысла или в верхнем регистре (Caps)\n{E8D699}Обсуждать и критиковать действия администрации, а так же негативно высказываться о сервере.\n{E8D699}Передавать и играть на чужих аккаунтах, а так же продавать и покупать аккаунты.\n{E8D699}Покупать и продавать игровую валюту и другое имущество, через других игроков, за реальные деньги.\n{E8D699}Принимать и передавать крупные денежные суммы. Если вы получили непонятные деньги, то сообщите администрации.\n{E8D699}Представляться администратором, модератором или любым другим сотрудником проекта, если вы таковым не являетесь.\n{E8D699}Игнорировать требования администрации.\n{E8D699}Создавать помехи игровому процессу в безопасных зонах (убивать, перегораживать путь, толкать транспорт и т.п.).\n{E8D699}Делать публичные заявления и угрозы об уходе из игры навсегда.\n\n{FF0000}Помните:\n\n{E8D699}Никогда, никому не давайте свой пароль! Администрация никогда не попросит его!\n{E8D699}Администрация имеет право заблокировать нарушителя без объяснения причин (согласно пункту 1).\n{E8D699}Ваша душа отныне принадлежит нам)\n{E8D699}Незнание правил не освобождает вас от ответственности!", "Принять >", "");
			}
			else
			{
			    CallLocalFunction("PlayerAutorizaed","d",playerid);
			}
	    }
		else
		{
			Kick(playerid);
		}
	
	}
	else if(dialogid==3)//правило которые показываются после регистрации
	{
	    SetPVarInt(playerid,"er",4);
		new login_[140];
		format(login_,140, "\n{E8D699}Начни свой путь, {FF9900}%s!\n\n{FF0000}Введи свой пароль:",pInfo[playerid][Name]);
        ShowPlayerDialog(playerid, 1, 3,"{51FF0F}Авторизация", login_, "Войти", "Отмена");
	}
	else if(dialogid==4)//ошибка это неверный пароль - вызывается из 1 диалога
	{
		if(response)
		{
    		new login_[140];
			format(login_,140, "\n{E8D699}Начни свой путь, {FF9900}%s!\n\n{FF0000}Введи свой пароль:",pInfo[playerid][Name]);
            ShowPlayerDialog(playerid, 1, 3,"{51FF0F}Авторизация", login_, "Войти", "Отмена");
		}
		else
		{
			Kick(playerid);
		}
	}
	else if(dialogid==6)//ваш пол
	{
	    if(response)// мужск
	    {
	        pInfo[playerid][pol]=true;
	    }
	    else//женский
	    {
	        pInfo[playerid][pol]=false;
	    }
	    ShowPlayerDialog(playerid, 7, 0, !"{51FF0F}Сюжет-1", !"{FC6C03}Врач:\n\n{E8D699}Долгие столетия человечество безжалостно эксплуатировало Землю.\n{E8D699}Ресурсы растрачивались негуманно. Выброс отходов постепенно уничтожал жителей планеты,\n{E8D699}В том числе и самого человека...\n{E8D699}Истощение ресурсов поставило высшую расу на колени и побудило на создание «новейшего биологического топлива».\n{E8D699}Оно, по плану, должно было спасти Землю от большего загрязнения, но, увы, эта мера была принята слишком поздно.\n{E8D699}Так как это было срочное вмешательство в катастрофу – топливо не прошло проверку и это стало фатальной ошибкой.\n{E8D699}Новый газ, образованный в процессе использования топлива, сделал атмосферу Земли слишком плотной.\n{E8D699}Планета перестала получать необходимое тепло. Новый, холодный мир имел идеальные условия для появления сложных вирусов.\n", "Дальше", "");

	}
	else if(dialogid==7)
	{
		ShowPlayerDialog(playerid, 8, 0, !"{51FF0F}Сюжет-2", !"{FC6C03}Врач:\n\n{E8D699}Безрезультатная борьба с болезнями привела лишь к тому, что вирусы стали устойчивы к нашим антибиотикам.\n{E8D699}Множество смертей, появление все более страшных эпидемий косило нашу расу тысячами ежедневно.\n{E8D699}И поздно пришло знание о том, что спастись можно глубоко под землей...\n{E8D699}Теперь, на поверхности земли остались лишь напоминания о том, что здесь когда-то были люди.\n{E8D699}Брошенные здания бывшей цивилизации стояли не тронутые и забытые.\n{E8D699}Выжившие перенесли многие напасти, обитая глубоко под землей, однако запасы воды и еды уже на исходе.\n{E8D699}Поэтому, появились многочисленные группировки мародеров, которые грабят пустые дома и продают провизию в бункеры.\n{E8D699}Эти ребята очень опасны, они не брезгуют убивать друг друга, чтобы обворовать и продать чужой хабар.\n{E8D699}Сейчас ходит много споров о том, что же хуже, смертельный вирус или встреча с мародерами.", "Дальше", "");
	}
	else if(dialogid==8)
	{
		ShowPlayerDialog(playerid, 9, 0, !"{51FF0F}Сюжет-3", !"{FC6C03}Врач:\n\n{E8D699}Ты находишься в одном из безопасных, подземных бункеров - в Сектор-2.\n{E8D699}Это одно из немногих мест холодного мира, где можно не опасаться мародеров.\n{E8D699}Нередко в Секторе под одной крышей собирались вражеские группировки - тут войны нет, это табу, которое все соблюдают.\n{E8D699}Люди знают, что без мирных бункеров им просто не выжить.\n{E8D699}Тут можно переждать бурю, купить снаряжение и провизию, а так же продать свой хабар.\n{E8D699}Иваныч тут главный, он мог бы предложить тебе работу, но знай - его люди обычно не возвращаются.\n{E8D699}Однако сейчас у тебя перед ним должок - охрана бункера нашла тебя недалеко, в горах и доставила сюда.\n{E8D699}Ты был ранен и находился без сознания. Иваныч дал указания подлатать тебя.\n{E8D699}Поговори с ним. Удачи!", "Дальше", "");
	}
	else if(dialogid==9)
	{
		SendClientMessageToAll(0x00FF00AA,!"{CB3434}СЛУХИ: {00D700}Ещё 1 новичок появился в бункере!");
		TextDrawHideForPlayer(playerid,DRAW_BLACK_SCREEN);
	}
	else if(dialogid==100)//нажал на лут в инвенторе и появилось меню:"что это? использовать..."
	{/*
"Что это?
Использовать
Выбросить
Передать
Предложить купить (игроку)
Продать торговцу (NPC)"*/
		if(response)
		{

		    new lot_pos= PLAYER_PRE_USE_[playerid];

		    new loot_type=PLAYER_LOOT_DRAW[playerid][lot_pos][loottype];//LOOT_KOLVO[playerid][PLAYER_LOOT_DRAW[playerid][lot_pos][loottype]][kolichectvo]==0)
		    if(loot_type>0)//если игрок умерт с активным этим диалогом
			{
				if(listitem==0)//что это
				{
				    new str_infoloot[200];
				    format(str_infoloot,sizeof(str_infoloot),"{00b300}Описание: {cfcfa0}%s\n{ff0000}Продать NPC:{80FF00} %d$\n{ff0000}Цена на торге: {80FF00}%d$",GetLootName(loot_type),InfoLoot[loot_type][TEXTloot],InfoLoot[loot_type][deneg_npc],InfoLoot[loot_type][deneg_p]);
					ShowPlayerDialog(playerid,465,0, GetLootName(loot_type), str_infoloot, !"OK","" );
				}
				else if(listitem==1)//использовать
				{
				    ApplyAnimation(playerid,"CARRY","crry_prtial",4.000000, 0, 0,0,0,0);
					use_loot(playerid,loot_type);
				}
				else if(listitem==2)//выбросить
				{
				    if(loot_type>8)
				    {
	                    if(IsPlayerInZZ(playerid)||GetPlayerVirtualWorld(playerid)!=0||GetPlayerInterior(playerid)!=0)
	                    {
	                    	if(IsPlayerInRangeOfPoint(playerid,3.2,255.8143, 1842.3452, 7.7619))//если игрок возле мусорки
							{

							}
							else
							{
							    SendClientMessage(playerid,0xAFAFAFAA,!"Не мусори тут!");
							}
	                    }
	                    else
	                    {
							new Float:z=-1.0;
							switch(loot_type)
							{
							    case 9,10,13,23,24,28,32,44,45,65:// яблоко, томат, бургер, рыба , жареная рыба , газировка, энергетик , респиратор, дрова, аптечка, ,
							    {
							        z=-0.9600;
							    }
							    case 12,79://сухой паек,тыква
							    {
							        z=-0.7760;
							    }
							    case 14,46://шаурма, спички
							    {
							        z=-0.9800;
							    }
		                        case 15,16,68,73,74://тушенки, мазь от зомби,фейрверки,
							    {
							        z=-0.9300;
							    }
							    case 33,34,38,40,82://бутылка с водой, бутылка с грязной водой, пустая бутылка, бронижелет,валентинка
							    {
							        z=-0.8800;
							    }
							    case 36://виски
							    {
							        z=-0.8500;
							    }
							    case 39,41,42,83://сигареты, карта, навигатор, части оружия
							    {
							        z=-0.9900;
							    }
							    case 54://термоящик
							    {
							        z=-1.1280;
		         				}
		         				case 55,56,57://канистра,канистра с бензином, инструменты
		         				{
		         				    z=-0.7000;
		         				}
		         				case 58,59,60,61,62,63://запчасти,рекопмлект для шик , запчасти для мото/вело, аккумулятор, био батарейка
		         				{
		         				    z=-1.0500;
		         				}
							/*	default: хлеб, вся одежда,*/
							}
							SubStractPlayerLoot(playerid,loot_type);
							CreateLoot(loot_type,pInfo[playerid][pos_x], pInfo[playerid][pos_y], pInfo[playerid][pos_z]+z, GetPlayerVirtualWorld(playerid), GetPlayerInterior(playerid));

							new str_vibrosit[65];

							format(str_vibrosit,65,"Выброшено из рюкзака: {FF8000}%s{DD0000}.",GetLootName(loot_type));
							SendClientMessage(playerid,0xDD000000,str_vibrosit);
						}
					}
					else
					{
                        SendClientMessage(playerid,0xD2000000,!"Этот предмет нельзя выбросить.");
					}
				}
				else if(listitem==3)//передать
				{
				    if(loot_type>8)
				    {
						if(pInfo[playerid][torg]==false)
						{
							ShowPlayerDialog(playerid, 2580, 1, !"{FF0000}Передать жителю", !"Введите ИД того, кому вы хотите отдать эту вещь",!"ОК",!"Отмена");
						}
						else
						{
						    SendClientMessage(playerid,0xD20000AA,!"Сначало перестаньте торговать.");
						}
					}
					else
					{
                        SendClientMessage(playerid,0xD2000000,!"Этот предмет нельзя передать.");
					}
				}
				else if(listitem==4)//предложить купить (игроку)
				{
				    if(loot_type>8)
				    {
						if(pInfo[playerid][torg]==false)
						{

	                    	ShowPlayerDialog(playerid,3580,1, !"{FF0000}Предложить купить:", !"Введите ИД того, кому вы хотите предложить эту вещь", !"Ок", !"Отмена");
						}
						else
						{
						    SendClientMessage(playerid,0xD20000AA,!"Сначало перестаньте торговать.");
						}
					}
					else
					{
                        SendClientMessage(playerid,0xD2000000,!"Этот предмет нельзя передать.");
					}
				}
				else //if(listitem==2)//продать торговцу
				{
				    new bool:NearBar=false,
				        bool:NearHospital=false;
				    
                    NearBar=1==IsPlayerInRangeOfPoint(playerid,3.36,244.490005, 1856.699951, 8.310000)?true:false;	//)//бар иваныча
                    
                    NearHospital=1==IsPlayerInRangeOfPoint(playerid,3.1,267.749176,1862.402832,8.162060)?true:false;	//госпиталь

					new cened=InfoLoot[loot_type][deneg_npc],
					//	 preBar=false,
						 bool:IsTrashLoot=false,
						 bool:IsMedikLoot=false,
						 str_prodaval[58];
					
					switch(loot_type)
					{
					    case 0..8 , 49..53:
					    {
					        IsTrashLoot=true;
					        SendClientMessage(playerid,0xD2000000,!"Этот предмет не продается.");
					    }
					    case 48://палатка
					    {
					        if(NearBar==true)
					        {
					            IsTrashLoot=true;
					            SendClientMessage(playerid,0xFC610300,!"Иваныч: {FF0000}Палатка совсем старая, местами уже рваная. Мне такая не нужна!");
					        }
					    }
					    case 78://бутылка с картой
					    {
					        if(NearBar==true)
					        {
					            IsTrashLoot=true;
					            SendClientMessage(playerid,0xFC610300,!"Иваныч: {FF0000}А что, если там использованная туалетная бумага? Мне это не нужно.");
					        }
					    }
						case 26://каша
						{
						    if(NearBar==true)
					        {
					            IsTrashLoot=true;
					            SendClientMessage(playerid,0xFC610300,!"Иваныч: {FF0000}Я не покупаю смонительные кулинарные рецепты.");
					        }
						}
						case 38,33,34://бутылки
						{
						    IsTrashLoot=true;
						    SendClientMessage(playerid,0xFC610300,!"Иваныч: {FF0000}Тут не пункт приема стеклотары!");
						}
					    case 9,20..22,30,31,35,36,71://
					    {
					        format(str_prodaval,58,"продано");
					    }
					    case 10..13,19,29,32,40,42,44,54,59,61,88,90,91,93,95,97,99,101,105,109,111://
					    {
					        format(str_prodaval,58,"продан");
					    }
					    case 27,39,45,46,58,60,63,83,89://
					    {
					        format(str_prodaval,58,"проданы");
					    }
					    case 14..18,23..25,28,37,41,43,47,56,57,70,75,79,82,84..87,103,107,112,113..142://
					    {
					        format(str_prodaval,58,"продана");
					    }
					    case 64://бинт
					    {
					        IsMedikLoot=true;
					        format(str_prodaval,58,"Бинт продан в госпиталь, за {FF0000}%d${008800}!",cened);
					    }
					    case 65,67..69://аптечка растирка мазь_от_зомби целебная трава
					    {
					        IsMedikLoot=true;
					        format(str_prodaval,58,"%s продана в госпиталь, за {FF0000}%d${008800}!",GetLootName(loot_type),cened);
					    }
					    case 66://снадобье
					    {
					        IsMedikLoot=true;
					        format(str_prodaval,58,"Снадобье продано в госпиталь, за {FF0000}%d${008800}!",cened);
					    }

					}
					if(IsTrashLoot==false)
					{
						if(NearBar==true&&IsMedikLoot==false)
						{
						    SetPlayerChatBubble(0,"рассматривает хабар",0x007900AA,30.0,10000);
						    GivesPlayerMoney(playerid,cened);
						    format(str_prodaval,58,"%s %s за {FF0000}%d${008800}!",GetLootName(loot_type),str_prodaval,cened);
							SendClientMessage(playerid,0x00880000,str_prodaval);
						}
						else if(NearBar==false&&IsMedikLoot==false)
						{
							SendClientMessage(playerid,0xD2000000,!"Вы должны быть у бара, в бункере Сектор-2!");
						}
						else if(NearBar==true&&IsMedikLoot==true)
						{
							SendClientMessage(playerid,0xFC610300,!"Иваныч: {FFFFFF}Я не покупаю медикаменты! Иди с этим в госпиталь, к главврачу.");
						}
						else if(NearHospital==true&&IsMedikLoot==true)
						{
						    GivesPlayerMoney(playerid,cened);
						    SendClientMessage(playerid,0x00880000,str_prodaval);
						}
						else if(NearHospital==false&&NearBar==false&&IsMedikLoot==true)
						{
						    SendClientMessage(playerid,0xD2000000,!"Медикаменты можно продать только в госпитале, в бункере Сектор-2!");
						}
					
					}
					//
				}

			}
			else
			{
			    //у вас этого нет
			}


		}
	}
	else if(dialogid==110)
	{
/*	ShowPlayerDialog(playerid, 110,2,"{00FF00}Бар бункера 'Сектор-2'","
{DADAB6}Поговорить с барменом\n\
{FF8000}Задания на поверхности\n\
{FF8000}Работа в бункере (вакансии)\n\
{00BB00}Денежное хранилище\n\
{6BB6B6}Бар Иваныча\n\
{0080FF}Оружие\n\
{0080FF}Патроны\n\
{0080FF}Снаряжение\n\
{0080FF}Драгоценности","Выбрать","Закрыть");*/

		if(response)
		{
			if(listitem==0)//Поговорить с барменом
			{
				ShowPlayerDialog(playerid,112,2,!"{00FF00}Бармен",
!"Что происходит?\n\
Что делать?\n\
Где достать провизию?\n\
Где достать снаряжение?\n\
Как вступить в бригаду?\n\
Как сохранить вещи?\n\
Есть другие места с выжившими?\n\
Ты спас меня?\n\
Кто ты?\n\
У тебя есть какие-то проблемы?\n\
Ты правишь тут один?",!"Выбрать",!"Закрыть");


			}
			else if(listitem==1)//задания на поверхности
			{
				ShowPlayerDialog(playerid, 118,2,!"{00FF00}Бармен: выбери задание",
!"{FFFFFF}Доставка продовольствия\n\
{FFFFFF}Доставка холодного оружия\n\
{FFFFFF}Курьер",!"Выбрать",!"Закрыть");
			}
			else if(listitem==2)//работы в бункере(вакансии)
			{
				ShowPlayerDialog(playerid, 122,2,!"{00FF00}Бармен: Вакансии",!"{C5C589}Работа в госпитале {FF0000}(МЕДИК)\n\
{C5C589}Работа в мастерской {FF0000}(ОРУЖЕЙНИК)\n\
{C5C589}Работа на радио {FF0000}(РАДИОВЕДУЩИЙ)\n\
{C5C589}Работа на Шрама {FF0000}(НАЕМНИК)",!"Выбрать",!"Закрыть");
			}
			else if(listitem==3)//денежное хранилище
			{
			    new str_xranili[135];//38+29+30+34+32+6]
			    
			    format(str_xranili,135,
"{C5C589}Денег на сохранении: %d $\n\
{C5C589}Денег на КПК: %d $\n\
{C5C589}Пополнить счет КПК\n\
{C5C589}Передать деньги жителю",pInfo[playerid][money],pInfo[playerid][kpkmoney]);

				ShowPlayerDialog(playerid, 117,2,!"{D34305}Хранилище",str_xranili,!"Выбрать",!"Закрыть");

			}
			else if(listitem==4)//бар иваныча
			{
				ShowPlayerDialog(playerid, 10113,2,!"{D34305}БАР",
!"{C5C589}Заказать легкую закуску {6DF709}25$\n\
{C5C589}Заказать сытное блюдо {6DF709}80$\n\
{C5C589}Заказать стакан воды {6DF709}20$\n\
{C5C589}Заказать алкоголь {6DF709}30$",!"Купить",!"Закрыть");/*\n\
{C5C589}Бесплатно поесть {6DF709}авторитетам\n\
{C5C589}Бесплатно выпить {6DF709}авторитетам"*/
			}
			else if(listitem==5)//оружие
			{
				ShowPlayerDialog(playerid, 114,2,!"{D34305}Купить оружие",
!"{FF0000}Пистолет {C5C589}Токарева {6DF709}100$\n\
{FF0000}Пистолет {C5C589}Пустынный орёл {6DF709}2000$\n\
{FF0000}Дробовик {C5C589}Помповый {6DF709}300$\n\
{FF0000}Дробовик {C5C589}Самозарядный {6DF709}1000$\n\
{FF0000}Пистолет-пулемет {C5C589}УЗИ {6DF709}500$\n\
{FF0000}Автомат {C5C589}Калашникова {6DF709}1000$",!"Купить",!"Закрыть");/*\n\
{FF0000}Улучшение {C5C589}Большая обойма (на тт/дигл/узи/ак/м4) {6DF709}1000$*/
			}
			else if(listitem==6)//патроны
			{
				ShowPlayerDialog(playerid, 115,2,!"{D34305}Патроны",
!"{C5C589}Для 'Токарева' {6DF709}5$\n\
{C5C589}Для 'Пустынный орёл' {6DF709}30$\n\
{C5C589}Для 'Обрез' {6DF709}10$\n\
{C5C589}Для 'Помповый дробовик' {6DF709}20$\n\
{C5C589}Для 'Самозарядный дробовик' {6DF709}25$\n\
{C5C589}Для 'УЗИ' {6DF709}30$\n\
{C5C589}Для 'Калашникова' {6DF709}50$\n\
{C5C589}Для 'М4' {6DF709}50$\n\
{C5C589}Ракета для 'РПГ' {6DF709}200$",!"Купить",!"Закрыть");
			}
			else if(listitem==7)//снаряжение
			{
			ShowPlayerDialog(playerid, 116,2,!"{D34305}Снаряжение (рюкзаки сохраняются)",
!"{C5C589}Для хранения вещей\n\
{C5C589}Для походов\n\
{C5C589}Для транспорта",!"Купить",!"Закрыть");
			}
			else if(listitem==8)//драгоценности
			{
				#warning select dialog 1122
	   			ShowPlayerDialog(playerid, 1122,2,!"{D34305}Драгоценности",!"{C5C589}Золото {6DF709}150$",!"Купить",!"Закрыть");
			}
		}
	}
	else if(dialogid==112)//вопросы иванычу
	{
 /*
 				"Что происходит?\n\
	Что делать?\n\
	Где достать провизию?\n\
	Где достать снаряжение?\n\
	Как вступить в бригаду?\n\
	Как сохранить вещи?\n\
	Есть другие места с выжившими?\n\
	Ты спас меня?\n\
	Кто ты?\n\
	У тебя есть какие-то проблемы?\n\
	Ты правишь тут один?
 */
  		if(response)
	    {
	        SendClientMessage(playerid,-1,"  ");
	    	if(listitem==0)
	        {
                SendClientMessage(playerid,-1,"1.{FC6103}ВЫ: {FFFFFF}Что тут происходит?");
                SendClientMessage(playerid,-1,"1.{FC6103}Иваныч: {FFFFFF}Все просто пытаются выжить подольше в этом холодном мире.");
	        }
	    	else if(listitem==1)
	        {
				SendClientMessage(playerid,-1,"1.{FC6103}ВЫ: {FFFFFF}Что мне делать?");
				SendClientMessage(playerid,-1,"1.{FC6103}Иваныч: {FFFFFF}Хах! Решай сам - можешь ждать голодной смерти тут.");
				SendClientMessage(playerid,-1,"1.{FC6103}Иваныч: {FFFFFF}А можешь попробовать вылезти на поверхность.");
				SendClientMessage(playerid,-1,"1.{FC6103}Иваныч: {FFFFFF}Кстати, если решишься уйти - у меня найдется для тебя работёнка");
			}
	        else if(listitem==2)
	        {
				SendClientMessage(playerid,-1,"{FC6103}ВЫ: {FFFFFF}Где мне достать еду и питье?");

				SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}Запасы бункера на исходе. Мародеры, конечно, приносят хабар, но этого мало.");

				SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}Поэтому, тут можно получить свой хлеб, только оплатив его!");

				SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}Ну либо можешь попробовать найти что-то на поверхности, там еще много всего.");
	        }
	        else if(listitem==3)
	        {

				SendClientMessage(playerid,-1,"{FC6103}ВЫ: {FFFFFF}Где достать снаряжение и оружие для похода на поверхность?");

				SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}Часть полезных вещей можно купить у меня, а за остальным надо идти на поверхность.");

	        }
	        else if(listitem==4)
	        {
				SendClientMessage(playerid,-1,"{FC6103}ВЫ: {FFFFFF}Как вступить в чью-то бригаду?");

				SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}У каждой бригады свои условия. Найди лидера и поговори с ним.");

				SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}Если у тебя есть достаточно людей, то ты можешь создать и свою бригаду!");

				SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}Главное помни - никакой войны в бункере!");
	        }
	        else if(listitem==5)
	        {

				SendClientMessage(playerid,-1,"{FC6103}ВЫ: {FFFFFF}Как мне сохранить свои вещи?");

				SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}Любой хабар можно продать мне, а твои деньги я спрячу в ячейку бункера.");

				SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}Но если тебе нужно сохранить именно какую-то вещь, то для этого надо арендовать комнату.");

	        }
	        else if(listitem==6)
	        {
					SendClientMessage(playerid,-1,"{FC6103}ВЫ: {FFFFFF}Есть другие места с выжившими?");

					SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}На сколько мне известно, тут самое крупное поселение.");

					SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}На поверхности можно повстречать различные лагеря и убежища, но они не такие, как это.");

					SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}У нас тут община. Мы соблюдаем ряд правил, что позволяет нам выживать под одной крышей.");

					SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}Если и ты решишь тут остаться, то тоже будешь вынужден их соблюдать.");
	        }
	        else if(listitem==7)
	        {

				SendClientMessage(playerid,-1,"{FC6103}ВЫ: {FFFFFF}Ты спас меня? Значит за мной должок!");

				SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}Да, тут принято отдавать свои долги.");

				SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}У меня есть несколько заданий для тебя, сообщи, как только захочешь начать поход.");
	        }
	        else if(listitem==8)
	        {

				SendClientMessage(playerid,-1,"{FC6103}ВЫ: {FFFFFF}Кто ты?");

				SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}Я владею этим местом и это не так просто, как может показаться.");

				SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}Сложновато держать в одном месте столько людей, да еще и в условиях апокалипсиса.");

				SendClientMessage(playerid,-1,"{FC6103}Иваныч: {FFFFFF}Я тот самый баланс, который дает шанс выжить всем присутствующим.");
	        }
	        else if(listitem==9)
	        {

				SendClientMessage(playerid,-1,"1.{FC6103}ВЫ: {FFFFFF}У тебя есть какие-то проблемы?");

				SendClientMessage(playerid,-1,"2.{FC6103}Иваныч: {FFFFFF}Ха-ха! Конечно у меня есть проблемы, а у кого их сейчас нет?");

				SendClientMessage(playerid,-1,"3.{FC6103}Иваныч: {FFFFFF}Снаружи на бункер постоянно нападают зараженные, а внутри происходят стычки");

				SendClientMessage(playerid,-1,"4.{FC6103}Иваныч: {FFFFFF}между выжившими. Люди постоянно умирают от вирусов, голода или конфликтов.");

				SendClientMessage(playerid,-1,"5.{FC6103}Иваныч: {FFFFFF}А кого они винят в этом? Конечно же, власть, то есть меня.");

				SendClientMessage(playerid,-1,"6.{FC6103}Иваныч: {FFFFFF}Я не могу накормить всех, людям приходится выходить на поверхность за пропитанием,");

				SendClientMessage(playerid,-1,"7.{FC6103}Иваныч: {FFFFFF}но когда они не возвращаются, то их семьи винят меня, будто бы я виновен в их гибели!");
	        }
	        if(listitem==10)
	        {
				
	
			SendClientMessage(playerid,-1,"1.{FC6103}ВЫ: {FFFFFF}Ты правишь тут один?");

			SendClientMessage(playerid,-1,"2.{FC6103}Иваныч: {FFFFFF}Конечно, нет. Бункер уже давно разбит на части и тут можно найти много влиятельных людей");

			SendClientMessage(playerid,-1,"3.{FC6103}Иваныч: {FFFFFF}В госпитале работают врачи и я даже не лезу в их дела.");

			SendClientMessage(playerid,-1,"4.{FC6103}Иваныч: {FFFFFF}В гаражах управляет Механик, он нормальный мужик и руки у него явно растут из нужного места!");

			SendClientMessage(playerid,-1,"5.{FC6103}Иваныч: {FFFFFF}Пара цехов досталась Портному, он шьет отличные шмотки но и цены ломит не хилые.");

			SendClientMessage(playerid,-1,"6.{FC6103}Иваныч: {FFFFFF}Есть мастерская оружейника, в которой руководит Мастер. Крутые вещички он там делает!");

			SendClientMessage(playerid,-1,"7.{FC6103}Иваныч: {FFFFFF}Имеются и темные личности, не советую с ними связываться, например, наемник Шрам.");
	        }
	    }
	}
	else if(dialogid==116)//снаряжение
 	{
 		if(response)
	    {
	        if(listitem==0)//рюкзаки
	        {
ShowPlayerDialog(playerid, 1116,2,"{D34305}Cнаряжение (рюкзаки сохраняются при гибели)","{C5C589}Рюкзак-мини (20 ячеек) {6DF709}2000$\n\
{C5C589}Рюкзак-средний (30 ячеек) {6DF709}10000$\n\
{C5C589}Рюкзак-большой (40 ячеек) {6DF709}20000$\n\
{C5C589}Рюкзак-огромный (50 ячеек) {6DF709}40000$\n\
{C5C589}Термоящик {6DF709}250$","Купить","Закрыть");
	        }
	        else if(listitem==1)//для похода
	        {
	        ShowPlayerDialog(playerid, 1117,2,"{D34305}Снаряжение для похода","{C5C589}Спички {6DF709}10$\n\
{C5C589}Сигареты {6DF709}20$\n\
{C5C589}Рация {6DF709}20$\n\
{C5C589}Часы {6DF709}20$\n\
{C5C589}Часы с будильником {6DF709}30$\n\
{C5C589}Карта {6DF709}10$\n\
{C5C589}Бронежилет {6DF709}100$\n\
{C5C589}Респиратор обычный {6DF709}50$\n\
{C5C589}Респиратор улучшенный {6DF709}100$\n\
{C5C589}Био-батарейка {6DF709}400$","Купить","Закрыть");
	        }
	        else if(listitem==2)// для транспорта
	        {
ShowPlayerDialog(playerid, 1118,2,"{D34305}Снаряжение для транспорта","{C5C589}Канистра (пустая) {6DF709}40$\n\
{C5C589}Канистра с бензином{6DF709}60$\n\
{C5C589}Аккумулятор{6DF709}100$\n\
{C5C589}Набор инструментов {6DF709}100$","Купить","Закрыть");
	        }
		}
 	}
	else if(dialogid==117)//денежное хранилище
	{
 		if(response)
	    {
	    /*
	    "{C5C589}Денег на сохранении: %d $\n\
{C5C589}Денег на КПК: %d $\n\
{C5C589}Пополнить счет КПК\n\
{C5C589}Передать деньги жителю
	    */
	        if(listitem==0||listitem==1)
	        {
	            CallLocalFunction("OnDialogResponse","dddds",playerid,110,1,3,"");

	        }
	        else 
	        {
	            if(GetLVL(playerid)>0)//getlvl - это макрос или #define
	            {
					if(listitem==2)
	        		{
						new str_kpk[50];
						format(str_kpk,50,"У вас в хранилище: %d $\nВведите сумму, которую хотите положить на КПК",pInfo[playerid][money]);
	        			ShowPlayerDialog(playerid, 8816,1, !"{D34305}Хранилище", str_kpk, !"Ок", !"<< Назад");
	        		}
	        		else// if(listitem==3)
	        		{
	        		    ShowPlayerDialog(playerid, 8817,1, !"{51FF0F}Денежный перевод", !"Введите ИД того, кому хотите перевести деньги:", !"Ок", !"Отмена");
	        		}
	            }
	            else
	            {
	                SendClientMessage(playerid,0xB4B5B7FF,!"{FC6103}Иваныч: {FFFFFF}Сначала заслужи хоть какой-то авторитет!");
	                SendClientMessage(playerid,0xB4B5B7FF,!"Требуется уровень авторитета: 1.");
	            }
	        }
	    }
	}
	else if(dialogid==118)//задания на поверхности
	{
		if(response)
		{
		    if(listitem==0)
		    {
		    ShowPlayerDialog(playerid, 119,2,"{00FF00}Продовольственные задания","{C5C589}Взять задание\n\
{C5C589}Сдать задание","Выбрать","Закрыть");
		    }
		    else if(listitem==1)
		    {
		    ShowPlayerDialog(playerid, 120,2,"{00FF00}Доставка холодного оружия","{C5C589}Взять задание\n\
{C5C589}Сдать задание","Выбрать","Закрыть");
		    }
		    else if(listitem==2)//курьер
		    {
		    }
		    
		}
	}
	else if(dialogid==119)//работа продоволственная
	{
	    if(response)
	    {
	        if(listitem==0)//взять
	        {
	        	if(pInfo[playerid][zprodov]==0)
	            {
	                new zprod=random(3);
	                zprod++;
                    if(zprod==1)//молоко
		            {
	                	SendClientMessage(playerid,-1263159297,"{FC6103}Иваныч: {FFFFFF}Люди до сих пор верят в пользу молока, хоть оно и готовится уже только из порошка."); //-1263159297
						SendClientMessage(playerid,-1263159297,"{FC6103}Иваныч: {FFFFFF}Принеси мне штук 5 бутылок молока? Жители бункера это оценят!"); //-1263159297
		            }
		            else if(zprod==2)//виски
		            {
		            }
		            else if(zprod==3)//тушенка
		            {
		            }
		            pInfo[playerid][zprodov]=zprod;
	            }//я же давал тебе задание
				else if(pInfo[playerid][zprodov]==1)//я же давал тебе задание молоко
	            {
	            
	            }
	            else if(pInfo[playerid][zprodov]==2)//я же давал тебе задание виски
	            {
	            }
	            else if(pInfo[playerid][zprodov]==3)//я же давал тебе задание тушенка
	            {
	            }
	        }
	        else//сдать
	        {
	            if(pInfo[playerid][zprodov]>0)
	            {
	            }
	            else
	            {
	                SendClientMessage(playerid,0xD20000AA,"Вы не брали задание!");
	            }
	    //    	zprodov,//задания продовольствия у иваныча
//	zholodn,//задание холодного оружия у иваныча

	        }
	    }
	}
	else if(dialogid==120)//работа холодного оружия
	{
	    if(response)
	    {
	        if(listitem==0)//взять холодного оружия
	        {
	            new zhol=random(4);
	            zhol++;
				SendClientMessage(playerid,-1263159297,"{FC6103}Иваныч: {FFFFFF}С пустыми руками на поверхность сейчас ходят только глупцы! Всем нужно оружие!"); //-1263159297
				SendClientMessage(playerid,-1263159297,"{FC6103}Иваныч: {FFFFFF}Но не все могут убивать людей, поэтому холодное оружие ещё пользуется спросом."); //-1263159297

				if(zhol==1)//бейсбольную биту
	            {
					SendClientMessage(playerid,-1263159297,"{FC6103}Иваныч: {FFFFFF}У меня есть заказ на бейсбольную биту, принесешь?");
	            }
	            else if(zhol==2)//дубинка
	            {
	            	SendClientMessage(playerid,-1263159297,"{FC6103}Иваныч: {FFFFFF}У меня есть заказ на полицейскую дубинку, принесешь?");

	            }
	            else if(zhol==3)//штыковую лопата
	            {
				//	SendClientMessage(playerid,-1263159297,"{FC6103}Иваныч: {FFFFFF}? ??????? ?????? ?? ??????????? ?????? ????? ?????? ??????! ???? ????? ??????!
				//	SendClientMessage(playerid,-1263159297,"{FC6103}Иваныч: {FFFFFF}?? ?? ??? ????? ??????? ?????, ??????? ???????? ?????? ??? ?????????? ???????.
					SendClientMessage(playerid,-1263159297,"{FC6103}Иваныч: {FFFFFF}У меня есть заказ на штыковую лопату, принесешь?");
	            }
				else if(zhol==4)//катана
				{
				//	SendClientMessage(playerid,-1263159297,"{FC6103}Иваныч: {FFFFFF}С пустыми руками на поверхность сейчас ходят только глупцы! Всем нужно оружие!");
				//	SendClientMessage(playerid,-1263159297,"{FC6103}Иваныч: {FFFFFF}Но не все могут убивать людей, поэтому холодное оружие ещё пользуется спросом.");
					SendClientMessage(playerid,-1263159297,"{FC6103}Иваныч: {FFFFFF}У меня есть заказ на катану, принесешь?");
				}
				pInfo[playerid][zholodn]=zhol;
	        }
	        else//сдать холодного оружия
	        {
	            if(pInfo[playerid][zholodn]>0)
	            {
	            }
	            else
	            {
	                SendClientMessage(playerid,0xD20000AA,"Вы не брали задание!");
	            }
	    //    	zprodov,//задания продовольствия у иваныча
//	zholodn,//задание холодного оружия у иваныча

	        }
	    }
	}
	else if(dialogid==122)//Вакансии
	{
		if(response)
	    {
	        if(listitem==0)//медик
	        {
			ShowPlayerDialog(playerid, 123,2,"{00FF00}Работа в бункере","{C5C589}Устроиться на работу в госпиталь\n\
{C5C589}Уволиться","Выбрать","Закрыть");
	        }
	        else if(listitem==1)//оружейник
	        {
ShowPlayerDialog(playerid, 1024,2,"{00FF00}Работа в бункере","{C5C589}Устроиться на работу в мастерскую\n\
{C5C589}Уволиться","Выбрать","Закрыть");
	        }
	        else if(listitem==2)//радиоведущий
	        {
	        }
	        else if(listitem==3)//наемники
	        {
	        }
	    }
	}
	else if(dialogid==1001)
	{
	  //  for(new i=0;i<20;i)
	   // {
	   // }
		if(response)
		{
		    if(IsValidDynamicObject(DropLoot[PreLoot[playerid][listitem]][dynO]))
			{
			    if(isInvNotFull(playerid))
			    {
			        new item_call=PreLoot[playerid][listitem];
			        GivePlayerLoot(playerid, DropLoot[item_call][luttype]);
					new strlyt[70];
					format(strlyt,sizeof(strlyt),"Добавлено в рюкзак: {FF8000}%s{00D700}.",InfoLoot[DropLoot[item_call][luttype]][NAMEloot]);
				    SendClientMessage(playerid,0x00D700FF,strlyt);
				    deleteLoot(item_call);
				    
				}
				else
				{
				    SendClientMessage(playerid,0xD20000AA,!"Твой рюкзак переполнен!");
				}
			}
			else
			{
			    SendClientMessage(playerid,0xD20000AA,!"Этот предмет уже кто-то подобрал!");
			}
		}
	}
	else if(dialogid==210)//врач
	{
	    if(response)
	    {
	        if(listitem==0)//полное лечение (только для новичков)
	        {
	            if(pInfo[playerid][sytok]>9)
	            {
	                SendClientMessage(playerid,-1,"1.{FC6103}ВРАЧ: {FFFFFF}Ты уже не новичок, купи аптечку, респиратор или защитную одежду!");
	            }
	            else
	            {
					if(pInfo[playerid][immynitet]!=100)
					{
	                	SendClientMessage(playerid,0xFC610300,"1.ВРАЧ: {FFFFFF}Как же ты так заразился? Купи себе респиратор для выхода на поверхность!");
	                	SendClientMessage(playerid,0xFC610300,"1.ВРАЧ: {FFFFFF}Он продается у Иваныча. Я не могу лечить тебя всегда.");
					}
					SetPlayerHealth(playerid,100.0);
					
					pInfo[playerid][prostil]=true;
	 				pInfo[playerid][otrava]=true;
	 			    pInfo[playerid][vivih]=false;
	 			    
	 				PlayerPlaySound(playerid,42803,0.0,0.0,0.0);
	 				
	 				SendClientMessage(playerid,-1263159297,!"Как только вы пробудете в бункере 10 суток, вас перестанут лечить бесплатно!");
	            }
			}
			else if(listitem==1)//справка о работе
			{
				ShowPlayerDialog(playerid, 10016,0, !"{51FF0F}Справка", !"{00FFFF}Работа\n\n\
{E8D699}Жить в постапокалиптическом мире трудно и опасно, но жить без денег и вовсе невозможно!\n\
{E8D699}Выбираться на поверхность и заниматься мародерством могут не все.\n\
{E8D699}Поэтому, многие предпочитают зарабатывать тут, в бункере Сектор-2!\n\
{E8D699}В основном, это подсобная работа, на различных влиятельных людей бункера.\n\n\
{E8D699}Устроиться на работу можно у Иваныча, у него целый список вакансий.\n\
{E8D699}В зависимости от места работы, у вас будут разные задания.\n\
{E8D699}За каждое выполненное задание от работодателя, вы получите очки заслуг.\n\
{E8D699}Чем больше очков заслуг - тем выше ваш ранг!\n\
{E8D699}А от ранга зависит зарплата, которую платят раз в сутки (игровые конечно же).\n\
{E8D699}Очки заслуг можно получить и другим способом - если задобрите работодателя Золотом!\n\
{E8D699}За одно золото он повысит ваши очки на 10!"
, !"Ок", "" );
			}
			else if(listitem==2)//ваш ранг
			{
                if(pInfo[playerid][jobid]==1)//медик
				{
				}
				else
				{
					SendClientMessage(playerid,0xB4B5B7FF,!"{FC6103}ВРАЧ: {FFFFFF}Ты не устроился работать в Госпиталь. Обратись к Иванычу!");
				}
			}
			else if(listitem==3)//взятка (ранг за золото)
			{
                if(pInfo[playerid][jobid]==1)//медик
				{
				}
				else
				{
					SendClientMessage(playerid,0xB4B5B7FF,!"{FC6103}ВРАЧ: {FFFFFF}Ты не устроился работать в Госпиталь. Обратись к Иванычу!");
				}
			}
			else if(listitem==4)//задания (ранг за работу)
			{
                if(pInfo[playerid][jobid]==1)//медик
				{
				}
				else
				{
					SendClientMessage(playerid,0xB4B5B7FF,!"{FC6103}ВРАЧ: {FFFFFF}Ты не устроился работать в Госпиталь. Обратись к Иванычу!");
				}
			}
			else if(listitem==5)//АПТЕКА: купить медикаменты
			{
				ShowPlayerDialog(playerid,215,2, !"{00FF00}Госпиталь бункера 'Сектор-2'", !"{C5C589}Аптечка {009500}50$\n\
				{C5C589}Бинт {009500}10$\n\
				{C5C589}Снадобье от болезней {009500}40$\n\
				{C5C589}Растирка {009500}30$", !"Выбрать", !"Закрыть");
			}
			else if(listitem==6)//изготовить медикаменты
			{
			    ShowPlayerDialog(playerid,216,2,!"{00FF00}Госпиталь бункера 'Сектор-2'",!"{C5C589}Снадобье от болезней {009500}трава + водка\n\
			    {C5C589}Растирка согревающая {009500}бинт + водка\n\
			    {C5C589}Мазь от зомби {009500}гнилое мясо + бинт",!"Выбрать",!"Закрыть");
           /*     if(pInfo[playerid][jobid]==1)//медик
				{

				}
				else
				{
					SendClientMessage(playerid,0xB4B5B7FF,!"{FC6103}ВРАЧ: {FFFFFF}Ты не устроился работать в Госпиталь. Обратись к Иванычу!");
				}*/
			}
			else if(listitem==7)//вам нужна помощь?
			{
                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВЫ: {FFFFFF}Вам нужна помощь?");
                
                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВРАЧ: {FFFFFF}Да, мы набираем добровольцев, которые не боятся выбираться на поверхнось.");
                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВРАЧ: {FFFFFF}Им предстоит находить выживших и доставлять в этот госпиталь.");
                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВРАЧ: {FFFFFF}Если тебя это заинтересовало, то обратись к Иванычу.");
                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВРАЧ: {FFFFFF}Кроме этого, мы покупаем медикаменты, которые ты сможешь найти на поверхности.");
			}
			else if(listitem==8)//много ли поступает раненых
			{
                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВЫ: {FFFFFF}Много ли поступает раненых?");

                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВРАЧ: {FFFFFF}Поступает много и не всех удается спасти.");

                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВРАЧ: {FFFFFF}Видишь этого беднягу на столе? Ему не повезло.");

                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВРАЧ: {FFFFFF}Обезумевшие зараженные разорвали ему брюхо, его доставили сюда с кишками наружу.");

                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВРАЧ: {FFFFFF}Он был все еще жив, но мы уже ничего не смогли сделать, только облегчить его страдания.");
			}
			else if(listitem==9)//где вы берете лекарства
			{
                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВЫ: {FFFFFF}Где вы берёте лекарства?");

                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВРАЧ: {FFFFFF}Что-то изготавливают медики из найденных трав и ингредиентов.");

                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВРАЧ: {FFFFFF}Ты тоже можешь этому научиться, если будешь работать у нас.");

                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВРАЧ: {FFFFFF}Но основную часть приносят мародёры - на поверхности ещё много всего полезного.");

			}
			else if(listitem==10)//кто такие зараженные
			{
                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВЫ: {FFFFFF}Кто такие зараженные?");

                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВРАЧ: {FFFFFF}Люди, которые получили слишком большую дозу вирусов.");

                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВРАЧ: {FFFFFF}Кто-то умирает от этого, а у кого-то что-то переклинивает в голове.");

                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВРАЧ: {FFFFFF}Они становятся очень агрессивными и дикими - настоящие зомби!");

                SendClientMessage(playerid,0x008800AA, !"{FC6103}ВРАЧ: {FFFFFF}Увидишь зараженного - не подходи близко!");
			}
		}
	}
	else if(dialogid==215)//аптека
	{
	    if(response)
	    {
	        if(isInvNotFull(playerid))
	        {
	            new moneyse=pInfo[playerid][money];
				if(listitem==0)//аптечка 50
				{
				    if(moneyse<=50)
				    {
				        SendClientMessage(playerid,0x00880000,!"Вы купили аптечку!");
				        GivePlayerLoot(playerid,65);
				        GivesPlayerMoney(playerid,-50);
				    }
				    else
				    {
				        SendClientMessage(playerid,0xD20000AA,!"Недостаточно денег!");
				    }
				}
				else if(listitem==1)//бинт 10
				{
				    if(moneyse<=10)
				    {
				        SendClientMessage(playerid,0x00880000,!"Вы купили бинт!");
				        GivePlayerLoot(playerid,64);
				        GivesPlayerMoney(playerid,-10);
				    }
				    else
				    {
				        SendClientMessage(playerid,0xD20000AA,!"Недостаточно денег!");
				    }
				}
				else if(listitem==1)//снадобье 40
				{
				    if(moneyse<=40)
				    {
				        SendClientMessage(playerid,0x00880000,!"Вы купили снадобье!");
				        GivePlayerLoot(playerid,66);
				        GivesPlayerMoney(playerid,-40);
				    }
				    else
				    {
				        SendClientMessage(playerid,0xD20000AA,!"Недостаточно денег!");
				    }
				}
				else// if(listitem==1)//растирка 30
				{
				    if(moneyse<=30)
				    {
				        SendClientMessage(playerid,0x00880000,!"Вы купили растирку!");
				        GivePlayerLoot(playerid,67);
				        GivesPlayerMoney(playerid,-30);
				    }
				    else
				    {
				        SendClientMessage(playerid,0xD20000AA,!"Недостаточно денег!");
				    }
				}
				
	        }
	        else
	        {
	            SendClientMessage(playerid,0xD20000AA,!"Твой рюкзак переполнен!");
	        }
	    }
	}
	else if(dialogid==216)//изготовить медикаменты
	{
		if(response)
		{
		    if(pInfo[playerid][jobid]==1)//медик
			{
				if(listitem==0)//
				{
				}
				else if(listitem==1)
				{
				}
				else if(listitem==2)
				{
				}
			}
			else
			{
				SendClientMessage(playerid,0xB4B5B7FF,!"{FC6103}ВРАЧ: {FFFFFF}Ты не устроился работать в Госпиталь. Обратись к Иванычу!");
			}
		}
	}
	else if(dialogid==217)//багажник, что сделать? взять положить
	{
		new vehicleid=pInfo[playerid][car_back];
		
		if(vehicleid!=0)
		{
			new Float:cx,Float:cy,Float:cz;
			GetVehicleCoordBackPack(vehicleid, cx,cy,cz);

			if(IsPlayerInRangeOfPoint(playerid,0.9,cx,cy,cz))
			{
			    if(vInfo[vehicleid][backpack]==false)
	            {

					if(response)//взять
					{
					    if(isInvNotFull(playerid))
					    {


	                         new koliches[MAX_TYPE_LOOT];

	                         for(new invens=0; invens<10; ++invens )
	                         {
	                            if(vInfo[vehicleid][inventory][invens]!=0)
	                            {
	                                new loots_type=vInfo[vehicleid][inventory][invens];
	                                for(new invec=invens; invec<10; ++invec)
	                                {
	                                    if(vInfo[vehicleid][inventory][invec]==loots_type)
	                                    {
	                                        koliches[loots_type]++;
	                                    }
	                                }

	                            }
	                         }

	                         static str_infovza[261];
	                         format(str_infovza,261,"");
	                         new str_vzyat[34];

	                         new a=0;
	                         for(new typesl=0; typesl<MAX_TYPE_LOOT; ++typesl )
	                         {
	                         	if(koliches[typesl]!=0)
	                         	{
	                         	    format(str_vzyat,34,"[%d] - %s\n",koliches[typesl],GetLootName(typesl));
	                         	    strcat(str_infovza, str_vzyat);
	                         	    PreLoot[playerid][a]=typesl;
						    	    ++a;
	                         	}

	                         }

							 if(a!=0)
							 {
							    format(str_vzyat,34,"Багажник [%d/10]",a);
							    ShowPlayerDialog(playerid, 218,2,str_vzyat,str_infovza,!"Взять",!"Закрыть");
							 }
							 else
							 {
							    SendClientMessage(playerid,0xD20000AA,!"Багажник пуст!");
							 }
					    }
					    else
					    {
					         SendClientMessage(playerid,0xD20000AA,!"Твой рюкзак переполнен!");
						}
					}
					else//положить
					{
						if(pInfo[playerid][slot]!=0)
						{
						    static str_infopol[500];
						    format(str_infopol,500,"");
							new str_polojit[34];
						    for(new lytid=0,a=0;lytid<MAX_TYPE_LOOT;++lytid)
						    {
						    	if(LOOT_KOLVO[playerid][lytid][kolichectvo]!=0)
						    	{
						    	    format(str_polojit,34,"[%d] - %s\n",LOOT_KOLVO[playerid][lytid][kolichectvo],InfoLoot[lytid][NAMEloot]);
						    	    strcat(str_infopol,str_polojit);
						    	    PreLoot[playerid][a]=lytid;
						    	    ++a;
						    	}
						    }

							format(str_polojit,15,"Рюкзак [%d/%d]",pInfo[playerid][slot],pInfo[playerid][pack]*10);

							ShowPlayerDialog(playerid,219,2,str_polojit,str_infopol,!"Положить",!"Закрыть");
						}
						else
						{
						    SendClientMessage(playerid, 0xD20000AA,!"Ваш рюкзак пуст!");
						}
					}
				}
				else
	            {
	                SendClientMessage(playerid,0xAFAFAFAA,!"Откройте багажник!");
	            }
			}
			else
			{
			    pInfo[playerid][car_back]=0;
			}
		}
	}
	else if(dialogid==218)//взять из багажника
	{
		if(response)
		{
			new vehicleid=pInfo[playerid][car_back];

			if(vehicleid!=0)
			{
				new Float:cx,Float:cy,Float:cz;
				GetVehicleCoordBackPack(vehicleid, cx,cy,cz);

				if(IsPlayerInRangeOfPoint(playerid,0.9,cx,cy,cz))
				{
                    if(vInfo[vehicleid][backpack]==false)
	            	{

					    if(isInvNotFull(playerid))
					    {
					        new loter_type=PreLoot[playerid][listitem];

					        for(new invecs=0;invecs<10;++invecs)
					        {
					            if(vInfo[vehicleid][inventory][invecs]==loter_type)
					            {
					                vInfo[vehicleid][inventory][invecs]=0;
					                GivePlayerLoot(playerid,loter_type);
					                new str_bagage[66];
					                format(str_bagage,66,"Вы взяли из багажника: {00FF00}%s{008800}.",InfoLoot[loter_type][NAMEloot]);
					                SendClientMessage(playerid,0x00880000,str_bagage);
					                loter_type=0;//присвоение для проверки ниже
					                break;
					            }
					        }
					        if(loter_type!=0)// 0 это успешно смотри выше
					        {
					            SendClientMessage(playerid,0xFF000000,!"В багажнике этого нет!");
					        }
					    }
					    else
					    {
							SendClientMessage(playerid,0xD20000AA,!"Твой рюкзак переполнен!");
					    }
					}
		            else
		            {
		                SendClientMessage(playerid,0xAFAFAFAA,!"Откройте багажник!");
		            }
				}
			}
			else
			{
			    pInfo[playerid][car_back]=0;
			}
		}
	}
	else if(dialogid==219)//положить в багажник
	{
	    if(response)
	    {
			new vehicleid=pInfo[playerid][car_back];

			if(vehicleid!=0)
			{
				new Float:cx,Float:cy,Float:cz;
				GetVehicleCoordBackPack(vehicleid, cx,cy,cz);

				if(IsPlayerInRangeOfPoint(playerid,0.9,cx,cy,cz))
				{
					if(vInfo[vehicleid][backpack]==false)
		            {
					    new b;
					    for(new empty_l;empty_l<10;++empty_l)
					    {
					        if(vInfo[vehicleid][inventory][empty_l]!=0)
					        {
					            b++;
					        }
					        else
					        {
//					            empty_l;
					            
					            new lotys_types=PreLoot[playerid][listitem];

								SubStractPlayerLoot(playerid,lotys_types);
								
								vInfo[vehicleid][inventory][empty_l]=lotys_types;
								
								new str_polojile[69];
								
								format(str_polojile,69,"Вы положили в багажник: {00FF00}%s{008800}.",InfoLoot[lotys_types][NAMEloot]);
        						SendClientMessage(playerid,0x00880000,str_polojile);
								
					            break;
					        }
					    }
					    if(b==10)
					    {
					        SendClientMessage(playerid,0xD20000AA,!"Багажник заполнен!");
					    }
	                    //new lotes_types=PreLoot[playerid][listitem];
	                }
                    else
	            	{
	                	SendClientMessage(playerid,0xAFAFAFAA,!"Откройте багажник!");
	            	}

                    
				}
			}
			else
			{
			    pInfo[playerid][car_back]=0;
			}
		}
	}
	else if(dialogid==1994)//N - действия
	{/*
		            ShowPlayerDialog(playerid, 1994,2,!"{51FF0F}Действия",
"• {FF8040}Пожать руку\n\
• {FF8040}Обнять\n\
• {FF8040}Признаться в любви\n\
• {FF8040}Поцеловать туда =)\n\
• {FF8040}Нашлепать по попке\n\
• {FF0000}Раздеться/Одеться\n\
• {C1FFFF}Курить\n\
Руки вверх\n\
Возмущение\n\
Сесть\n\
Сесть 2\n\
Лечь 1\n\
Лечь 2\n\
Лечь 3\n\
Жест рукой\n\
Зевать\n\
Танец\n\
Танец 2\n\
Танец 3\n\
Танец 4\n\
Танец 5\n\
Танец 6\n\
Стоять\n\
Стоять 2\n\
Стоять 3\n\
Стоять 4\n\
Пьяная походка\n\
Шок\n\
Плач\n\
Победа",!"Ок",!"Отмена");*/
		if(response)
		{
		    if(listitem==0)//пожать руку
		    {
		        ShowPlayerDialog(playerid,10915,1, !"Пожать руку", !"Кому? Введите ИД:", !"Ок", !"Отмена");
		    }
		    else if(listitem==1)
		    {
		        ShowPlayerDialog(playerid,10916,1, !"Нежно обнять", !"Кого? Введите ИД:", !"Ок", !"Отмена");
		    }
		    else if(listitem==2)
		    {
		        ShowPlayerDialog(playerid,10917,1, !"Признаться в любви", !"Кому? Введите ИД:", !"Ок", !"Отмена");
		    }
		    else if(listitem==3)
		    {
		        ShowPlayerDialog(playerid,10918,1, !"Поцеловать туда", !"Кого? Введите ИД:", !"Ок", !"Отмена");
		    }
		    else if(listitem==4)
		    {
		        ShowPlayerDialog(playerid,10918,1, !"Нашлепать по попке", !"Кого? Введите ИД:", !"Ок", !"Отмена");
		    }
		    else if(listitem==5)
		    {
		    }
		    else if(listitem==6)
		    {
				if(pInfo[playerid][cigarts]>0)
				{
				}
				else
				{
				    SendClientMessage(playerid,0xD2000000,!"У вас нет сигарет!");
				}
		    }
		    else if(listitem==7)//руки вверх
		    {
		        ApplyAnimation(playerid,"PED","HANDSUP",4.1,0,0,0,1,0);
		    }
		    else if(listitem==8)//Возмущение
		    {
		        ApplyAnimation(playerid, "PED","fucku",4.000000, 0, 0,0,0,0);
		    }
		    else if(listitem==9)
		    {
		        ApplyAnimation(playerid, "PED","SEAT_down",4.100000, 0, 1,1,1,1);
		    }
		    else if(listitem==10)
		    {
		        ApplyAnimation(playerid, "INT_OFFICE","OFF_Sit_Crash",4.100000, 0, 1,1,1,1);
		    }
		    else if(listitem==11)
		    {
		        ApplyAnimation(playerid, "BEACH","ParkSit_W_Loop",4.100000, 0, 1,1,1,1);
		    }
		    else if(listitem==12)
		    {
		        ApplyAnimation(playerid, "BEACH","SitnWait_loop_W",4.100000, 0, 1,1,1,1);
		    }
		    else if(listitem==13)
		    {
		        ApplyAnimation(playerid, "BEACH","Lay_Bac_Loop",4.100000, 0, 1,1,1,1);
		    }
		    else if(listitem==14)//жест рукой
		    {
		        ApplyAnimation(playerid, "GANGS","hndshkba",4.100000, 0, 1,1,1,1);
		    }
		    else if(listitem==15)//зевать
		    {
		        ApplyAnimation(playerid, "GANGS","smkcig_prtl",4.100000, 0, 1,1,1,1);
		    }
		    else if(listitem==16)//танец
		    {
		        ApplyAnimation(playerid, "DANCING","dnce_M_b",4.100000, 0, 1,1,1,0);
		    }
		    else if(listitem==17)
		    {
		        ApplyAnimation(playerid, "DANCING","dnce_M_a",4.100000, 0, 1,1,1,0);
		    }
		    else if(listitem==18)
		    {
		        ApplyAnimation(playerid, "DANCING","dnce_M_b",4.100000, 0, 1,1,1,0);
		    }
		    else if(listitem==19)
		    {
		        ApplyAnimation(playerid, "DANCING","DAN_Down_A",4.100000, 0, 1,1,1,0);
		    }
		    else if(listitem==20)
		    {
		        ApplyAnimation(playerid, "DANCING","DAN_Left_A",4.100000, 0, 1,1,1,0);
		    }
		    else if(listitem==21)
		    {
		        ApplyAnimation(playerid, "DANCING","DAN_Loop_A",4.100000, 0, 1,1,1,0);
		    }
		    else if(listitem==22)
		    {
		        ApplyAnimation(playerid, "DEALER","DEALER_DEAL",4.100000, 0, 1,1,1,1);
		    }
		    else if(listitem==23)
		    {
		        ApplyAnimation(playerid, "DEALER","DEALER_IDLE_01",4.100000, 0, 1,1,1,1);
		    }
		    else if(listitem==24)
		    {
		        ApplyAnimation(playerid, "DEALER","DEALER_IDLE_03",4.100000, 0, 1,1,1,1);
		    }
		    else if(listitem==25)
		    {
		        ApplyAnimation(playerid, "DEALER","DRUGS_BUY",4.100000, 0, 1,1,1,1);
		    }
		    else if(listitem==26)
		    {
		        ApplyAnimation(playerid, "RYDER","RYD_Die_PT1",4.100000, 0, 1,1,1,1);
		    }
		    else if(listitem==27)
		    {
		        ApplyAnimation(playerid, "PED","facsurp",4.100000, 0, 1,1,0,0);
		    }
		    else if(listitem==28)
		    {
		        ApplyAnimation(playerid, "GRAVEYARD","mrnF_loop",4.100000, 0, 1,1,0,0);
		    }
		    else if(listitem==29)
		    {
		        ApplyAnimation(playerid, "OTB","wtchrace_win",4.100000, 0, 1,1,0,3300);
		    }
		}
	}
	else if(dialogid==2642)//игрок кликнул
	{
	    if(response&&IsPlayerConnected(pInfo[playerid][player_c]))
	    {
	        if(listitem==0)
	        {
	            new str_smska[42];
	            format(str_smska,42,"Сообщение жителю %s:",pInfo[pInfo[playerid][player_c]][Name]);
	            ShowPlayerDialog(playerid,2005,1,str_smska,!"Введите в поле текст сообщения",!"Отправить",!"Отмена");
	        }
	        else
	        {
	            ShowPlayerDialog(playerid,3114,1,!"{FF800}Поиск:",!"Введите сумма вознаграждения, за убийство этого человека.",!"ОК",!"Отмена");
	        }
	    }
	}
	else if(dialogid==2005)//текст
	{
	    if(response&&IsPlayerConnected(pInfo[playerid][player_c]))
	    {
	        if(pInfo[playerid][kpkmoney]>=2)
	        {
	            SetPlayerChatBubble(playerid,"отправляет смс, через КПК",0x007900AA,30.0,10000);
	            
				new sendid=pInfo[playerid][player_c];
	            SetPlayerChatBubble(sendid,"<-- пришло смс",0xFF0000AA,30.0,10000);
	        
	            
	            PlayerPlaySound(playerid,41603,0.0,0.0,0.0);
	            
	            new sound_type = pInfo[sendid][kpk_snd];//21001 20804 23000 20600 30800
	            
	            if(sound_type!=4)
				{
	            	PlayerPlaySound(sendid,	sound_type==0?21001:sound_type==1?20804:sound_type==2?23000:/*sound_type==3?*/20600/*:30800*/,	0.0,0.0,0.0);
	            }
				
				new str_sms[120];
				format(str_sms,120,"--> SMS От: {00FFFF}%s[%d] {FDE640}- %s",pInfo[playerid][Name],playerid,inputtext);
				SendClientMessage(sendid,0xFF000000,str_sms);
				
				format(str_sms,120,"<-- SMS Для: {00FFFF}%s[%d] {FDE640}- %s",pInfo[sendid][Name],sendid,inputtext);
				SendClientMessage(playerid,0x00FF0000,str_sms);
			}
			else
			{
			    SendClientMessage(playerid,0xFF000000,!"У вас нет денег на КПК! Положите их у Иваныча.");
			}
	    }
	}
	else if(dialogid==3580)//предложить купить
	{
		if(response)
		{
		    new salleid=strval(inputtext);
		    if(IsPlayerConnected(salleid))
		    {
				if(IsPlayerInRangeOfPoint(playerid,6.62,pInfo[salleid][pos_x],pInfo[salleid][pos_y],pInfo[salleid][pos_z]))
				{
					if(isInvNotFull(salleid))
					{
					    pInfo[playerid][moneyid]=salleid;
					}
					else
					{
					   SendClientMessage(playerid,0xD20000AA,!"Его рюкзак переполнен!");
					}
                    
				}
				else
				{
				    SendClientMessage(playerid,0xFF0000AA,!"Вы слишком далеко, подойдите ближе!");
				}
		    }
		    else
		    {
		        SendClientMessage(playerid,0xFF0000AA,!"Такого игрока нет на сервере!");
		    }
		}
	}
	else if(dialogid==2580)//передать
	{
	    if(response)
	    {
	        new giveid=strval(inputtext);
	        
	        
	       // if(IsPlayerNPC(giveid))// странно на на секторе нет проверки на нпц,а у иваныча забит инвентарь
       		new Float:gc,Float:gy,Float:gz;
	        if(GetPlayerPos(giveid,gc,gy,gz)==1)//внутри функции есть проверка на getplayerpos
	        {
	            if(IsPlayerInRangeOfPoint(playerid,3.9,gc,gy,gz))
	            {
	                if(isInvNotFull(giveid))
					{
					    new loot_type=PLAYER_LOOT_DRAW[playerid][PLAYER_PRE_USE_[playerid]][loottype];
					    if(loot_type!=0)
					    {
						    GivePlayerLoot(giveid,loot_type);
						    SubStractPlayerLoot(playerid,loot_type);
						    new str_peredac[95];
						    format(str_peredac,95,"Вы отдали: {FF8000}%s{00D700} для {FF8000}%s",GetLootName(loot_type),pInfo[giveid][Name]);
							SendClientMessage(playerid, 0x00D70000,str_peredac);
							format(str_peredac,95,"Вы получили: {FF8000}%s{00D700} от {FF8000}%s",GetLootName(loot_type),pInfo[playerid][Name]);
							SendClientMessage(giveid,   0x00D70000,str_peredac);
							PLAYER_PRE_USE_[playerid]=0;
						}
					}
					else
					{
						SendClientMessage(playerid,0xD20000AA,!"Его рюкзак переполнен!");
					}
	            }
	        }
	        else
	        {
	            SendClientMessage(playerid,0xFF0000AA,!"Такого игрока нет на сервере!");
	        }
	    }
	}
	else if(dialogid==3581)//ввел цену
	{
		if(response)
		{
			new salleid=pInfo[playerid][moneyid];
		    if(IsPlayerConnected(salleid))
		    {
				if(IsPlayerInRangeOfPoint(salleid,6.62,pInfo[playerid][pos_x],pInfo[playerid][pos_y],pInfo[playerid][pos_z]))
				{
				    if(pInfo[playerid][afktime]==0)
				    {
					    new p_cena=strval(inputtext);
				        if(p_cena>=1&&p_cena<=50000)
				        {
							if(pInfo[salleid][money]>=p_cena)
							{

			   					new loot_types=PLAYER_LOOT_DRAW[playerid][PLAYER_PRE_USE_[playerid]][loottype];
			   					if(loot_types>0)
			   					{
									SendClientMessage(playerid,0x008800AA,!"Ваше предложение отправлено.");
			        				pInfo[playerid][pred_cena]=p_cena;
			        				pInfo[salleid][moneyid]=playerid;
								    new str_prdloj[135];
								    format(str_prdloj,sizeof(str_prdloj),"{FF8000}%s {FFFFFF}предлогает вам купить\n{FF8000}%s {FFFFFF}за {00FF00}%d$",pInfo[playerid][Name],InfoLoot[loot_types][NAMEloot],p_cena);
								    ShowPlayerDialog(salleid, 3582,0, !"{FF0000}Торговля",str_prdloj,!"Купить",!"Нет");
							    }
							    else
							    {
							      //  pInfo[playerid][moneyid]=0;
							        //у вас этого нет
							    }
							}
						    else
						    {
						        SendClientMessage(playerid,0xB4B5B7FF,!"У него нет столько денег!");
						    }
						}
						else
						{
							SendClientMessage(playerid,0xAFAFAFAA,!"Нельзя меньше 1$ и больше 50к$");
						}
					}
					else
					{
					    SendClientMessage(playerid,0xD20000AA,!"Он в АФК.");
					}
				}
				else
				{
                    SendClientMessage(playerid,0xFF0000AA,!"Вы слишком далеко, подойдите ближе!");
				}
		    }
		    else
		    {
		        SendClientMessage(playerid,0xFF0000AA,!"Такого игрока нет на сервере!");
		    }
		}
	}
	else if(dialogid==3582)
	{
		new sall_senderid=pInfo[playerid][moneyid];
	    if(IsPlayerConnected(sall_senderid))
	    {
		    if(response)
		    {
		        
		    	new loot_types=PLAYER_LOOT_DRAW[sall_senderid][PLAYER_PRE_USE_[sall_senderid]][loottype];
			   	if(loot_types>0)
			   	{
					new cennik=pInfo[sall_senderid][pred_cena];
					new str_kypiv[77];
					format(str_kypiv,77,"Вы продали: {ff8000}%s{ffffff} за {00ff00}%d$",InfoLoot[loot_types][NAMEloot],cennik);
					SendClientMessage(sall_senderid,-1,str_kypiv);
					format(str_kypiv,77,"Вы купили: {ff8000}%s{ffffff} за {00ff00}%d$",InfoLoot[loot_types][NAMEloot],cennik);
					SendClientMessage(playerid,-1,str_kypiv);

	                GivesPlayerMoney(sall_senderid,cennik);//продавец
	                GivesPlayerMoney(playerid,cennik*-1);//покупатель
	            }
				//else
				//{
				//  у него этого нет!
				//}
		    }
		    else
		    {
		        SendClientMessage(sall_senderid,0xD20000AA,!"Ваше предложение отклонено.");
		        
		        SendClientMessage(playerid,0x008800AA,!"Вы отказались от предложения купить хабар.");


		      //  pInfo[playerid][pred_cena]=0;

		    }
	    }
	    else
	    {
	        SendClientMessage(playerid,0xFF0000AA,!"Такого игрока нет на сервере!");
	    }
	    pInfo[sall_senderid][pred_cena]=-1;
	    pInfo[sall_senderid][moneyid]=-1;
		pInfo[playerid][pred_cena]=-1;
		pInfo[playerid][moneyid]=-1;
	}
	else if(dialogid==7820)//меню машины
	{
	    new vehicleid = GetPlayerVehicleID(playerid);
	    if(vehicleid!=0&&GetPlayerVehicleSeat(playerid)==0)//если игрок находится в машине за местом водителя
	    {
//	        if(vehicleid==pInfo[playerid][car_id])
			/*ShowPlayerDialog(playerid, 7820, 2, !"{00B000}Управление",
!"{BFB37D}Двигатель {00B000}вкл <- {DF0000}-> выкл\n
{BFB37D}Двери {DF0000}закрыть\n
{BFB37D}Двери {00B000}открыть\n
{BFB37D}багажник {00B000}откр <- {DF0000}-> закр",!"Ок",!"Отмена");

*/
			if(response)
			{
				new engine, lights, alarm, dors, bonnet, boot, objective;
				GetVehicleParamsEx(vehicleid, engine, lights, alarm, dors, bonnet, boot, objective);
			    if(listitem==0)
			    {
					if(vInfo[vehicleid][akum]>0)
					{
					    if(vInfo[vehicleid][benz]>0)
					    {
					        vInfo[vehicleid][Engine]=true;
					       
							SetVehicleParamsEx(vehicleid, 1, 1, alarm, dors, bonnet, boot, objective);
							
					    }
					    else
					    {
					    	SendClientMessage(playerid,0xFF0000AA,!"Бензобак пуст!");
					    }
					}
					else
					{
					    SendClientMessage(playerid,0xFF0000AA,!"Аккумулятор разряжен, установите новый!");
					}
			    }
			    else if(listitem==1)
			    {
                    GameTextForPlayer(playerid,"~r~Close",5000,6);
				    
					SetVehicleParamsEx(vehicleid, engine, lights, alarm, 1, bonnet, boot, objective);
			    }
			    else if(listitem==2)
			    {
			        GameTextForPlayer(playerid,"~g~Open",5000,6);
				    
					SetVehicleParamsEx(vehicleid, engine, lights, alarm, 0, bonnet, boot, objective);
			    }
			    else if(listitem==3)//багажник
			    {
			        if(vInfo[vehicleid][backpack]==false)//в данный момент багажник открыт, закрываем его
			        {
			            vInfo[vehicleid][backpack]=true;
			            SendClientMessage(playerid,0x00880000,!"Вы закрыли багажник!");
			            SetVehicleParamsEx(vehicleid, engine, lights, alarm, dors, bonnet, 0, objective);
			        }
			        else
		        	{//открываем багажник
		        	    vInfo[vehicleid][backpack]=false;
			            SendClientMessage(playerid,0x00880000,!"Вы открыли багажник! Подойдите к нему и нажмите {FF0000}H{008800}.");
			            SetVehicleParamsEx(vehicleid, engine, lights, alarm, dors, bonnet, 1, objective);
			        }
			    }
			}
		}
	    else
	    {
	        SendClientMessage(playerid,0xFF0000AA,!"Вы должны быть в транспорте, за рулем!");
	    }
	}
	else if(dialogid==8816)//положить деньги на кпк
	{
	    if(response)
	    {
	        new manyy=strval(inputtext);
	        if(manyy>=2&&manyy<=500)
	        {
	        
	        }
	        else
	        {
	            SendClientMessage(playerid,0xAFAFAFAA,!"Нельзя положить меньше 2$ и больше 500$!");
	        }
	    }
	    else
	    {
	    	CallLocalFunction("OnDialogResponse","dddds",playerid,110,1,3,"");
	    }
	}
	else if(dialogid==8817)//перевести денеги
	{
		if(response)
		{
		    new giveid=strval(inputtext);
		    if(IsPlayerConnected(giveid))
		    {
		        pInfo[playerid][moneyid]=giveid;
		        new str_givem[81];
		        format(str_givem,81,"Введите сумму, которую вы хотите передать\n %s.",pInfo[giveid][Name]);
		    	ShowPlayerDialog(playerid,8818,1, !"Денежный перевод",str_givem, !"Ok", !"Отмена");
		    	
		    }
		    else
		    {
		        ShowPlayerDialog(playerid,8817,1, !"Человек не найден", !"Введите ИД игрока:", !"Ok", !"Отмена");
		    }
		}
	}
	else if(dialogid==8818)//перевести денеги
	{
		if(response)
		{
			new moneygid=pInfo[playerid][moneyid];
		    if(IsPlayerConnected(moneygid))
		    {
			    new manyy=strval(inputtext);
			    if(manyy>=1&&manyy<=10000)//если больше 0 или больше 10000
			    {
			        if(pInfo[playerid][money]<=manyy)
			        {
               			SetPlayerChatBubble(playerid,"переводит деньги",0x007900AA, 30.0, 10000);
               			
						new str_perevod[114];
						format(str_perevod,114,"Перевод от: {FF0000}%s{0080c0}. Сумма: {FF0000}%d {0080c0}$, на ваш счёт в хранилище!",pInfo[playerid][Name],manyy);
						SendClientMessage(moneygid,0x0080c0aa,str_perevod);

						format(str_perevod,114,"Вы перевели %s - %d $",pInfo[moneygid][Name],manyy);
						SendClientMessage(playerid,0x0080c0aa,str_perevod);

						GivesPlayerMoney(playerid,manyy*-1);
						GivesPlayerMoney(moneygid,manyy);
					}
					else
					{
					    SendClientMessage(playerid,-1263159297,!"У вас нет столько денег в Хранилище!");
					}
			    }
			    else
			    {
			        SendClientMessage(playerid,0xAFAFAFAA,!"Нельзя перевести меньше 1$ и больше 10000$!");
			    }
			}
			else
			{
			    ShowPlayerDialog(playerid, 8818,1, !"Неверный ID игрока", !"Введите ID игрока", !"Ок", !"Cancel");
			}
		}
	}
	else if(dialogid==8820)//Главное меню открывающеюся на кнопку  N
	{
	    if(response)
	    {
	        if(listitem==0)//Личные данные
	        {
				ShowPlayerDialog(playerid, 8825,2, !"{51FF0F}Личные данные", !"Статистика\nУмения\nБолезни и эффекты", !"Выбрать", !"Отмена");
	        }
	        else if(listitem==1)//ваш кпк
	        {
                ShowPlayerDialog(playerid, 12500,2, !"{51FF0F}КПК", !"{E8D699}Баланс\n\
{E8D699}СМС\n\
{E8D699}Календарь\n\
{E8D699}Рингтон смс\n\
{E8D699}Радио 'Сектор'\n\
{E8D699}Выключить радио\n\
{E8D699}Камера: сделать селфи", !"Ок", !"Отмена");
	        }
	        else if(listitem==2)//торговать
	        {
       		    ShowPlayerDialog(playerid, 10013,2, !"{51FF0F}Торговля", !"Открыть лавку\nЗакрыть лавку\nСправка", !"Выбрать", !"Отмена");
	        }
	        else if(listitem==3)//действия (анимации)
	        {
	            ShowPlayerDialog(playerid, 1994,2,!"{51FF0F}Действия",
"• {FF8040}Пожать руку\n\
• {FF8040}Обнять\n\
• {FF8040}Признаться в любви\n\
• {FF8040}Поцеловать туда =)\n\
• {FF8040}Нашлепать по попке\n\
• {FF0000}Раздеться/Одеться\n\
• {C1FFFF}Курить\n\
Руки вверх\n\
Возмущение\n\
Сесть\n\
Сесть 2\n\
Лечь 1\n\
Лечь 2\n\
Лечь 3\n\
Жест рукой\n\
Зевать\n\
Танец\n\
Танец 2\n\
Танец 3\n\
Танец 4\n\
Танец 5\n\
Танец 6\n\
Стоять\n\
Стоять 2\n\
Стоять 3\n\
Стоять 4\n\
Пьяная походка\n\
Шок\n\
Плач\n\
Победа",!"Ок",!"Отмена");
	        }
	        else if(listitem==4)//Бригада
	        {
	            ShowPlayerDialog(playerid,10011,2,!"{51FF0F}Бригада",!"Создать бригаду\nНазначить титул\nПригласить в бригаду\nВыгнать из бригады\nУйти из бригады\nСправка и правила бригад",!"Выбрать",!"Отмена");
	        }
	        else if(listitem==5)//Транспорт
	        {
	        }
	        else if(listitem==6)//настройки
	        {
	            #define _OFF_ "{FF0000}Выкл"
	            #define _ON_ "{00FF00}Вкл"
	            
	            new fightstyle=GetPlayerFightingStyle(playerid);
	            
	            new str_settings[795];
	            format(str_settings,795,
"{FF8000}Действие:\t{FF8000}Статус:\n\
{E8D699}Безопасность\t{0080FF}Настройки безопасности аккаунта\n\
{E8D699}Вид от первого лица\t{0080FF}Для создания скриншотов\n\
{E8D699}Отображение индикаторов\t%s\n\
{E8D699}Отображение эффектов\t%s\n\
{E8D699}Отображение дополнительной карты\t%s\n\
{E8D699}Отображение VIP чата\t%s\n\
{E8D699}Гирлянда\t%s\n\
{E8D699}Стиль боя\t%s\n\
{E8D699}Замок комнаты\t%s\n\
{E8D699}Шапка Санты\t%s\n\
{E8D699}Срабатывание VIP защиты при кике\t%s\n\
{E8D699}Разрешить пожимать вам руку\t%s\n\
{E8D699}Разрешить вас обнимать\t%s\n\
{E8D699}Разрешить интим\t%s\n\
{E8D699}Разрешить передачу вещей\t%s",
pInfo[playerid][indikat]==true?_ON_ : _OFF_,
pInfo[playerid][effect]==0?_OFF_ : _ON_,
pInfo[playerid][dmap]==true?_ON_ : _OFF_,
pInfo[playerid][vip_chat]==true?_ON_ : _OFF_,
_ON_,
fightstyle==4?"Обычный":"",//fightstyle==5?"Бокс":fightstyle==6?"
pInfo[playerid][door_komn]==true?"{FF0000}Закрыт":"{00FF00}Открыт"
);

                ShowPlayerDialog(playerid, 8821,5, !"{00CE00}Настройки:",str_settings, !"Выбрать", !"Назад");
	        }
	        else if(listitem==7)//справка
	        {
	        	ShowPlayerDialog(playerid,8822,2, !"{51FF0F}Справка", !"{E8D699}Сюжет\n\
{E8D699}Основы (!важно!)\n\
{E8D699}Болезни и зависимости\n\
{E8D699}Зомби\n\
{E8D699}Торговля\n\
{E8D699}Бригады\n\
{E8D699}Транспорт\n\
{E8D699}Профессия\n\
{E8D699}Правила", !"Выбрать", !"<< Назад");

	        }
	        else //if(listitem==0)//донат
	        {
		        ShowPlayerDialog(playerid,12513,2, !"{51FF0F}ДОНАТ", !"{E8D699}Получить оплаченный донат\n\
{E8D699}Тарифы на донат\n\
{E8D699}VIP-мешок\n\
{E8D699}Запросить гуманитарную помощь", !"Выбрать", !"Отмена");
	        }
	    }
	}
	else if(dialogid==8822)//
	{
	    if(response)
	    {
	        if(listitem==0)//сюжет
	        {
	        }
	        else if(listitem==1)//основы (!важно!)
	        {
	            ShowPlayerDialog(playerid,105,0, !"{51FF0F}Справка", !"{FF8600}Подробнее на нашей wiki по Сектор-2.\n\n\
{FF8000}Болезни\n\
{FF0000}Простуда:\n\
{808000}Причина: {FFFFFF}Промок на холоде. {808000}Эффект: {FFFFFF}Головокружение, озноб. {808000}Лечение: {FFFFFF}Снадобье.\n\
{FF0000}Отравление:\n\
{808000}Причина: {FFFFFF}Неправильное питание. {808000}Эффект: {FFFFFF}Тошнота, рвота, потеря витаминов (цинга!). {808000}Лечение: {FFFFFF}Снадобье.\n\
{FF0000}Вывих:\n\
{808000}Причина: {FFFFFF}Падение. {808000}Эффект: {FFFFFF}Медленная скорость, нельзя прыгать и водить транспорт. {808000}Лечение: {FFFFFF}Бинт, аптечка или тряпки.\n\
{FF0000}Кровотечение:\n\
{808000}Причина: {FFFFFF}Ранение. {808000}Эффект: {FFFFFF}Потеря крови и здоровья. {808000}Лечение: {FFFFFF}Бинт, аптечка или тряпки.\n\n\
{FF8000}Эффекты\n\
{FF0000}Мазь от зомби:\n\
{808000}Причина: {FFFFFF}Использование мази. {808000}Эффект: {FFFFFF}Зомби вас не преследуют! {808000}Лечение: {FFFFFF}Пройдет через 15 минут.\n\
{FF0000}Вонь:\n\
{808000}Причина: {FFFFFF}Пища с сильным запахом в рюкзаке. {808000}Эффект: {FFFFFF}Зомби могут вас учуять на большем расстоянии! {808000}Лечение: {FFFFFF}Избавиться от продукта."
, !"Ок", "");
	        }
	        else if(listitem==2)//зомби
	        {
	        	ShowPlayerDialog(playerid,105,0, !"{51FF0F}Справка", !"{FF8600}Зараженные (зомби).\n\n\
{00FFFF}На поверхности вы можете встретить агрессивных зараженных, которых из-за их поведения и жутковатого вида называют зомби!\n\n\
{FF8000}Опасность:\n\n\
{FF0000}Слух и обоняние: {FFFFFF}Зараженные могут вас услышать, если вы стреляете или едете на транспорте.\n\
{FFFFFF}Если у вас в рюкзаке есть пища с сильным запахом, то они могут вас унюхать.\n\
{FFFFFF}Но даже если вы передвигаетесь тихо и не несете провизию, то зомби могут вас заметить, когда вы подойдете близко.\n\
{FFFFFF}Не подходите к ним или используйте мазь против зомби - с ней они вас не заметят.\n\
{FF0000}Нападение: {FFFFFF}Если зараженные вас заметили, то будут вас преследовать и нападать.\n\
{FFFFFF}Лучше не подпускать их близко, т.к. вблизи не получится использовать огнестрельное оружие.\n\
{FFFFFF}Удобно убивать зомби вдвоем - один за рулем автомобиля, второй стреляет из окна.\n\
{FF0000}Кровотечение: {FFFFFF}Если у вас нет кольчуги, то зомби с большой вероятностью нанесут вам рваную рану.\n\n\
{FF8000}Как спастись:\n\n\
{FFFFFF}Передвигайтесь вдали от зомби, купите карту, чтобы заметить их на радаре раньше, чем они заметят вас.\n\
{FFFFFF}Если вас преследуют и нет возможности отстреляться, то старайтесь двигаться в сторону бункера или в здание.\n\
{FFFFFF}Не пытайтесь убить зомби в рукопашном бою - это очень сложно и невыгодно!\n\n\
{FF8000}Польза:\n\n\
{FF0000}Уважение: {FFFFFF}За каждого убитого зомби вы получаете уважение и поднимаете свой авторитет.\n\
{FF0000}Лут: {FFFFFF}Из убитого зомби может выпасть лут, иногда довольно ценный. Самый ценный из зомби-мутанта!\n\
{FF0000}Резня: {FFFFFF}Раз в месяц проходит ивент 'Резня', где надо убивать зомби. Приз - деньги и транспорт!", !"Ок","" );
	        }
	        else if(listitem==3)//торговля
         	{
			    ShowPlayerDialog(playerid, 10014,0, !"{51FF0F}Справка", !"{00FFFF}Торговля\n\n\
{E8D699}С приходом постапокалипсиса мир многое потерял, но только не тягу к деньгам.\n\
{E8D699}Имея деньги по-прежнему можно позволить себе многое и забыть о проблемах.\n\
{E8D699}Поэтому, каждый выживший стремился заработать как можно больше баксов.\n\n\
{E8D699}Деньги можно заработать несколькими способами:\n\n\
{D70000}1. {E8D699}Выполнять задания влиятельных людей, например, Иваныча.\n\
{D70000}2. {E8D699}Искать вещи и продавать их NPC (доход: до 30 процентов).\n\
{D70000}3. {E8D699}Искать вещи и продавать их игрокам в лавке (доход: до 50 процентов).\n\
{D70000}4. {E8D699}Искать вещи и продавать их игрокам через предложение (доход: своя цена).\n\n\
{E8D699}Поставить и убрать лавку можно через личное меню (клавиша N).\n\
{E8D699}Вы не сможете двигаться во время торговли, однако можете разговаривать или уйти в АФК.\n\
{E8D699}На торг выставляется все содержимое вашего рюкзака! Цену можно посмотреть в описании вещей.\n\
{E8D699}Запрещается ставить лавку на проходах, местах спавна и на каких-либо объектах (столы, стулья, кровати и т.п.).", !"Ок", "");


	        }
	        else if(listitem==4)//бригада
	        {
	            ShowPlayerDialog(playerid,10012,0,!"{51FF0F}Справка",
!"{00FFFF}Бригады.\n\n\
{E8D699}Выжить одиночкам в этом мире очень сложно, поэтому многие мародеры объединяются в бригады.\n\
{E8D699}Вступить в бригаду можно только по приглашению ее лидера или заместителя.\n\
{E8D699}Создать свою бригаду может любой желающий, достигнувший 10 уровня авторитета.\n\
{E8D699}Оформление новой бригады стоит 5000 $.\n\
{E8D699}Лидер самостоятельно придумывает название бригады и цвет меток для ее участников.\n\n\
{D70000}Правила создания бригады:\n\n\
{E8D699}Название бригады должно соответствовать правилам сервера, т.е. никакой рекламы, зазывов и т.п.\n\
{E8D699}Запрещается называть свою бригаду так же, или схоже с другими бригадами.\n\
{E8D699}Название и цвет бригады не должны намекать на администрацию, например Стражи, Админы, Главные и т.п..\n\
{E8D699}Запрещается делать цвет зомби и мирных, темные и прозрачные цвета - ник должен легко читаться и быть видимым!\n\
{E8D699}Запрещается флудить приглашениями в бригаду. Посылайте приглашения только после устного договора!\n\
{E8D699}Бригады нарушителей будут удаляться, а лидер заблокирован.\n\n", !"Ок", "");

	        }
	        else if(listitem==5)//транспорт
	        {
	            ShowPlayerDialog(playerid, 10022,0, !"{51FF0F}Справка", !"{00FFFF}Транспорт на Сектор-2\n\n\
{E8D699}Передвигаться на поверхности пешком крайне опасно, поэтому, вам нужен транспорт!\n\
{E8D699}Имеется несколько видов транспорта:\n\
{E8D699}1. Брошенный транспорт. Эти машины можно найти на поверхности, починить и завести.\n\
{E8D699}2. Аренда. Вы можете взять в аренду мощные джипы на парковке у бункера.\n\
{E8D699}3. Рабочие машины. У каждой профессии (кроме оружейников) есть свой рабочий транспорт.\n\
{E8D699}4. Байк. Уникальный личный мотоцикл (подробности ниже).\n\
{E8D699}5. Личный транспорт. У Механика вы можете купить личные автомобили, которые никто не угонит!\n\n\
{D70000}Преимущества байка:\n\n\
{E8D699}- Работает без аккумулятора!\n\
{E8D699}- Остается там, где вы его бросили!\n\
{E8D699}- Сохраняет бензин, даже если вы вышли из игры!\n\
{E8D699}- Байк принадлежит вам, значит его не смогут угнать!\n\
{E8D699}- Доступен крутой тюнинг у Механика!\n\n\
{D70000}Преимущества личного транспорта:\n\n\
{E8D699}- Принадлежит вам, значит его не смогут угнать!\n\
{E8D699}- При выходе из игры ждет вас до своего респавна или уничтожения!\n\
{E8D699}- Доступны уникальные виды транспорта, которые на поверхности не найти!\n\
{E8D699}- Можно вызвать почти в любом месте карты!\n\
{E8D699}- Доступен крутой тюнинг у Механика!"
, !"Ок", "");
	        }
	        else if(listitem==6)//профессия
	        {
				ShowPlayerDialog(playerid, 10016,0, !"{51FF0F}Справка", !"{00FFFF}Работа\n\n\
{E8D699}Жить в постапокалиптическом мире трудно и опасно, но жить без денег и вовсе невозможно!\n\
{E8D699}Выбираться на поверхность и заниматься мародерством могут не все.\n\
{E8D699}Поэтому, многие предпочитают зарабатывать тут, в бункере Сектор-2!\n\
{E8D699}В основном, это подсобная работа, на различных влиятельных людей бункера.\n\n\
{E8D699}Устроиться на работу можно у Иваныча, у него целый список вакансий.\n\
{E8D699}В зависимости от места работы, у вас будут разные задания.\n\
{E8D699}За каждое выполненное задание от работодателя, вы получите очки заслуг.\n\
{E8D699}Чем больше очков заслуг - тем выше ваш ранг!\n\
{E8D699}А от ранга зависит зарплата, которую платят раз в сутки (игровые конечно же).\n\
{E8D699}Очки заслуг можно получить и другим способом - если задобрите работодателя Золотом!\n\
{E8D699}За одно золото он повысит ваши очки на 10!"
, !"Ок", "" );

	        }
	        else if(listitem==7)//правила
	        {
	            ShowPlayerDialog(playerid, 1004, 0, !"{51FF0F}Правила сервера", !"{FF0000}Правила GTA SA:MP SEKTOR-2:\n\n{00FF00}1.{E8D699} Все игровые аккаунты и их имущество является собственностью администрации проекта.\n{00FF00}2.{E8D699} Администрация не несет ответственности за утерянные игровые ценности.\n{00FF00}3.{E8D699} Пользователи (игроки) имеют право бесплатно пользоваться игрой, не нарушая предоставленных правил.\n{00FF00}4.{E8D699} За любое нарушение правил, игрок может быть заблокирован или оштрафован.\n{00FF00}5.{E8D699} Пожертвования проекту (донат) являются добровольным желанием и не являются обязательным условием.\n\n{FF0000}Запрещено:\n\n{E8D699}Использовать нецензурные, оскорбительные, провокационные, рекламные, нечитаемые и схожие ники!\n{E8D699}Использовать ЛЮБЫЕ сторонние программы, читы, скрипты, моды! {00FF00}Рекомендуем скачать GTA с нашего сайта.\n{E8D699}Заменять файлы в папке с игрой, в том числе устанавливать аддоны и сторонние русификаторы.\n{E8D699}Использовать или скрывать от администрации любые баги и ошибки в игре!\n{E8D699}Рекламировать и обсуждать ЛЮБЫЕ другие программы, игры и сайты. Делать массовые зазывы в соц сети и мессенджеры!\n{E8D699}Использовать ESC или сворачивать игру в целях ухода от погони/смерти.\n{E8D699}Оскорблять других игроков, а так же угрожать им расправой в реальной жизни.\n{E8D699}Нецензурно выражаться в чате, писать одно и тоже, писать сообщения без смысла или в верхнем регистре (Caps)\n{E8D699}Обсуждать и критиковать действия администрации, а так же негативно высказываться о сервере.\n{E8D699}Передавать и играть на чужих аккаунтах, а так же продавать и покупать аккаунты.\n{E8D699}Покупать и продавать игровую валюту и другое имущество, через других игроков, за реальные деньги.\n{E8D699}Принимать и передавать крупные денежные суммы. Если вы получили непонятные деньги, то сообщите администрации.\n{E8D699}Представляться администратором, модератором или любым другим сотрудником проекта, если вы таковым не являетесь.\n{E8D699}Игнорировать требования администрации.\n{E8D699}Создавать помехи игровому процессу в безопасных зонах (убивать, перегораживать путь, толкать транспорт и т.п.).\n{E8D699}Делать публичные заявления и угрозы об уходе из игры навсегда.\n\n{FF0000}Помните:\n\n{E8D699}Никогда, никому не давайте свой пароль! Администрация никогда не попросит его!\n{E8D699}Администрация имеет право заблокировать нарушителя без объяснения причин (согласно пункту 1).\n{E8D699}Ваша душа отныне принадлежит нам)\n{E8D699}Незнание правил не освобождает вас от ответственности!", "Принять >", "");

	        }
	    }
	}
	else if(dialogid==8825)//
	{
	    //статистика
	    //умения
	    //болезни
	    if(response)
	    {
	    
	        if(listitem==0)//статисика
	        {

			    new kill_human,
					kill_zombie,

					reg_date[10],
					kicks;

				//	cache_get_value_name_int(0,"kill_human",kill_human);
				//	cache_get_value_name_int(0,"kill_zombie",kill_zombie);
				//	cache_get_value_name(0,"reg_date",reg_date);
			     //   cache_get_value_name_int(0,"kicks",kicks);

			    static str_stat[512];
			    format(str_stat,sizeof(str_stat),
		"{BB0000}Житель:\n\
		{E8D699}Имя: {6CD900}%s\n\
		{E8D699}Пол: {6CD900}%s\n\
		{BB0000}Криминал:\n\
		{E8D699}Убито людей: {6CD900}%d\n\
		{E8D699}Убито зомби: {6CD900}%d\n\
		{E8D699}Попаданий в госпиталь: {6CD900}%d\n\
		{BB0000}Данные Бункера:\n\
		{E8D699}Прожито суток: {6CD900}%d\n\
		{E8D699}Авторитет: {6CD900}%d\n\
		{E8D699}Уважение: {6CD900}%d/%d\n\
		{E8D699}Деньги: {6CD900}%d$\n\
		{E8D699}Работа: {6CD900}%s\n\
		{E8D699}Ранг: {6CD900}%d\n\
		{E8D699}Комната: {6CD900}%s\n\
		{E8D699}Байк: {6CD900}%s\n\
		{BB0000}Группировки:\n\
		{E8D699}Бригада: {6CD900}%s\n\
		{E8D699}Название: {6CD900}%s\n\
		{E8D699}Титул: {6CD900}%s\n\
		{BB0000}Игровые данные:\n\
		{E8D699}Дата регистрации: {6CD900}%s\n\
		{E8D699}Киков: {6CD900}%d\n\
		{E8D699}Замечаний: {6CD900}%d\n\
		{E8D699}VIP защиты: {6CD900}%d"
				,
				pInfo[playerid][Name],
				pInfo[playerid][pol]==true?"Мужской":"Женский",
				kill_human,
				kill_zombie,
		        pInfo[playerid][deads],
		        pInfo[playerid][pol],
		        pInfo[playerid][chasov],
		        pInfo[playerid][lvl],
		        pInfo[playerid][Exp], pInfo[playerid][lvl]*4,
		        pInfo[playerid][money],
		        pInfo[playerid][jobid]==0?"Нет":pInfo[playerid][jobid]==1?"Медик":pInfo[playerid][jobid]==2?"Оружейник":pInfo[playerid][jobid]==3?"Наёмник":"Радиоведущий",
		        pInfo[playerid][rang],
		        pInfo[playerid][komnata]==true?"Есть":"Нет",
		        pInfo[playerid][bike]==true?"Есть":"Нет",
		        pInfo[playerid][gangid]>-1?"Есть":"Нет",
		        pInfo[playerid][gangname],
		        pInfo[playerid][gangTityl]==1?"Новичок":pInfo[playerid][gangTityl]==2?"Боец":pInfo[playerid][gangTityl]==3?"Брат":pInfo[playerid][gangTityl]==4?"Заместитель":pInfo[playerid][gangTityl]==5?"Лидер":"Нет",
				reg_date,
				kicks,
				pInfo[playerid][warns]
				);

				ShowPlayerDialog(playerid, 11004,0,!"{51FF0F}Статистика",str_stat,!"Oк","");
	        }
	        else if(listitem==1)//умения
	        {
	            new str_ymenia[371];
	            format(str_ymenia,371,
"{BB0000}Ремонтник: {E8D699}%d/100\n\
{BB0000}Бокс: {E8D699}%d/100\n\
{BB0000}Каратэ: {E8D699}%d/100\n\
{BB0000}Кикбокс: {E8D699}%d/100\n\
{BB0000}ТТ: {E8D699}%d/100\n\
{BB0000}Пустынный Орёл: {E8D699}%d/100\n\
{BB0000}Дробовики: {E8D699}%d/100\n\
{BB0000}Обрез: {E8D699}%d/100\n\
{BB0000}АК: {E8D699}%d/100\n\
{BB0000}М4: {E8D699}%d/100\n\
{BB0000}УЗИ: {E8D699}%d/100");
				ShowPlayerDialog(playerid,43,0,!"{00CE00}Ваши умения:",str_ymenia,!"Ок","");
	        }
	        else//болезни
	        {
	            new str_bolezni[264];
	            format(str_bolezni,264,
"{BB0000}Болезни:\n\n\
{E8D699}Простуда: {A4FFA4}%s\n\
{E8D699}Отравление: {A4FFA4}%s\n\
{E8D699}Вывих: {A4FFA4}%s\n\
{E8D699}Кровотечение: {A4FFA4}%s\n\n\
{BB0000}Эффекты:\n\n\
{E8D699}Мазь от зомби: {FF8080}%s\n\
{E8D699}Вонь из рюкзака: {A4FFA4}%s");
	            ShowPlayerDialog(playerid, 12002,0,!"{51FF0F}Болезни и эффекты",str_bolezni,!"Ок","");
	        }
	    }
	}
	else if(dialogid==9525)
	{
	    if(response)
	    {
	        if(listitem==0)//магазин одежды
	        {
	            SET_POS_ANGL(playerid,316.3358,2034.2455,895.4297,355.0000);
	        }
	        else//подработка новичкам
	        {
	            if(IsPlayerHaveResp(playerid)==false)
	            {
	            	SET_POS_ANGL(playerid,307.4561,1828.7163,6.9768,191.8428);
	            }
	            else
	            {
					SendClientMessage(playerid,0xafe70aFF,!"У вас уже есть респиратор, отправляйтесь на поверхность.");
	            }
	            	
	        }
	    }
	}
	else if(dialogid==10011)//бригада
	{
	    if(response)
	    {
	        if(listitem==0)
	        {
	        }
	        else if(listitem==1)
	        {
	        }
	        else if(listitem==2)
	        {
	        }
	        else if(listitem==3)
	        {
	        }
	        else if(listitem==4)
	        {
	        }
	        else if(listitem==5)
	        {
	            ShowPlayerDialog(playerid,10012,0,!"{51FF0F}Справка",
!"{00FFFF}Бригады.\n\n\
{E8D699}Выжить одиночкам в этом мире очень сложно, поэтому многие мародеры объединяются в бригады.\n\
{E8D699}Вступить в бригаду можно только по приглашению ее лидера или заместителя.\n\
{E8D699}Создать свою бригаду может любой желающий, достигнувший 10 уровня авторитета.\n\
{E8D699}Оформление новой бригады стоит 5000 $.\n\
{E8D699}Лидер самостоятельно придумывает название бригады и цвет меток для ее участников.\n\n\
{D70000}Правила создания бригады:\n\n\
{E8D699}Название бригады должно соответствовать правилам сервера, т.е. никакой рекламы, зазывов и т.п.\n\
{E8D699}Запрещается называть свою бригаду так же, или схоже с другими бригадами.\n\
{E8D699}Название и цвет бригады не должны намекать на администрацию, например Стражи, Админы, Главные и т.п..\n\
{E8D699}Запрещается делать цвет зомби и мирных, темные и прозрачные цвета - ник должен легко читаться и быть видимым!\n\
{E8D699}Запрещается флудить приглашениями в бригаду. Посылайте приглашения только после устного договора!\n\
{E8D699}Бригады нарушителей будут удаляться, а лидер заблокирован.\n\n", !"Ок", "");

	        }
	        
	    }
	}
	else if(dialogid==10013)//торговля
	{
	    if(response)
	    {
	        if(listitem==0)//открыть лавку
	        {
	            if(pInfo[playerid][slot]!=0)
	            {
	                pInfo[playerid][torg]=true;
	                SendClientMessage(playerid,8913066,!"Вы встали торговать вещами из своего рюкзака! (Отменить: N - Торговля)");
	                TogglePlayerControllable(playerid,0);
	            }
	            else
	            {
	                SendClientMessage(playerid,0xD20000AA,!"Ваш рюкзак пуст! Чем торговать?");
	            }
	        }
	        else if(listitem==1)//закрыть лавку
	        {
	            if(pInfo[playerid][torg]==true)
	            {
	                pInfo[playerid][torg]=false;
	                TogglePlayerControllable(playerid,1);
	            }
	            else
	            {
	                SendClientMessage(playerid,0xD20000AA,!"Вы не торгуете.");
	            }
	        }
			else//справка
			{
			    ShowPlayerDialog(playerid, 10014,0, !"{51FF0F}Справка", !"{00FFFF}Торговля\n\n\
{E8D699}С приходом постапокалипсиса мир многое потерял, но только не тягу к деньгам.\n\
{E8D699}Имея деньги по-прежнему можно позволить себе многое и забыть о проблемах.\n\
{E8D699}Поэтому, каждый выживший стремился заработать как можно больше баксов.\n\n\
{E8D699}Деньги можно заработать несколькими способами:\n\n\
{D70000}1. {E8D699}Выполнять задания влиятельных людей, например, Иваныча.\n\
{D70000}2. {E8D699}Искать вещи и продавать их NPC (доход: до 30 процентов).\n\
{D70000}3. {E8D699}Искать вещи и продавать их игрокам в лавке (доход: до 50 процентов).\n\
{D70000}4. {E8D699}Искать вещи и продавать их игрокам через предложение (доход: своя цена).\n\n\
{E8D699}Поставить и убрать лавку можно через личное меню (клавиша N).\n\
{E8D699}Вы не сможете двигаться во время торговли, однако можете разговаривать или уйти в АФК.\n\
{E8D699}На торг выставляется все содержимое вашего рюкзака! Цену можно посмотреть в описании вещей.\n\
{E8D699}Запрещается ставить лавку на проходах, местах спавна и на каких-либо объектах (столы, стулья, кровати и т.п.).", !"Ок", "");
			}
	    }
	}
	else if(dialogid==12000)
	{
	    if(response)
	    {
	        if(listitem==0)
	        {
				ShowPlayerDialog(playerid, 10001, 2, "{008000}Оружие", "{E8D699}У Сектора\n{E8D699}Ближний городок\n{E8D699}Дальний городок\n{E8D699}ЛС\n{E8D699}СФ\n{E8D699}ЛВ\n{E8D699}Ранчо\n{E8D699}Деревня", "Ок", "Отмена");
	        }
	        else if(listitem==1)
	        {
				ShowPlayerDialog(playerid, 10002, 2, "{FF0000}Больница", "{E8D699}Ближний городок\n{E8D699}Дальний городок\n{E8D699}ЛС\n{E8D699}СФ\n{E8D699}ЛВ\n{E8D699}Крематорий и морг", "Ок", "Отмена");
	        }
	        else if(listitem==2)
	        {
				ShowPlayerDialog(playerid, 10003, 2, "{0080FF}Полиция", "{E8D699}Ближний городок\n{E8D699}Дальний городок\n{E8D699}ЛС\n{E8D699}СФ\n{E8D699}ЛВ\n{E8D699}Чилиад", "Ок", "Отмена");
	        }
	        else if(listitem==3)
	        {
				ShowPlayerDialog(playerid, 10004, 2, "{FF8000}Одежда", "{E8D699}Ближний городок\n{E8D699}ЛС\n{E8D699}СФ\n{E8D699}ЛВ", "Ок", "Отмена");
	        }
	        else if(listitem==4)
	        {
				ShowPlayerDialog(playerid, 10007, 2, "{80FF00}Кафе и магазины продуктов", "Пицца-городок\nПицца-курица\nПродукты у Сектора\nДальний городок\nСельское 1\nСельское 2\nСельское 3\nСельское 4\nПродукты у ранчо\nПридорожное", "Ок", "Отмена");
	        }
	        else if(listitem==5)
	        {
				ShowPlayerDialog(playerid, 10005, 2, "{FFFF00}Разное", "Студия\nШахта\nПожарные\nМолокозавод\nМясной завод\nЗавод газировки\nХрам\nДом отдыха\nПочта\nОтель\nЦентральный склад\nПраздник\nПрачечная\nБильярд\nСекс-шоп", "Ок", "Отмена");
	        }
	        else //if(listitem==6)
	        {
				ShowPlayerDialog(playerid, 10006, 2, "{80FF00}Убежища", "{E8D699}Бункер Сектор-2\n{E8D699}Метро ЛС\n{E8D699}Метро СФ", "Ок", "Отмена");
	        }
	    }
	}
	else if(dialogid==10001)
	{
	    
	    if(response)
	    {
			SendClientMessage(playerid,-1,!"Место отмечено меткой на карте.");
	        if(listitem==0)
	        {
	            SetPlayerCheckpoint(playerid, 777.280029,1871.369995,4.680000, 4.000000);
	        }
	        else if(listitem==1)
	        {
	            SetPlayerCheckpoint(playerid, -315.609985,829.820007,13.830000, 4.000000);
	        }
	        else if(listitem==2)
	        {

				SetPlayerCheckpoint(playerid, -1508.949951,2610.229980,55.560001, 4.000000);
	        }
	        else if(listitem==3)
	        {
	            SetPlayerCheckpoint(playerid, 1368.381104,-1279.767334,13.274000, 4.000000);
	        }
	        else if(listitem==4)
	        {
	            SetPlayerCheckpoint(playerid, -2625.891602,208.968979,4.422340, 4.000000);
	        }
	        else if(listitem==5)
	        {
	            SetPlayerCheckpoint(playerid, 2557.570068,2101.290039,10.350000, 4.000000);
	        }
	        else if(listitem==6)
	        {
	            SetPlayerCheckpoint(playerid, 242.188004,-178.389008,1.191000, 4.000000);
	        }
	        else //if(listitem==5)
	        {
	            SetPlayerCheckpoint(playerid, 2333.637451,61.599201,26.291100, 4.000000);
	        }
	    }
	}
	else if(dialogid==10002)
	{
	    if(response)
	    {
			SendClientMessage(playerid,-1,!"Место отмечено меткой на карте.");
	        if(listitem==0)
	        {
	            SetPlayerCheckpoint(playerid, -318.737610,1048.512207,20.051861, 4.000000);
	        }
			else if(listitem==1)
	        {
	            SetPlayerCheckpoint(playerid, -1514.716431,2519.642822,55.753170, 4.000000);
	        }
	        else if(listitem==2)
	        {
	            SetPlayerCheckpoint(playerid, 1172.461548,-1323.354736,15.007200, 4.000000);
	        }
	        else if(listitem==3)
	        {
	            SetPlayerCheckpoint(playerid, -2665.034180,639.538879,14.261390, 4.000000);
	        }
	        else if(listitem==4)
	        {
	            SetPlayerCheckpoint(playerid, 1607.410034,1815.640015,10.650000, 4.000000);
	        }
	        else //if(listitem==5)
	        {
	            SetPlayerCheckpoint(playerid, 1455.465698,751.005737,10.739110, 4.000000);
	        }
	    }
	}
	else if(dialogid==10003)
	{
	    if(response)
	    {
			SendClientMessage(playerid,-1,!"Место отмечено меткой на карте.");
	        if(listitem==0)
	        {
	            SetPlayerCheckpoint(playerid, -217.699997,979.150024,19.150000, 4.000000);
	        }
			else if(listitem==1)
	        {
	            SetPlayerCheckpoint(playerid, -1390.089966,2638.560059,55.689999, 4.000000);
	        }
	        else if(listitem==2)
	        {
	            SetPlayerCheckpoint(playerid, 1555.199219,-1675.591187,15.752000, 4.000000);
	        }
	        else if(listitem==3)
	        {
	            SetPlayerCheckpoint(playerid, -1605.483765,711.284851,13.787950, 4.000000);
	        }
	        else if(listitem==4)
	        {
	            SetPlayerCheckpoint(playerid, 2337.129883,2459.100098,14.670000, 4.000000);
	        }
	        else //if(listitem==5)
	        {
				SetPlayerCheckpoint(playerid, -2161.908691,-2385.571533,30.431129, 4.000000);
	        }
	    }
	}
	else if(dialogid==10004)
	{
	    if(response)
	    {
			SendClientMessage(playerid,-1,!"Место отмечено меткой на карте.");
	        if(listitem==0)
	        {
	            SetPlayerCheckpoint(playerid, -145.789993,1173.739990,19.670000, 4.000000);
	        }
			else if(listitem==1)
	        {
	            SetPlayerCheckpoint(playerid, 461.144653,-1500.701782,30.852699, 4.000000);
	        }
	        else if(listitem==2)
	        {
	            SetPlayerCheckpoint(playerid, -1694.737305,951.618103,24.556601, 4.000000);
	        }
	        else
	        {
	            SetPlayerCheckpoint(playerid, 2869.060059,2438.280029,10.830000, 4.000000);
	        }

	    }
	}
	else if(dialogid==10007)
	{
	    if(response)
	    {
			SendClientMessage(playerid,-1,!"Место отмечено меткой на карте.");
	        if(listitem==0)
	        {
                SetPlayerCheckpoint(playerid, -53.900002,1188.890015,19.120001, 4.000000);
	        }
			else if(listitem==1)
	        {
                SetPlayerCheckpoint(playerid, -227.350006,2711.550049,62.700001, 4.000000);
	        }
	        else if(listitem==2)
	        {
	            SetPlayerCheckpoint(playerid, 663.020020,1716.439941,6.830000, 4.000000);

	        }
	        else if(listitem==3)
	        {
	        	SetPlayerCheckpoint(playerid, -1271.339966,2713.290039,49.970001, 4.000000);

	        }
	        else if(listitem==4)
	        {
	            SetPlayerCheckpoint(playerid, 681.470825,-473.683350,16.131001, 4.000000);

	        }
	        else if(listitem==5)
	        {
	            SetPlayerCheckpoint(playerid, 1367.374512,248.409470,19.068001, 4.000000);

	        }
	        else if(listitem==6)
	        {
	            SetPlayerCheckpoint(playerid, 2332.671387,75.019127,26.143999, 4.000000);

	        }
	        else if(listitem==7)
	        {
	            SetPlayerCheckpoint(playerid, -2154.728027,-2460.554199,30.462601, 4.000000);

	        }
	        else if(listitem==8)
	        {
	            SetPlayerCheckpoint(playerid, 254.392075,-61.675659,1.076450, 4.000000);

	        }
	        else 
	        {
	            SetPlayerCheckpoint(playerid, -1465.811279,1873.432983,32.181801, 4.000000);

	        }


	    }
	}
	else if(dialogid==10005)
	{
	    if(response)//15 -0 = 14
	    {
			SendClientMessage(playerid,-1,!"Место отмечено меткой на карте.");
	        if(listitem==0)
	        {
                SetPlayerCheckpoint(playerid, -99.110001,1083.459961,19.430000, 4.000000);
	        }
			else if(listitem==1)
	        {
	            SetPlayerCheckpoint(playerid, 616.010864,877.781677,-43.972679, 4.000000);

	        }
	        else if(listitem==2)
	        {
	            SetPlayerCheckpoint(playerid, -2026.650024,67.139999,28.580000, 4.000000);

	        }
			else if(listitem==3)
	        {
	            SetPlayerCheckpoint(playerid, -2454.530029,2254.060059,4.800000, 4.000000);

	        }
	        else if(listitem==4)
	        {
	            SetPlayerCheckpoint(playerid, 1111.439941,-976.270020,42.580002, 4.000000);

	        }
	        else if(listitem==5)
	        {
	            SetPlayerCheckpoint(playerid, 1324.235107,286.514435,19.566219, 4.000000);

	        }
	        else if(listitem==6)
	        {
	            SetPlayerCheckpoint(playerid, -794.729980,1557.000000,26.860001, 4.000000);

	        }
			else if(listitem==7)
	        {
	            SetPlayerCheckpoint(playerid, -314.137329,1774.666016,43.240028, 4.000000);

	        }
	        else if(listitem==8)
	        {
	            SetPlayerCheckpoint(playerid, 2145.302002,2834.544434,10.300000, 4.000000);
	        

	        }
	        else if(listitem==9)
	        {
	            SetPlayerCheckpoint(playerid, 2232.560547,-1159.816650,25.674601, 4.000000);
	        }
	        else if(listitem==10)
	        {
	            SetPlayerCheckpoint(playerid, -86.209846,-299.335632,2.567310, 4.000000);

	        }
			else if(listitem==11)
	        {
	            SetPlayerCheckpoint(playerid, -19.099581,1175.855713,19.262100, 4.000000);

	        }
	        else if(listitem==12)
	        {
                SetPlayerCheckpoint(playerid, 2109.095459,2652.853271,10.532500, 4.000000);
	        }
         	else if(listitem==13)
	        {
                SetPlayerCheckpoint(playerid, 2309.855225,-1643.921753,14.527380, 4.000000);
	        }
	        else
	        {
                SetPlayerCheckpoint(playerid, 1087.676270,-922.499512,43.097599, 4.000000);
	        }

	    }
	}
	else if(dialogid==10006)
	{
	    if(response)
	    {
			SendClientMessage(playerid,-1,!"Место отмечено меткой на карте.");
	        if(listitem==0)
	        {
                SetPlayerCheckpoint(playerid, 213.863708,1876.047485,12.134030, 4.000000);
	        }
			else if(listitem==1)
	        {
                SetPlayerCheckpoint(playerid, 823.530029,-1341.689941,12.510000, 4.000000);
	        }
	        else 
	        {
                SetPlayerCheckpoint(playerid, -1960.027344,486.967407,31.707899, 4.000000);
	        }


	    }
	}
	else if(dialogid==7836)
	{
	    if(response)
	    {
			if(listitem==0)
			{
			}
			else if(listitem==1)
			{
			}
			else if(listitem==2)
			{
			}
			else if(listitem==3)
			{
			}
			else if(listitem==4)
			{
				ShowPlayerDialog(playerid, 7837, 2, "{00FF00}Доставка ресурсов", "{C5C589}Взять задание\n{C5C589}Сдать задание", "Выбрать", "Закрыть");

			}
			else if(listitem==5)
			{
			}
			else if(listitem==6)
			{

			ShowPlayerDialog(playerid, 7838, 2, "{00FF00}Изготовление оружия", "{C5C589}Коктейль Молотова {009500}водка + тряпки + канистра с бенз.\n{C5C589}Патроны для обреза {009500}запчасти + патроны для ТТ\n{C5C589}Обрез {009500}Часть оружия + запчасти\n{C5C589}Зажигательные капсулы {009500}Часть оружия + патроны для ТТ + канистра с бенз.\n{C5C589}Зажигательный пистолет {009500}Часть оружия + запчасти + ТТ.", "Выбрать", "Закрыть");
			}
	    }
	}
	else if(dialogid==7837)
	{
	    if(response)
	    {
	        if(listitem==0)
	        {
	            if(pInfo[playerid][zmaster]==0)
	            {
	                new zmast= random(3);
	                zmast++;

	                if(zmast==1)
	                {
	                   	SendClientMessage(playerid,0xFC6103FF,!"МАСТЕР: {FFFFFF}Людям постоянно нужно что-то починить, но у меня осталось мало ресурсов.");
	                    SendClientMessage(playerid,0xFC6103FF,!"МАСТЕР: {FFFFFF}Принеси мне 5 запчастей, я куплю их у тебя дороже, чем Иваныч!");
	                }
					if(zmast==2)
	                {
	                    SendClientMessage(playerid,0xFC6103FF,!"МАСТЕР: {FFFFFF}Для создания разных бомбочек мне нужен порох, а его сейчас не найти.");
	                    SendClientMessage(playerid,0xFC6103FF,!"МАСТЕР: {FFFFFF}Поэтому, я достаю его из патронов. Принеси мне самые дешевые, на ТТ, 5 обойм.");
					}
					if(zmast==3)
	                {
	                    SendClientMessage(playerid,0xFC6103FF,!"МАСТЕР: {FFFFFF}Микросхемы сейчас нигде не купить, а они мне очень нужны.");
	                    SendClientMessage(playerid,0xFC6103FF,!"МАСТЕР: {FFFFFF}Принеси мне 3 навигатора, я попробую выпаять их от туда!");
	                }
	                SendClientMessage(playerid,0x00ffffFF,!"Если вы работаете в мастерской, то за это задание получите очки ранга!");
	                pInfo[playerid][zmaster]=zmast;
	            }
	        }
	        else
	        {
	            if(pInfo[playerid][zmaster]==0)
	            {
	            }
	            
	        }
	    }
	}
	else if(dialogid==9126)//аренда машины
	{
	    if(response)
	    {
	        if(GetLVL(playerid)!=0)
	        {
	            if(pInfo[playerid][money]>=300)
	            {
	                SendClientMessage(playerid,0x00880000,!"Вы взяли машину в аренду!");
	                GivesPlayerMoney(playerid,-300);
	                new vehicleid=GetPlayerVehicleID(playerid);
	                
	                vInfo[vehicleid][akum]=100;
	                vInfo[vehicleid][benz]=50;
	                
	                
	                PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][24],"~g~+/-");
	                PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][23],"~g~F");
	                
	            }
	            else
	            {
	                SendClientMessage(playerid,-1077886209,!"У вас нет 300$!");
	            }
	        }
	    }
	}
	else if(dialogid==12223)//мусорка
	{
	}
	else if(dialogid==15222)
	{
	    if(response)
	    {
	        if(listitem==0)
	        {
			    SetPlayerPos(playerid,72.7018,1963.6031,823.3466);
			    SetPlayerFacingAngle(playerid,354.9999);
			    
	            SendClientMessage(playerid,0x008800FF,!"Это стрельбище, тут можно повысить свое мастерство стрельбы!");
	        }
	        else
	        {
			    SetPlayerPos(playerid,190.1678,1823.9392,1217.6525);
			    SetPlayerFacingAngle(playerid,179.5191);

	            SendClientMessage(playerid,0x008800FF,!"Это офис Шрама - лидера наёмников.");
	        }
	    }
	}
	else if(dialogid==5000)//комната
	{
	    if(response)
	    {
	        if(listitem==0)
	        {
ShowPlayerDialog(playerid, 105,0,"{51FF0F}Комнаты",
"{FC6C03}Аренда жилья.\n\n\
{E8D699}Единственные безопасные места на планете - это подземные бункеры.\n\
{E8D699}Но места в них очень мало, поэтому, за удобства нужно платить.\n\
{E8D699}В катакомбах своего бункера Иваныч построил целый отель, с кучей комнат, пригодных для жилья.\n\
{E8D699}Те счастливчики, кто смог купить у него комнату, получили свой собственный, безопасный уголок!\n\
{E8D699}В комнате можно отдохнуть, выложить лишние вещи в сейф и собраться в новый поход.\n\
{E8D699}Арендой платы тут нет, поэтому купленная комната остается вашей навсегда!","Ок","");
	        }
	        else if(listitem==1)
	        {
	        }
	        else if(listitem==2)
	        {
	            ShowPlayerDialog(playerid, 1780,1, !"{FF00FF}Комнаты","К кому вы хотите пойти? Введите ИД:", !"ОК", !"Отмена");
	        }
	        else //if(listitem==3)
	        {
	        }
	    }
	}
	else if(dialogid==10915)//
	{
	    if(response)
	    {
			new pojatid=strval(inputtext);
			if(IsPlayerNPC(pojatid)==0&&pojatid<500)
			{
			    if(IsPlayerInRangeOfPoint(playerid,2.43,pInfo[pojatid][pos_x],pInfo[pojatid][pos_y],pInfo[pojatid][pos_z])&&IsPlayerInAnyVehicle(pojatid)==0)
			    {
					if(pInfo[pojatid][pojal]==1)
					{
						if(pojatid!=playerid)
						{
							ApplyAnimation(playerid,"GANGS","hndshkfa",4.000000, 0, 0,0,0,0);
							ApplyAnimation(pojatid,"GANGS","hndshkfa",4.000000, 0, 0,0,0,0);
						    new str_pojatie[65];
						    format(str_pojatie,65,"%s пожал(а) руку %s'у",pInfo[playerid][Name],pInfo[pojatid][Name]);
						    PrintGreenInRadius(str_pojatie,pInfo[pojatid][pos_x],pInfo[pojatid][pos_y],pInfo[pojatid][pos_z]);
					    }
					    else
					    {
					        SendClientMessage(playerid,-1263159297,!"Ты пожал руку сам себе. Грустно.");
					    }
					}
					else
					{
						SendClientMessage(playerid,-10270806,!"Этот житель не разрешал пожимать себе руку!");
					}
			    }
			}
	    }
	}
	else if(dialogid==10916)//
	{
	    if(response)
	    {
	        new obnatid=strval(inputtext);

			if(IsPlayerNPC(obnatid)==0&&obnatid<500)
			{
			    if(IsPlayerInRangeOfPoint(playerid,2.43,pInfo[obnatid][pos_x],pInfo[obnatid][pos_y],pInfo[obnatid][pos_z])&&IsPlayerInAnyVehicle(obnatid)==0)
			    {
				    if(pInfo[obnatid][obnal]==1)
					{
					   	if(pInfo[playerid][pol]!=pInfo[obnatid][pol])
					   	{
						    SetPlayerFacingPos(playerid, pInfo[obnatid][pos_x],pInfo[obnatid][pos_y]);
						    SetPlayerFacingPos(obnatid, pInfo[playerid][pos_x],pInfo[playerid][pos_y]);

							ApplyAnimation(playerid,"bd_fire","grlfrd_kiss_03",4.0,0,0,0,0,0);
	                        ApplyAnimation(obnatid,"bd_fire","grlfrd_kiss_03",4.0,0,0,0,0,0);
						}
					}
					else
					{
					    SendClientMessage(playerid,-10270806,!"Этот житель не разрешал обнимать себя!");
					}
				}
			}

		}
	}
	else if(dialogid==10917)//признается что любит
	{
	    if(response)
	    {
	        new loveid=strval(inputtext);
			if(playerid!=loveid)
			{
				if(IsPlayerNPC(loveid)==0&&loveid<500)
				{
				    if(IsPlayerInRangeOfPoint(playerid,2.43,pInfo[loveid][pos_x],pInfo[loveid][pos_y],pInfo[loveid][pos_z])&&IsPlayerInAnyVehicle(loveid)==0)
				    {

						ApplyAnimation(playerid,"cop_ambient","copbrowse_shake",4.099,0,1,1,1,0);
						new str_love[70];
						format(str_love,70,"%s признается что любит %s",pInfo[playerid][Name],pInfo[loveid][Name]);
						PrintGreenInRadius(str_love,pInfo[playerid][pos_x],pInfo[playerid][pos_y],pInfo[playerid][pos_z]);
					}
				}
			}
			else
			{
			    SendClientMessage(playerid,0xb4b5b700,!"Нельзя признаться в любви самому себе :P");
			}
		}
	}
	else if(dialogid==10918)//поцеловать туда
	{
	    if(response)
	    {
	        new loveid=strval(inputtext);
	        if(playerid!=loveid)
	        {
				if(IsPlayerNPC(loveid)==0&&loveid<500)
				{
				    if(IsPlayerInRangeOfPoint(playerid,2.43,pInfo[loveid][pos_x],pInfo[loveid][pos_y],pInfo[loveid][pos_z])&&IsPlayerInAnyVehicle(loveid)==0)
				    {
						if(pInfo[loveid][intim]==1)
						{
							if(pInfo[playerid][voda]>=11)
							{
							    ApplyAnimation(loveid,"blowjobz","bj_couch_end_p",4.1,0,1,1,1,5);
							    ApplyAnimation(playerid,"blowjobz","bj_couch_end_w",4.1,0,1,1,1,5);

							    pInfo[playerid][voda]-=10;

							    new str_priatno[75];
							    format(str_priatno,75,"%s делает приятное, %s орально)",pInfo[playerid][Name],pInfo[loveid][Name]);
							    PrintGreenInRadius(str_priatno,pInfo[playerid][pos_x],pInfo[playerid][pos_y],pInfo[playerid][pos_z]);

							    SendClientMessage(playerid,0xFF0000AA,!"Ваше настроение улучшилось!");
							}
							else
							{
							    SendClientMessage(playerid,-10270806,!"Вы слабы и хотите пить!");
							}
						}
						else
						{
						    SendClientMessage(playerid,-10270806,!"Этот житель не хочет заниматься сексом!");
						}
					}
				}
			}
			else
			{
			    SendClientMessage(loveid,0xb4b5b700,!"Самому себе соснуть не получится...");
			}
		}
	}
	else if(dialogid==10919)//нашлепать
	{
	    if(response)
	    {
	        new loveid=strval(inputtext);
			if(playerid!=loveid)
			{
				if(IsPlayerNPC(loveid)==0&&loveid<500)
				{
				    if(IsPlayerInRangeOfPoint(playerid,2.43,pInfo[loveid][pos_x],pInfo[loveid][pos_y],pInfo[loveid][pos_z])&&IsPlayerInAnyVehicle(loveid)==0)
				    {
				        if(pInfo[loveid][intim]==1)
						{
							if(pInfo[playerid][voda]>=11)
							{
							    ApplyAnimation(loveid,"snm","spankingw",4.1,0,1,1,1,1);
							    ApplyAnimation(playerid,"snm","spankedw",4.1,0,1,1,1,1);

							    pInfo[playerid][voda]-=10;

								SendClientMessage(loveid,0xFF0000AA,!"Вам нашлепали по попе!");
							    new str_priatno[58];
							    format(str_priatno,58,"%s нашлепал %s",pInfo[playerid][Name],pInfo[loveid][Name]);
							    PrintGreenInRadius(str_priatno,pInfo[playerid][pos_x],pInfo[playerid][pos_y],pInfo[playerid][pos_z]);

							    SendClientMessage(playerid,0xFF0000AA,!"Ваше настроение улучшилось!");
							    SendClientMessage(loveid,0xFF0000AA,!"Ваше настроение улучшилось!");
							}
							else
							{
							    SendClientMessage(playerid,-10270806,!"Вы слабы и хотите пить!");
							}
						}
						else
						{
						    SendClientMessage(playerid,-10270806,!"Этот житель не хочет заниматься сексом!");
						}
					}
				}
			}
			else
			{
			    SendClientMessage(playerid,0xb4b5b700,!"Самому себе не получится");
			}
		}
	}
	else if(dialogid==12500)// KPK кпк
	{
		if(response)
		{
		    if(listitem==0)//баланс
		    {
		    }
		    else if(listitem==1)//смс
		    {
		        ShowPlayerDialog(playerid, 2129,0, !"{00FF00}СМС", !"Нажмите Tab, кликните по имени жителя и введите текст смс.", !"Ок",!"" );
		    }
		    else if(listitem==2)//календарь, должно быть смс на радио
		    {
				new year,month,dayy;
				getdate(year,month,dayy);

				new months[12][9]=
				{
				    "Января",
				    "Февраля",
				    "Марта",
				    "Апреля",
				    "Мая",
				    "Июня",
				    "Июля",
				    "Августа",
				    "Сентября",
				    "Октября",
				    "Ноября",
				    "Декабря"

				};
				new str_dates[32];
				format(str_dates,32,"Дата: {FFFFFF}%d %s %d г.",dayy,months[month-1],year);

				SendClientMessage(playerid,0xFF0000AA,str_dates);

		    }
		    else if(listitem==3)//рингтон
		    {
				ShowPlayerDialog(playerid, 12503,2, !"{51FF0F}Рингтон смс", "{E8D699}1 (стандарт)\n\
{E8D699}2\n\
{E8D699}3\n\
{E8D699}4\n\
{E8D699}Беззвучно", !"Ок", !"Отмена");
		    }
		    else if(listitem==4)//радио сектор
		    {
		    
		    }
		    else if(listitem==5)//выключить радио
		    {
		    
		    }
		    else //if(listitem==1)//камера сделать селфи
		    {
		    
		    }
		    PlayerPlaySound(playerid,3600,0.0,0.0,0.0);
		}
	}
	else if(dialogid==12503)//рингтон
	{
		if(response)
		{
		    if(listitem==0)
		    {
		        PlayerPlaySound(playerid,21001,0.0,0.0,0.0);
		        pInfo[playerid][kpk_snd]=0;
		        SendClientMessage(playerid,0x00FF0000,!"Рингтон установлен!");
		    }
		    else if(listitem==1)
		    {
		        PlayerPlaySound(playerid,20804,0.0,0.0,0.0);
		        pInfo[playerid][kpk_snd]=1;
		        SendClientMessage(playerid,0x00FF0000,!"Рингтон установлен!");
		    }
		    else if(listitem==2)
		    {
		        PlayerPlaySound(playerid,23000,0.0,0.0,0.0);
		        pInfo[playerid][kpk_snd]=2;
		        SendClientMessage(playerid,0x00FF0000,!"Рингтон установлен!");
		    }
		    else if(listitem==3)
		    {
		        PlayerPlaySound(playerid,20600,0.0,0.0,0.0);
		        pInfo[playerid][kpk_snd]=3;
		        SendClientMessage(playerid,0x00FF0000,!"Рингтон установлен!");
		    }
		    else if(listitem==4)
		    {
		        PlayerPlaySound(playerid,30800,0.0,0.0,0.0);
		        pInfo[playerid][kpk_snd]=4;
		        SendClientMessage(playerid,0x00FF0000,!"Беззвучный режим включен!");
		    }
		}
	}
	return 1;
}
forward staticstika(playerid);
public staticstika(playerid)
{
	new rows;
	//cache_get_row_count(rows);
	if(rows)
	{
	    new kill_human,
			kill_zombie,
			
			reg_date[10],
			kicks;
			
		//	cache_get_value_name_int(0,"kill_human",kill_human);
		//	cache_get_value_name_int(0,"kill_zombie",kill_zombie);
		//	cache_get_value_name(0,"reg_date",reg_date);
	     //   cache_get_value_name_int(0,"kicks",kicks);
	
	    static str_stat[512];
	    format(str_stat,sizeof(str_stat),
"{BB0000}Житель:\n\
{E8D699}Имя: {6CD900}%s\n\
{E8D699}Пол: {6CD900}%s\n\
{BB0000}Криминал:\n\
{E8D699}Убито людей: {6CD900}%d\n\
{E8D699}Убито зомби: {6CD900}%d\n\
{E8D699}Попаданий в госпиталь: {6CD900}%d\n\
{BB0000}Данные Бункера:\n\
{E8D699}Прожито суток: {6CD900}%d\n\
{E8D699}Авторитет: {6CD900}%d\n\
{E8D699}Уважение: {6CD900}%d/%d\n\
{E8D699}Деньги: {6CD900}%d$\n\
{E8D699}Работа: {6CD900}%s\n\
{E8D699}Ранг: {6CD900}%d\n\
{E8D699}Комната: {6CD900}%s\n\
{E8D699}Байк: {6CD900}%s\n\
{BB0000}Группировки:\n\
{E8D699}Бригада: {6CD900}%s\n\
{E8D699}Название: {6CD900}%s\n\
{E8D699}Титул: {6CD900}%s\n\
{BB0000}Игровые данные:\n\
{E8D699}Дата регистрации: {6CD900}%s\n\
{E8D699}Киков: {6CD900}%d\n\
{E8D699}Замечаний: {6CD900}%d\n\
{E8D699}VIP защиты: {6CD900}%d"
		,
		pInfo[playerid][Name],
		pInfo[playerid][pol]==true?"Мужской":"Женский",
		kill_human,
		kill_zombie,
        pInfo[playerid][deads],
        pInfo[playerid][pol],
        pInfo[playerid][chasov],
        pInfo[playerid][lvl],
        pInfo[playerid][Exp], pInfo[playerid][lvl]*4,
        pInfo[playerid][money],
        pInfo[playerid][jobid]==0?"Нет":pInfo[playerid][jobid]==1?"Медик":pInfo[playerid][jobid]==2?"Оружейник":"Наёмник",
        pInfo[playerid][rang],
        pInfo[playerid][komnata]==true?"Есть":"Нет",
        pInfo[playerid][bike]==true?"Есть":"Нет",
        pInfo[playerid][gangid]>-1?"Есть":"Нет",
        pInfo[playerid][gangname],
        pInfo[playerid][gangTityl]==1?"Новичок":pInfo[playerid][gangTityl]==2?"Боец":pInfo[playerid][gangTityl]==3?"Брат":pInfo[playerid][gangTityl]==4?"Заместитель":pInfo[playerid][gangTityl]==5?"Лидер":"Нет",
		reg_date,
		kicks,
		pInfo[playerid][warns]
		);
		
		ShowPlayerDialog(playerid, 11004,0,!"{51FF0F}Статистика",str_stat,!"Oк","");
	
	}
}
public OnPlayerKeyStateChange(playerid, newkeys, oldkeys)
{
	if(newkeys==KEY_SECONDARY_ATTACK)//key f
	{
	    if(IsPlayerInRangeOfPoint(playerid,6.3,267.749176,1862.402832,8.162060))//ВРАЧ
	    {
			if(IsPlayerInRangeOfPoint(playerid,3.1,267.749176,1862.402832,8.162060))
			{
			    PlayerPlaySound(playerid,6401,0.0,0.0,0.0);
				ShowPlayerDialog(playerid, 210,2, !"{00FF00}Госпиталь бункера 'Сектор-2'", !"{DADAB6}Полное лечение ({00FF00}только для новичков{DADAB6})\n\
{DADAB6}Справка о работе\n\
{DADAB6}Ваш ранг\n\
{FF8000}Взятка (ранг за золото)\n\
{FF8000}Задания (ранг за работу)\n\
{0080FF}АПТЕКА: Купить медикаменты\n\
{FF5B5B}Изготовить медикаменты\n\
Вам нужна помощь?\n\
Много ли поступает раненых?\n\
Где вы берете лекарства?\n\
Кто такие зараженные?", !"Выбрать", !"Закрыть");
			}
			else
			{
			    SendClientMessage(playerid,0xafafaaFF , !"Вы не в госпитале!");
			}
	    }
	    else if(IsPlayerInRangeOfPoint(playerid,8.34,244.490005, 1856.699951, 8.310000))//ИВАНЫЧ
	    {	                                       
			if(IsPlayerInRangeOfPoint(playerid,3.36,244.490005, 1856.699951, 8.310000))
			{
				ShowPlayerDialog(playerid, 110,2,"{00FF00}Бар бункера 'Сектор-2'",!"\
{DADAB6}Поговорить с барменом\n\
{FF8000}Задания на поверхности\n\
{FF8000}Работа в бункере (вакансии)\n\
{00BB00}Денежное хранилище\n\
{6BB6B6}Бар Иваныча\n\
{0080FF}Оружие\n\
{0080FF}Патроны\n\
{0080FF}Снаряжение\n\
{0080FF}Драгоценности","Выбрать","Закрыть");
//\n\{FF0000}Изгнать бригаду"
			}
			else
			{
			    SendClientMessage(playerid,0xafafaaFF ,!"Вы не у бара!");
			}
	    }
		else if(IsPlayerInRangeOfPoint(playerid,3.4, 289.8080, 1831.6809, 8.0244))//мастер
		{
			ShowPlayerDialog(playerid, 7836, 2, !"{00FF00}Мастер", !"{FF0000}Защитный костюм\n{DADAB6}Ваш ранг\nПочинить бронежилет\nПочинить оружие\nЗадания по доставке (ранг за работу)\nВзятка (ранг за золото)\nИзготовление оружия\n{FFFFFF}Кто ты?\nМожешь меня чему-то научить?\nГде ты берешь материалы?\nЗачем в бункере оружие?\nЧто такое защитный костюм?", "Выбрать", "Закрыть");
		}
		else if(IsPlayerInRangeOfPoint(playerid,3.7,252.9284, 1842.1746, 8.2463))
		{
			ShowPlayerDialog(playerid, 20086, 0, !"{51FF0F}Доска объявлений", "", !"Добавить", !"Отмена");//изменить
		}
		else if(IsPlayerInRangeOfPoint(playerid,7.7,316.9291,2051.9343,895.4297))
		{
			if(IsPlayerInRangeOfPoint(playerid,4.0,244.490005, 1856.699951, 8.310000))
			{
				ShowPlayerDialog(playerid, 8836, 1, "{00BF00}Купить шмотки", !"{F47A00}Сменить имидж - отличное решение!\n{3399FF}Введите номер модели, которую хотите купить:", "Ок", "<< Назад");
			}
			else
			{
			    SendClientMessage(playerid,0xafafaaFF ,!"Вы не у прилавка!");
			}
		}
		else
		{
		    printf("find start");
		    new Float:x,Float:y,Float:z;
		    new strloot[400];
			new a;
		    for(new i=0;i<endloot&&a<20;++i)
		    {
		        printf("find %d",i);
		  //      DropLoot[masive][type]=DropLoot[endloot][type];
//	DropLoot[masive][dynO]=DropLoot[endloot][dynO];
//	DropLoot[masive][dynT]=DropLoot[endloot][dynT];
				if(IsValidDynamicObject(DropLoot[endloot][dynO]))
				{
					GetDynamicObjectPos(DropLoot[endloot][dynO],x,y,z);
				
					if(IsPlayerInRangeOfPoint(playerid,3.5,x,y,z))
					{
						printf("find s %d",i);
				        PreLoot[playerid][a]=i;
						strcat(strloot,InfoLoot[DropLoot[i][luttype]][NAMEloot]);
						strcat(strloot,"\n");
						++a;
				    }
				}
		    }
		    if(a!=0)
		    {
			    printf("find show");
		    	ShowPlayerDialog(playerid,1001,2,"Хабар",strloot,"Взять","Отмена");
			}
			printf("find end");
		}
	}
	else if(newkeys==KEY_WALK)
	{
		if(IsPlayerInRangeOfPoint(playerid,3.2,255.8143, 1842.3452, 7.7619))
		{
		    new mysr[200];
		    for(new i;i<10;i++)
		    {
		        format(mysr,200,"%s%s\n",mysr,InfoLoot[mysor[i]][NAMEloot]);
		    }
			ShowPlayerDialog(playerid, 12223, 2, "{00FF00}Мусорка", mysr, "Взять", "Отмена");
		}
	}
	else if(newkeys==KEY_YES)
	{
	    if(pInfo[playerid][openInv]==false)
	    {
			SetPlayerChatBubble(playerid,"копается в своем рюкзаке",0x007900AA,30.0,10000);
			ApplyAnimation(playerid,"BOMBER","BOM_Plant_Loop",2.100000, 0, 1,1,1,1);
			for(new Text:i=INV_YELLOY_MENU;i<=INV_KPK_MODEL_LAPTOP;i++)
			{
				TextDrawShowForPlayer(playerid,i);
			}
			PlayerTextDrawShow(playerid,PLAYER_DRAWS[playerid][21]);
			for(new tid=0,maxs=pInfo[playerid][end_slot];tid<=maxs;tid++)
			{
                if(PLAYER_LOOT_DRAW[playerid][tid][loottype]!=0)
                {
		            PlayerTextDrawShow(playerid,PLAYER_LOOT_DRAW[playerid][tid][loot_model]);
					PlayerTextDrawShow(playerid,PLAYER_LOOT_DRAW[playerid][tid][loot_textX]);
				}
			}
			printf("MAX:%d",pInfo[playerid][end_slot]);
			pInfo[playerid][openInv]=true;
			SelectTextDraw(playerid,0xACCBF1FF);
			PlayerPlaySound(playerid,1163,0.0,0.0,0.0);
		}
	}
	else if(newkeys==KEY_NO)
	{
		ShowPlayerDialog(playerid, 8820, 2,"Личное меню","{E8D699}Личные данные\n\
        {E8D699}Ваш КПК\n\
        {E8D699}Торговать\n\
        {E8D699}Действия\n\
        {E8D699}Бригада\n\
        {E8D699}Транспорт\n\
        {E8D699}Настройки\n\
        {E8D699}Справка\n\
		{00B000}Донат","Выбрать","Отмена");
	}
	else if(newkeys==KEY_SUBMISSION)// клавиша 2
	{
	    new vehicleid = GetPlayerVehicleID(playerid);
	    if(vehicleid!=0&&GetPlayerVehicleSeat(playerid)==0)//если игрок находится в машине за местом водителя
	    {
			ShowPlayerDialog(playerid, 7820, 2, !"{00B000}Управление",!"{BFB37D}Двигатель {00B000}вкл <- {DF0000}-> выкл\n{BFB37D}Двери {DF0000}закрыть\n{BFB37D}Двери {00B000}открыть\n{BFB37D}Багажник {00B000}откр <- {DF0000}-> закр",!"Ок",!"Отмена");
	    }
	    else
	    {
	        SendClientMessage(playerid,0xFF0000AA,!"Вы должны быть в транспорте, за рулем!");
	    }
	}
	else if(newkeys==KEY_CTRL_BACK)//клавиша h
	{
	    if(IsPlayerInDynamicArea(playerid,AREA_BUNKER)==0)//если игрок НЕ внутри бункера
	    {
	    	new Float:cx,Float:cy,Float:cz;
			new Float:dist,Float:olddist=5.0;
			new carid=0;
			foreachA(PlayerPerhapsVehicle[playerid],vehicleid)
			{
			   // GetVehiclePos(vehicleid,cx,cy,cz);
			    GetVehicleCoordBackPack(vehicleid, cx,cy,cz);
			    dist=GetPlayerDistanceFromPoint(playerid,cx,cy,cz);
			    if(dist<olddist)
			    {
			        olddist=dist;
			        carid=vehicleid;
			    }

			}
			if(carid!=0&&dist<1.0)
			{
	            if(vInfo[carid][backpack]==false)
	            {

		            switch(GetVehicleModel(carid))
		            {
		                case 481,509,510, 403, 406, 407, 408, 413,414,418, 416, 422, 423, 427, 428, 431, 433, 437,440,444,448,453,454,455,456,457,459,461,468,471,472,473,478,483,485,498,499,508,514,515,524,525,530,531,532,543,544,552,554,556,557,568,578,582,583,588,604,605,609://3 велосипеда, грузовик, белаз, пожарка, мусоровоз, 3 грузовик, скорая, бобкат и все осталные пикапы,фургон мороженного, броневик спецназа, броневик банка, автобус, грузовик армии, автобус, грузовик
		                {
		                    SendClientMessage(playerid,0xFF0000AA,!"Багажник этого транспорта недоступен или не существует!");

		                }
						case 584,610,611,606,607://прицеп - цистерна с топливо для грузовика,
						{
						    //не нужно что-то выводить!
						}
						default:
						{
						    pInfo[playerid][car_back]=carid;
							ShowPlayerDialog(playerid,217,0,!"Багажник",!"Что сделать:",!"Взять",!"Положить");
						}
		            }
	            }
	            else
	            {
	                SendClientMessage(playerid,0xAFAFAFAA,!"Откройте багажник!");
	            }
			}
	    }
	}
	return 1;
}
public OnPlayerStateChange(playerid, newstate, oldstate)
{
    if(oldstate == PLAYER_STATE_ONFOOT && newstate == PLAYER_STATE_DRIVER) // Player entered a vehicle as a driver
    {
	    new vehicleid = GetPlayerVehicleID(playerid);
    	if(pInfo[playerid][vivih]==false)
    	{
	        Iter_Add(PlyrInVeh,playerid);
		    
		    pInfo[playerid][car_id]=vehicleid;
		    
		    if(GetLVL(playerid)!=0)
			{
			
			    PlayerTextDrawShow(playerid,PLAYER_DRAWS[playerid][22]);
			    PlayerTextDrawShow(playerid,PLAYER_DRAWS[playerid][23]);
			    PlayerTextDrawShow(playerid,PLAYER_DRAWS[playerid][24]);



			    new vehiclemod = GetVehicleModel(vehicleid);
		        if(vehiclemod!=481&&vehiclemod!=509&&vehiclemod!=510)
		        {
		        	

			    	new benzina=vInfo[vehicleid][benz];

			    	if(benzina<=16)
			    	{
			    	    PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][23],"~r~F");
			    	}
			    	else if(benzina<=32)
			    	{
			    	    PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][23],"~y~F");
			    	}
			    	else if(benzina<=50)
			    	{
			    	    PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][23],"~g~F");
			    	}

					new akummulator=vInfo[vehicleid][akum];

					if(akummulator<=33)
			    	{
			    	    PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][24],"~r~+/-");
			    	}
			    	else if(akummulator<=66)
			    	{
			    	    PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][24],"~y~+/-");
			    	}
			    	else if(akummulator<=100)
			    	{
			    	    PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][24],"~g~+/-");
			    	}


			        SendClientMessage(playerid,0x00FF00AA,!"{FCAB14}ПОДСКАЗКА: {00FFFF}Завести двигатель: клавиша {00FF00}'2'{00FFFF}!");

					if(vInfo[vehicleid][benz]==0)
					{
					    SendClientMessage(playerid,0x00FF00AA,!">>> Бензобак пуст <<<");
					}

					if(vInfo[vehicleid][akum]==0)
					{
					    SendClientMessage(playerid,0x00FF00AA,!">>> Аккумулятор разряжен <<<");
					}

			        if(vehicleid<4)// 1,2,3 - арендуюмые машины
			        {
	                    ShowPlayerDialog(playerid,9126,0, !"{FF0000}АРЕНДА МАШИНЫ", !"{FFFFFF}Стоимость аренды {80FF00}300$\n{FFFFFF}В машине будет полный бак топлива и аккумулятор!", !"Снять", !"Нет");
			        }
			        else if(vehicleid<10)//машина скорой помощи
					{
					 /*   if(pInfo[playerid][jobid]==1)
					    {
					    }*/
					    if(pInfo[playerid][zmedik]!=0)
					    {

					    }
					    else
					    {
					        SendClientMessage(playerid,-1263159297,!"Вы не брали задание в госпитале бункера!");
					        KickPlayerVehicle(playerid,vehicleid);
					    }
					}
					else if(vehicleid<14)//наёмник
					{
					    if(pInfo[playerid][jobid]!=3)
					    {
					        SendClientMessage(playerid,-1263159297,!"Транспорт принадлежит наемникам!");
					        KickPlayerVehicle(playerid,vehicleid);

					    }
					}
					else if(vehicleid<17)//радиоведущий
					{
					    if(pInfo[playerid][jobid]!=4)
					    {
	                        SendClientMessage(playerid,-1263159297,!"Транспорт принадлежит радиоведущим!");
					        KickPlayerVehicle(playerid,vehicleid);
					    }
					}
			        vInfo[vehicleid][driveid]=playerid;
			        vInfo[vehicleid][pas_door]=true;//закрываем пассажирские двери
			        vInfo[vehicleid][doors]=true;//закрываем водительские двери
			        new engine, lights, alarm, dors, bonnet, boot, objective;
					GetVehicleParamsEx(vehicleid, engine, lights, alarm, dors, bonnet, boot, objective);
					SetVehicleParamsEx(vehicleid, engine, lights, alarm, 1, bonnet, boot, objective);
		        }
	        }
	        else
	        {
				KickPlayerVehicle(playerid,vehicleid);
	        }
	    }
	    else
	    {
	        SendClientMessage(playerid,-1347440726,!"У вас вывих! Найдите бинты или аптечку!");
	        KickPlayerVehicle(playerid,vehicleid);
	    }
    }
    else if(oldstate == PLAYER_STATE_DRIVER)
    {
        Iter_Remove(PlyrInVeh,playerid);
        PlayerTextDrawHide(playerid,PLAYER_DRAWS[playerid][22]);
        PlayerTextDrawHide(playerid,PLAYER_DRAWS[playerid][23]);
        PlayerTextDrawHide(playerid,PLAYER_DRAWS[playerid][24]);
        
        new vehicleid=pInfo[playerid][car_id];
        vInfo[vehicleid][doors]=false;
		vInfo[vehicleid][pas_door]=true;
        vInfo[vehicleid][driveid]=0;
        pInfo[playerid][car_id]=0;

        new vehiclemod = GetVehicleModel(vehicleid);
	    if(vehiclemod!=481&&vehiclemod!=509&&vehiclemod!=510)
	    {
	        GameTextForPlayer(playerid,"~g~Open",5000,6);
	        new engine, lights, alarm, dors, bonnet, boot, objective;
			GetVehicleParamsEx(vehicleid, engine, lights, alarm, dors, bonnet, boot, objective);
			SetVehicleParamsEx(vehicleid, engine, lights, alarm, 0, bonnet, boot, objective);

		}
    }
    return 1;
}
public OnPlayerEnterVehicle(playerid, vehicleid, ispassenger)
{

	if(pInfo[playerid][vivih]==true&&ispassenger==0)
	{
	    SendClientMessage(playerid,0xFF0000AA,!"У вас вывих! Вы не можете управлять транспортом. Найдите аптечку или бинт!");
	}
	if(GetLVL(playerid)==0)//странно, но на секторе нет проверки на то что игрок бежит к пасажирскому креслу, а не водителя                                   &&ispassenger==0)//если лвл игрока 0 и игрок бежит к машине на водительское место
	{
	    SendClientMessage(playerid,0xFF0000AA,!"Управлять транспортом можно только с 1 уровня авторитета!");
	}
	
	if(ispassenger==1&&vInfo[vehicleid][pas_door]==true)
	{
	    SetPlayerPos(playerid,pInfo[playerid][pos_x],pInfo[playerid][pos_y],pInfo[playerid][pos_z]);
	    SendClientMessage(playerid,0xFF0000AA,!"Пассажирская дверь закрыта (открыть можно сидя за рулем)!");
	}
	
    return 1;
}
public OnPlayerRequestClass(playerid,classid)//стрелочки << >>
{
	if(IsPlayerNPC(playerid)==0)
	{
	    SendClientMessage(playerid,0xFF000000,"GTA SAMP SEKTOR: Постапокалипсис.");
	    SendClientMessage(playerid,0x00C10000,"Наш сайт: {00E6E6}www.samp-sektor-2.ru");
	    TogglePlayerControllable(playerid, false);
		SetPlayerPos(playerid,2224.220703 ,-4452.688477, 97.176201);
		SetPlayerTime(playerid,15,0);
		if(random(2)==0)
		{
		    SetPlayerWeather(playerid,9);
		}
		else
		{
		    SetPlayerWeather(playerid,20);
		}
		if(pInfo[playerid][login]==false)
		{
			SetPlayerCameraPos(playerid,2228.407715,-4447.744629,101.337296);
			SetPlayerCameraLookAt(playerid,2223.571533,-4448.979004,101.633995,2);
	    //	SetPreciseTimer("PlayerAutorizaed",8000,0,"d",playerid);
	    	pInfo[playerid][login]=true;
	    }
    }

   
    return 1;
}
public OnPlayerRequestSpawn(playerid)//кнопка spawn
{
//	Kick(playerid);
    return 1;
}
public OnPlayerConnect(playerid)
{
 //   printf("%s[%d]",pInfo[playerid][Name],playerid);
	if(IsPlayerNPC(playerid)==0)
	{
		GetPlayerName(playerid,pInfo[playerid][Name],24);
		SetPlayerTime(playerid,1,0);
		SetPlayerTime(playerid,15, 10);

		RemoveBuildingForPlayer(playerid,12845, 249.921005, -56.539001, 2.664000, 0.250000);
		RemoveBuildingForPlayer(playerid,1514, 253.179001, -54.500000, 1.460000, 0.250000);
		RemoveBuildingForPlayer(playerid,8229, 1142.031006, 1362.500000, 12.484000, 0.250000);
		RemoveBuildingForPlayer(playerid,8237, 1172.625000, 1347.484009, 9.914000, 0.250000);
		RemoveBuildingForPlayer(playerid,2412, 203.015594, -50.015598, 1000.804688, 0.250000);
		RemoveBuildingForPlayer(playerid,2231, 199.609406, -32.148399, 1001.312500, 0.250000);
		RemoveBuildingForPlayer(playerid,2401, 211.203094, -50.218800, 1001.343811, 30.000000);
		RemoveBuildingForPlayer(playerid,2389, 211.203094, -49.476601, 1002.453125, 0.250000);
		RemoveBuildingForPlayer(playerid,2382, 208.109406, -44.281300, 1001.382813, 30.000000);
		RemoveBuildingForPlayer(playerid,2381, 208.601593, -47.781300, 1001.414124, 0.250000);
		RemoveBuildingForPlayer(playerid,2689, 208.570297, -46.164101, 1001.375000, 30.000000);
		RemoveBuildingForPlayer(playerid,2390, 211.203094, -48.750000, 1002.414124, 0.250000);
		RemoveBuildingForPlayer(playerid,2398, 211.195297, -48.046902, 1001.335876, 0.250000);
		RemoveBuildingForPlayer(playerid,2396, 211.187500, -46.804699, 1002.593811, 30.000000);
		RemoveBuildingForPlayer(playerid,2229, 211.351593, -39.835899, 1000.789124, 0.250000);
		RemoveBuildingForPlayer(playerid,11245, -2023.710938, 83.968803, 37.875000, 0.250000);
		RemoveBuildingForPlayer(playerid,1352, -105.070297, 1203.898438, 18.710899, 1000.000000);
		RemoveBuildingForPlayer(playerid,2310, 447.796906, -88.109398, 999.039124, 50.000000);
		RemoveBuildingForPlayer(playerid,1546, -786.226624, 495.515594, 1371.976563, 5.000000);
		RemoveBuildingForPlayer(playerid,3922, -792.250000, 500.382813, 1370.648438, 0.250000);
		RemoveBuildingForPlayer(playerid,3966, -788.523376, 491.593811, 1375.914063, 0.250000);
		RemoveBuildingForPlayer(playerid,1488, -787.406311, 495.476593, 1372.656250, 0.250000);
		RemoveBuildingForPlayer(playerid,1511, -787.898376, 495.476593, 1372.656250, 0.250000);
		RemoveBuildingForPlayer(playerid,1545, -785.367188, 495.460907, 1372.593750, 0.250000);
		RemoveBuildingForPlayer(playerid,1541, -785.976624, 498.671906, 1372.250000, 0.250000);
		RemoveBuildingForPlayer(playerid,2642, 362.031311, -65.156303, 1001.828125, 10.000000);
		RemoveBuildingForPlayer(playerid,2430, 375.492188, -67.117203, 1002.992188, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 374.539093, -65.539101, 1002.992188, 10.000000);
		RemoveBuildingForPlayer(playerid,2431, 373.984406, -64.656303, 1002.992188, 0.250000);
		RemoveBuildingForPlayer(playerid,2740, 378.937500, -59.632801, 1004.351624, 0.250000);
		RemoveBuildingForPlayer(playerid,2718, 375.898407, -56.257801, 1003.156311, 3.000000);
		RemoveBuildingForPlayer(playerid,2714, 360.765594, -72.367203, 1002.343811, 0.250000);
		RemoveBuildingForPlayer(playerid,2788, 375.328094, -73.453102, 1001.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1541, 493.171906, -78.765602, 998.960876, 6.000000);
		RemoveBuildingForPlayer(playerid,1545, 496.906311, -80.250000, 999.898376, 6.000000);
		RemoveBuildingForPlayer(playerid,2964, 510.101593, -84.835899, 997.937500, 0.250000);
		RemoveBuildingForPlayer(playerid,1542, 494.164093, -77.164101, 998.789124, 3.000000);
		RemoveBuildingForPlayer(playerid,1805, 505.429688, -70.078102, 998.007813, 0.250000);
		RemoveBuildingForPlayer(playerid,16766, 498.039093, 1428.078125, 7.164100, 0.250000);
		RemoveBuildingForPlayer(playerid,16745, 392.914093, 1511.562500, 21.585899, 0.250000);
		RemoveBuildingForPlayer(playerid,16744, 351.984406, 1368.898438, 20.109400, 0.250000);
		RemoveBuildingForPlayer(playerid,16275, 375.039093, 1335.054688, 10.218800, 0.250000);
		RemoveBuildingForPlayer(playerid,16276, 588.164124, 1340.960938, 9.859400, 0.250000);
		RemoveBuildingForPlayer(playerid,16277, 487.101593, 1528.226563, 0.125000, 0.250000);
		RemoveBuildingForPlayer(playerid,16278, 500.195313, 1389.796875, 3.570300, 0.250000);
		RemoveBuildingForPlayer(playerid,16279, 648.937500, 1471.382813, 8.367200, 0.250000);
		RemoveBuildingForPlayer(playerid,16269, 448.070313, 1413.789063, 17.968800, 0.250000);
		RemoveBuildingForPlayer(playerid,16268, 464.234406, 1311.734375, 20.742201, 0.250000);
		RemoveBuildingForPlayer(playerid,16270, 573.687500, 1419.257813, 19.695299, 0.250000);
		RemoveBuildingForPlayer(playerid,16534, 566.335876, 1372.890625, 12.179700, 0.250000);
		RemoveBuildingForPlayer(playerid,16273, 422.914093, 1513.414063, 10.718800, 0.250000);
		RemoveBuildingForPlayer(playerid,16534, 566.335876, 1372.890625, 12.179700, 0.250000);
		RemoveBuildingForPlayer(playerid,16048, 741.109375, 1619.000000, 39.601601, 0.250000);
		RemoveBuildingForPlayer(playerid,16049, 740.445313, 1797.304688, 37.562500, 0.250000);
		RemoveBuildingForPlayer(playerid,7884, 1967.257813, 2440.679688, 14.195300, 0.250000);
		RemoveBuildingForPlayer(playerid,7719, 1949.031250, 2068.781250, 12.109400, 0.250000);
		RemoveBuildingForPlayer(playerid,7702, 1928.593750, 2467.000000, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,7705, 1973.007813, 2358.164063, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,7670, 1028.156250, 2240.765625, 13.398400, 0.250000);
		RemoveBuildingForPlayer(playerid,7663, 1949.031250, 2068.781250, 12.109400, 0.250000);
		RemoveBuildingForPlayer(playerid,7639, 2022.687500, 2065.937500, 21.101601, 0.250000);
		RemoveBuildingForPlayer(playerid,7526, 1949.031250, 2068.781250, 12.109400, 0.250000);
		RemoveBuildingForPlayer(playerid,7492, 1028.156250, 2240.765625, 13.398400, 0.250000);
		RemoveBuildingForPlayer(playerid,7488, 1973.007813, 2358.164063, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,7424, 1928.593750, 2467.000000, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,7147, 2093.648438, 2488.804688, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,7270, 2140.421875, 2535.250000, 12.734400, 0.250000);
		RemoveBuildingForPlayer(playerid,7269, 2140.421875, 2535.250000, 12.734400, 0.250000);
		RemoveBuildingForPlayer(playerid,7228, 2093.648438, 2488.804688, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,7078, 2121.710938, 2453.562500, 21.101601, 0.250000);
		RemoveBuildingForPlayer(playerid,6868, 2093.648438, 2488.804688, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,3520, 2038.375000, 2466.562500, 9.820300, 300.000000);
		RemoveBuildingForPlayer(playerid,3460, 2074.867188, 2457.617188, 13.765600, 300.000000);
		RemoveBuildingForPlayer(playerid,3460, 1002.968811, 2225.828125, 13.765600, 300.000000);
		RemoveBuildingForPlayer(playerid,3428, 628.148376, 1354.406250, 11.382800, 500.000000);
		RemoveBuildingForPlayer(playerid,3427, 375.039093, 1335.054688, 10.218800, 500.000000);
		RemoveBuildingForPlayer(playerid,3426, 353.703094, 1302.039063, 11.562500, 500.000000);
		RemoveBuildingForPlayer(playerid,3338, 720.710876, 1616.437500, 3.875000, 70.000000);
		RemoveBuildingForPlayer(playerid,3244, 720.710876, 1616.437500, 3.875000, 70.000000);
		RemoveBuildingForPlayer(playerid,1350, 2037.460938, 2458.789063, 9.781300, 100.000000);
		RemoveBuildingForPlayer(playerid,1350, 1013.273376, 2282.757813, 9.812500, 100.000000);
		RemoveBuildingForPlayer(playerid,1350, 1922.093750, 2052.117188, 9.812500, 100.000000);
		RemoveBuildingForPlayer(playerid,3459, 2087.312500, 2462.000000, 17.320299, 100.000000);
		RemoveBuildingForPlayer(playerid,1308, 476.992188, 1386.382813, 4.242200, 170.000000);
		RemoveBuildingForPlayer(playerid,1300, 2046.273438, 2485.976563, 10.445300, 70.000000);
		RemoveBuildingForPlayer(playerid,1257, 2083.062500, 2462.250000, 10.726600, 0.250000);
		RemoveBuildingForPlayer(playerid,7390, 2214.906250, 2465.687500, 14.828100, 0.250000);
		RemoveBuildingForPlayer(playerid,628, 1617.531250, 1817.531250, 11.492200, 0.250000);
		RemoveBuildingForPlayer(playerid,7118, 2263.125000, 2391.546875, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,7133, 2565.273438, 2161.093750, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,7149, 2384.617188, 2376.835938, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,7221, 2442.820313, 2141.960938, 45.585899, 0.250000);
		RemoveBuildingForPlayer(playerid,7382, 2538.398438, 2149.718750, 15.164100, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2532.929688, 2102.640625, 9.804700, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2537.929688, 2118.906250, 9.804700, 0.250000);
		RemoveBuildingForPlayer(playerid,1257, 2580.578125, 2122.000000, 11.093800, 0.250000);
		RemoveBuildingForPlayer(playerid,1280, 2537.945313, 2147.875000, 10.218800, 0.250000);
		RemoveBuildingForPlayer(playerid,1341, 2538.031250, 2153.703125, 10.734400, 0.250000);
		RemoveBuildingForPlayer(playerid,7273, 2538.398438, 2149.718750, 15.164100, 0.250000);
		RemoveBuildingForPlayer(playerid,6875, 2565.273438, 2161.093750, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,7268, 2440.562500, 2115.976563, 18.906300, 0.250000);
		RemoveBuildingForPlayer(playerid,6874, 2384.617188, 2376.835938, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,1532, 2248.429688, 2395.765625, 9.804700, 0.250000);
		RemoveBuildingForPlayer(playerid,6946, 2263.125000, 2391.546875, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,615, 2301.687500, 2397.554688, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2298.093750, 2418.671875, 9.804700, 0.250000);
		RemoveBuildingForPlayer(playerid,647, 2313.125000, 2424.882813, 11.414100, 0.250000);
		RemoveBuildingForPlayer(playerid,647, 2316.257813, 2425.015625, 11.171900, 0.250000);
		RemoveBuildingForPlayer(playerid,652, 2320.523438, 2426.062500, 6.789100, 0.250000);
		RemoveBuildingForPlayer(playerid,3460, 2335.054688, 2417.664063, 13.765600, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 2338.203125, 2424.992188, 19.273399, 0.250000);
		RemoveBuildingForPlayer(playerid,652, 2334.093750, 2425.968750, 6.789100, 0.250000);
		RemoveBuildingForPlayer(playerid,647, 2331.046875, 2425.078125, 11.171900, 0.250000);
		RemoveBuildingForPlayer(playerid,1257, 2391.984375, 2422.179688, 11.093800, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2329.335938, 2429.273438, 8.437500, 0.250000);
		RemoveBuildingForPlayer(playerid,680, 2313.593750, 2427.039063, 9.734400, 0.250000);
		RemoveBuildingForPlayer(playerid,680, 2318.703125, 2428.578125, 10.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 2326.648438, 2431.468750, 14.078100, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2319.742188, 2429.648438, 0.960900, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 2318.773438, 2433.171875, 20.960899, 0.250000);
		RemoveBuildingForPlayer(playerid,652, 2321.968750, 2435.906250, 6.789100, 0.250000);
		RemoveBuildingForPlayer(playerid,680, 2325.796875, 2440.585938, 14.437500, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 2326.710938, 2441.265625, 19.304701, 0.250000);
		RemoveBuildingForPlayer(playerid,680, 2336.054688, 2426.695313, 10.273400, 0.250000);
		RemoveBuildingForPlayer(playerid,652, 2332.625000, 2443.578125, 14.531300, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2344.867188, 2448.421875, 13.554700, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 2348.578125, 2446.023438, 22.695299, 0.250000);
		RemoveBuildingForPlayer(playerid,652, 2342.335938, 2448.617188, 13.960900, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2351.820313, 2448.078125, 7.328100, 0.250000);
		RemoveBuildingForPlayer(playerid,652, 2349.453125, 2444.031250, 9.898400, 0.250000);
		RemoveBuildingForPlayer(playerid,621, 1580.382813, 1821.382813, 9.546900, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 1580.398438, 1845.289063, 9.554700, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 1597.625000, 1862.679688, 9.554700, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 1617.414063, 1862.679688, 9.554700, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 1635.984375, 1845.351563, 9.554700, 0.250000);
		RemoveBuildingForPlayer(playerid,621, 1634.179688, 1858.335938, 9.554700, 0.250000);
		RemoveBuildingForPlayer(playerid,7650, 1711.789063, 1823.765625, 19.460899, 0.250000);
		RemoveBuildingForPlayer(playerid,7700, 1711.789063, 1823.765625, 19.460899, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 1637.609375, 1867.445313, 9.812500, 0.250000);
		RemoveBuildingForPlayer(playerid,3460, 1643.054688, 1847.328125, 13.765600, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 1652.953125, 1863.445313, 9.812500, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 1657.164063, 1878.757813, 9.812500, 0.250000);
		RemoveBuildingForPlayer(playerid,1340, 2327.859375, 2421.250000, 10.859400, 0.250000);
		RemoveBuildingForPlayer(playerid,710, 2278.742188, 2008.250000, 23.375000, 0.250000);
		RemoveBuildingForPlayer(playerid,710, 2297.585938, 2008.890625, 25.359400, 0.250000);
		RemoveBuildingForPlayer(playerid,710, 2327.742188, 2007.132813, 25.359400, 0.250000);
		RemoveBuildingForPlayer(playerid,710, 2330.062500, 1992.015625, 23.921900, 0.250000);
		RemoveBuildingForPlayer(playerid,7072, 2169.070313, 2159.453125, 47.234402, 0.250000);
		RemoveBuildingForPlayer(playerid,7073, 2169.804688, 2160.328125, 49.960899, 0.250000);
		RemoveBuildingForPlayer(playerid,7097, 2619.117188, 2335.414063, 16.320299, 0.250000);
		RemoveBuildingForPlayer(playerid,7226, 2232.257813, 1888.601563, 20.992201, 0.250000);
		RemoveBuildingForPlayer(playerid,7233, 2284.296875, 1824.515625, 34.898399, 0.250000);
		RemoveBuildingForPlayer(playerid,7280, 2271.625000, 1870.500000, 56.351601, 0.250000);
		RemoveBuildingForPlayer(playerid,7315, 2156.023438, 2073.078125, 34.398399, 0.250000);
		RemoveBuildingForPlayer(playerid,7316, 2156.023438, 2073.078125, 34.398399, 0.250000);
		RemoveBuildingForPlayer(playerid,7342, 2320.460938, 2128.804688, 35.437500, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 2484.742188, 1985.804688, 16.929701, 0.250000);
		RemoveBuildingForPlayer(playerid,7314, 2489.250000, 2126.187500, 19.859400, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 2495.664063, 2002.171875, 19.656300, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 2495.000000, 2039.453125, 18.242201, 0.250000);
		RemoveBuildingForPlayer(playerid,621, 2597.578125, 2031.656250, 9.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2600.375000, 2027.203125, 10.078100, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2600.375000, 2018.281250, 10.078100, 0.250000);
		RemoveBuildingForPlayer(playerid,621, 2602.289063, 2013.460938, 9.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2629.015625, 1999.937500, 10.078100, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2646.406250, 1998.476563, 10.078100, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2637.070313, 2039.109375, 10.078100, 0.250000);
		RemoveBuildingForPlayer(playerid,621, 2642.328125, 2039.304688, 9.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,3511, 2594.578125, 2306.656250, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,3511, 2617.617188, 2308.148438, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,3511, 2594.007813, 2316.960938, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2655.937500, 2215.320313, 10.078100, 0.250000);
		RemoveBuildingForPlayer(playerid,621, 2654.703125, 2220.687500, 9.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,621, 2658.390625, 2210.671875, 9.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2664.476563, 2219.179688, 10.078100, 0.250000);
		RemoveBuildingForPlayer(playerid,3511, 2653.851563, 2307.921875, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,3511, 2670.523438, 2309.664063, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,3511, 2666.414063, 2319.648438, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,7232, 2138.195313, 1788.078125, 20.875000, 0.250000);
		RemoveBuildingForPlayer(playerid,7230, 2138.828125, 1790.031250, 31.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,3472, 2158.312500, 1805.179688, 9.992200, 0.250000);
		RemoveBuildingForPlayer(playerid,3472, 2178.937500, 1805.179688, 9.992200, 0.250000);
		RemoveBuildingForPlayer(playerid,3472, 2168.625000, 1805.179688, 9.992200, 0.250000);
		RemoveBuildingForPlayer(playerid,3472, 2181.375000, 1867.609375, 9.992200, 0.250000);
		RemoveBuildingForPlayer(playerid,3472, 2199.570313, 1805.179688, 9.992200, 0.250000);
		RemoveBuildingForPlayer(playerid,3472, 2189.250000, 1805.179688, 9.992200, 0.250000);
		RemoveBuildingForPlayer(playerid,3472, 2191.687500, 1867.609375, 9.992200, 0.250000);
		RemoveBuildingForPlayer(playerid,3472, 2202.007813, 1867.609375, 9.992200, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 2259.882813, 2007.039063, 19.195299, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 2328.320313, 1974.343750, 19.656300, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 2313.031250, 2008.273438, 18.703100, 0.250000);
		RemoveBuildingForPlayer(playerid,3516, 2360.218750, 2001.492188, 12.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2332.593750, 2016.500000, 9.804700, 0.250000);
		RemoveBuildingForPlayer(playerid,3516, 2338.226563, 2031.679688, 12.992200, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 2435.289063, 2008.929688, 19.656300, 100.250000);
		RemoveBuildingForPlayer(playerid,3463, 2137.460938, 2237.937500, 10.023400, 0.250000);
		RemoveBuildingForPlayer(playerid,645, 2137.070313, 2247.265625, 9.812500, 0.250000);
		RemoveBuildingForPlayer(playerid,621, 2132.773438, 2263.929688, 9.828100, 300.250000);
		RemoveBuildingForPlayer(playerid,620, 2111.695313, 2303.484375, 10.734400, 300.250000);
		RemoveBuildingForPlayer(playerid,645, 2130.171875, 2314.898438, 10.734400, 0.250000);
		RemoveBuildingForPlayer(playerid,645, 2142.828125, 2292.992188, 10.734400, 0.250000);
		RemoveBuildingForPlayer(playerid,7392, 2320.460938, 2128.804688, 35.437500, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2331.671875, 2131.234375, 9.804700, 0.250000);
		RemoveBuildingForPlayer(playerid,3516, 2361.929688, 2129.828125, 12.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2368.539063, 2155.234375, 9.804700, 0.250000);
		RemoveBuildingForPlayer(playerid,7268, 2440.562500, 2115.976563, 18.906300, 0.250000);
		RemoveBuildingForPlayer(playerid,6986, 2449.734375, 2121.109375, 34.664101, 0.250000);
		RemoveBuildingForPlayer(playerid,3511, 2598.664063, 2327.742188, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,3511, 2665.273438, 2332.406250, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,3511, 2658.851563, 2351.757813, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2293.007813, 2348.820313, 9.804700, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2281.812500, 2374.070313, 9.804700, 0.250000);
		RemoveBuildingForPlayer(playerid,615, 2301.687500, 2397.554688, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2292.953125, 2402.867188, 9.804700, 200.250000);
		RemoveBuildingForPlayer(playerid,8371, 1714.304688, 1452.148438, 14.765600, 0.250000);
		RemoveBuildingForPlayer(playerid,8372, 1695.992188, 1445.789063, 13.351600, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 1717.781250, 1265.476563, 9.789100, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 1737.296875, 1282.828125, 9.968800, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 1748.226563, 1305.976563, 19.093800, 200.250000);
		RemoveBuildingForPlayer(playerid,621, 1765.773438, 1683.507813, 6.734400, 0.250000);
		RemoveBuildingForPlayer(playerid,621, 1759.406250, 1687.820313, 6.734400, 0.250000);
		RemoveBuildingForPlayer(playerid,8825, 2057.390625, 1602.578125, 10.531300, 0.250000);
		RemoveBuildingForPlayer(playerid,710, 1845.226563, 1146.773438, 25.421900, 300.250000);
		RemoveBuildingForPlayer(playerid,710, 2570.351563, 1519.343750, 25.226601, 300.250000);
		RemoveBuildingForPlayer(playerid,9088, 2576.937500, 1389.179688, 45.687500, 0.250000);
		RemoveBuildingForPlayer(playerid,9089, 2477.546875, 1103.179688, 33.179699, 0.250000);
		RemoveBuildingForPlayer(playerid,9105, 2323.695313, 1283.226563, 52.968800, 0.250000);
		RemoveBuildingForPlayer(playerid,9121, 1944.804688, 1183.914063, 18.953100, 0.250000);
		RemoveBuildingForPlayer(playerid,9122, 1958.281250, 1010.203125, 33.968800, 0.250000);
		RemoveBuildingForPlayer(playerid,9123, 1988.687500, 1343.031250, 15.656300, 0.250000);
		RemoveBuildingForPlayer(playerid,9128, 2327.406250, 1283.226563, 19.171900, 0.250000);
		RemoveBuildingForPlayer(playerid,710, 2013.328125, 1047.484375, 25.304701, 200.250000);
		RemoveBuildingForPlayer(playerid,3516, 2042.523438, 831.015625, 9.046900, 200.000000);
		RemoveBuildingForPlayer(playerid,9154, 1960.257813, 1004.921875, 18.679701, 0.250000);
		RemoveBuildingForPlayer(playerid,9153, 2005.117188, 1047.398438, 13.289100, 0.250000);
		RemoveBuildingForPlayer(playerid,7892, 1975.304688, 1891.937500, 28.687500, 0.250000);
		RemoveBuildingForPlayer(playerid,7942, 1486.828125, 2141.781250, 17.609400, 0.250000);
		RemoveBuildingForPlayer(playerid,8827, 2057.390625, 1192.585938, 10.531300, 0.250000);
		RemoveBuildingForPlayer(playerid,8621, 2107.593750, 1003.062500, 42.140598, 0.250000);
		RemoveBuildingForPlayer(playerid,3463, 2057.453125, 1033.906250, 10.164100, 200.000000);
		RemoveBuildingForPlayer(playerid,1231, 2022.679688, 1113.023438, 12.460900, 500.250000);
		RemoveBuildingForPlayer(playerid,620, 2087.523438, 983.398376, 9.507800, 500.250000);
		RemoveBuildingForPlayer(playerid,621, 2534.687500, 1453.039063, 9.429700, 300.250000);
		RemoveBuildingForPlayer(playerid,652, 2024.828125, 1733.476563, 9.828100, 0.250000);
		RemoveBuildingForPlayer(playerid,652, 2031.656250, 1734.640625, 2.632800, 0.250000);
		RemoveBuildingForPlayer(playerid,710, 2089.000000, 1839.039063, 25.054701, 200.250000);
		RemoveBuildingForPlayer(playerid,712, 2014.031250, 1055.898438, 19.429701, 300.250000);
		RemoveBuildingForPlayer(playerid,718, 2180.078125, 1521.437500, 9.750000, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2032.296875, 1087.687500, 9.796900, 400.250000);
		RemoveBuildingForPlayer(playerid,3509, 2177.500000, 1547.273438, 9.773400, 1000.250000);
		RemoveBuildingForPlayer(playerid,9175, 2324.382813, 1281.648438, 47.671902, 0.250000);
		RemoveBuildingForPlayer(playerid,3437, 2023.101563, 1307.296875, 11.531300, 200.250000);
		RemoveBuildingForPlayer(playerid,3516, 2040.171875, 1283.093750, 12.976600, 600.250000);
		RemoveBuildingForPlayer(playerid,3511, 1973.453125, 1322.695313, 9.718800, 100.250000);
		RemoveBuildingForPlayer(playerid,8982, 1985.859375, 1356.578125, 8.953100, 0.250000);
		RemoveBuildingForPlayer(playerid,8826, 2057.390625, 1422.828125, 10.531300, 0.250000);
		RemoveBuildingForPlayer(playerid,8840, 2162.789063, 1401.414063, 14.375000, 0.250000);
		RemoveBuildingForPlayer(playerid,3516, 2040.171875, 1463.093750, 12.976600, 0.250000);
		RemoveBuildingForPlayer(playerid,645, 1847.070313, 1489.429688, 9.750000, 0.250000);
		RemoveBuildingForPlayer(playerid,645, 2011.882813, 1489.429688, 9.718800, 0.250000);
		RemoveBuildingForPlayer(playerid,3463, 2057.453125, 1252.859375, 10.164100, 100.250000);
		RemoveBuildingForPlayer(playerid,718, 2088.890625, 1439.593750, 9.750000, 200.250000);
		RemoveBuildingForPlayer(playerid,652, 2064.187500, 1798.125000, 9.828100, 1000.000000);
		RemoveBuildingForPlayer(playerid,645, 2073.632813, 1811.812500, 9.375000, 500.000000);
		RemoveBuildingForPlayer(playerid,3509, 2078.554688, 1822.539063, 7.437500, 500.000000);
		RemoveBuildingForPlayer(playerid,621, 2072.625000, 1906.421875, 14.218800, 0.250000);
		RemoveBuildingForPlayer(playerid,7954, 2117.304688, 1827.703125, 10.468800, 0.250000);
		RemoveBuildingForPlayer(playerid,3463, 2134.710938, 1857.898438, 10.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,647, 2104.820313, 1987.179688, 11.492200, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2107.593750, 2016.828125, 9.812500, 0.250000);
		RemoveBuildingForPlayer(playerid,3516, 2119.843750, 2032.445313, 12.992200, 0.250000);
		RemoveBuildingForPlayer(playerid,3516, 2119.843750, 2123.218750, 12.992200, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2107.851563, 2107.734375, 9.812500, 0.250000);
		RemoveBuildingForPlayer(playerid,3463, 2137.468750, 2011.125000, 10.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,3516, 2154.750000, 2012.023438, 12.992200, 0.250000);
		RemoveBuildingForPlayer(playerid,3516, 2154.750000, 2123.109375, 12.992200, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2161.867188, 2028.109375, 9.812500, 0.250000);
		RemoveBuildingForPlayer(playerid,3463, 2137.460938, 2187.445313, 10.023400, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2160.820313, 2156.070313, 9.812500, 0.250000);
		RemoveBuildingForPlayer(playerid,3506, 2113.281250, 2241.359375, 10.312500, 30.000000);
		RemoveBuildingForPlayer(playerid,3507, 2111.140625, 2251.046875, 10.312500, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2118.578125, 2276.304688, 9.664100, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2092.789063, 2277.765625, 9.664100, 0.250000);
		RemoveBuildingForPlayer(playerid,14570, 2018.953125, 1014.015625, 31.476601, 0.250000);
		RemoveBuildingForPlayer(playerid,18094, 213.671906, -3.601600, 1001.867188, 0.250000);
		RemoveBuildingForPlayer(playerid,6958, 2864.000000, 2293.328125, 18.539101, 0.250000);
		RemoveBuildingForPlayer(playerid,1268, 2919.101563, 2310.601563, 25.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,1268, 2919.101563, 2345.671875, 25.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,7304, 2918.789063, 2361.531250, 31.601601, 0.250000);
		RemoveBuildingForPlayer(playerid,652, 2799.554688, 2280.679688, 9.593800, 0.250000);
		RemoveBuildingForPlayer(playerid,652, 2835.625000, 2280.351563, 9.593800, 0.250000);
		RemoveBuildingForPlayer(playerid,652, 2807.601563, 2281.382813, 9.593800, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2852.968750, 2282.750000, 9.804700, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2836.718750, 2287.679688, 9.804700, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2837.195313, 2305.054688, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2814.304688, 2305.054688, 6.726600, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2882.984375, 2305.054688, 3.460900, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2860.085938, 2305.054688, 9.109400, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 2857.828125, 2299.000000, 9.804700, 0.250000);
		RemoveBuildingForPlayer(playerid,1259, 2919.101563, 2310.601563, 25.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2895.664063, 2322.273438, 3.460900, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2797.531250, 2322.273438, 9.773400, 0.250000);
		RemoveBuildingForPlayer(playerid,1278, 2846.976563, 2323.320313, 24.250000, 0.250000);
		RemoveBuildingForPlayer(playerid,645, 2821.179688, 2335.421875, 10.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,645, 2847.531250, 2335.421875, 10.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,1259, 2919.101563, 2345.671875, 25.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2895.664063, 2346.062500, 3.460900, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2794.976563, 2346.062500, 9.773400, 0.250000);
		RemoveBuildingForPlayer(playerid,645, 2847.531250, 2369.031250, 10.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,645, 2821.179688, 2369.031250, 10.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2791.015625, 2369.851563, 9.773400, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2895.664063, 2369.851563, 3.460900, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2784.210938, 2393.640625, 9.773400, 0.250000);
		RemoveBuildingForPlayer(playerid,1278, 2846.976563, 2383.132813, 24.250000, 0.250000);
		RemoveBuildingForPlayer(playerid,1278, 2821.289063, 2383.132813, 24.250000, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 2895.664063, 2393.640625, 3.460900, 0.250000);
		RemoveBuildingForPlayer(playerid,3460, 2903.132813, 2395.117188, 13.765600, 0.250000);
		RemoveBuildingForPlayer(playerid,3381, -155.983002, 444.890015, 17.694000, 200.250000);
		RemoveBuildingForPlayer(playerid,3382, -155.983002, 444.890015, 17.694000, 200.250000);
		RemoveBuildingForPlayer(playerid,4516, -141.335007, 468.648010, 12.913000, 0.250000);
		RemoveBuildingForPlayer(playerid,2700, 197.062500, -134.640594, 1004.976624, 0.250000);
		RemoveBuildingForPlayer(playerid,2622, 197.562500, -137.656296, 1003.281311, 0.250000);
		RemoveBuildingForPlayer(playerid,2689, 200.898407, -136.750000, 1002.476624, 0.250000);
		RemoveBuildingForPlayer(playerid,2689, 201.078094, -136.843796, 1002.476624, 0.250000);
		RemoveBuildingForPlayer(playerid,2689, 201.265594, -136.890594, 1002.476624, 0.250000);
		RemoveBuildingForPlayer(playerid,2689, 201.968796, -135.750000, 1002.476624, 0.250000);
		RemoveBuildingForPlayer(playerid,2689, 201.421906, -135.375000, 1002.476624, 0.250000);
		RemoveBuildingForPlayer(playerid,2698, 201.343796, -136.132797, 1002.812500, 0.250000);
		RemoveBuildingForPlayer(playerid,2656, 205.437500, -140.476593, 1004.039124, 0.250000);
		RemoveBuildingForPlayer(playerid,2389, 196.195297, -132.882797, 1003.953125, 0.250000);
		RemoveBuildingForPlayer(playerid,2401, 196.218796, -133.539093, 1003.039124, 0.250000);
		RemoveBuildingForPlayer(playerid,2389, 196.195297, -133.554703, 1003.953125, 0.250000);
		RemoveBuildingForPlayer(playerid,2401, 196.218796, -132.875000, 1003.039124, 0.250000);
		RemoveBuildingForPlayer(playerid,2388, 197.734406, -133.390594, 1002.507813, 0.250000);
		RemoveBuildingForPlayer(playerid,2705, 198.382797, -133.695297, 1003.265625, 0.250000);
		RemoveBuildingForPlayer(playerid,2705, 198.289093, -133.585907, 1003.421875, 0.250000);
		RemoveBuildingForPlayer(playerid,2705, 198.171906, -133.492203, 1003.546875, 0.250000);
		RemoveBuildingForPlayer(playerid,2689, 202.539093, -133.882797, 1002.476624, 0.250000);
		RemoveBuildingForPlayer(playerid,2689, 202.554703, -133.679703, 1002.476624, 0.250000);
		RemoveBuildingForPlayer(playerid,2689, 202.617203, -133.492203, 1002.476624, 0.250000);
		RemoveBuildingForPlayer(playerid,2689, 204.062500, -133.765594, 1002.476624, 0.250000);
		RemoveBuildingForPlayer(playerid,2689, 204.046906, -133.968796, 1002.476624, 0.250000);
		RemoveBuildingForPlayer(playerid,2704, 203.968796, -134.140594, 1002.445313, 0.250000);
		RemoveBuildingForPlayer(playerid,2398, 196.210907, -132.054703, 1003.046875, 0.250000);
		RemoveBuildingForPlayer(playerid,2398, 196.210907, -131.343796, 1003.046875, 0.250000);
		RemoveBuildingForPlayer(playerid,2396, 196.187500, -131.343796, 1003.945313, 0.250000);
		RemoveBuildingForPlayer(playerid,2396, 196.187500, -132.062500, 1003.945313, 0.250000);
		RemoveBuildingForPlayer(playerid,2656, 203.468796, -130.132797, 1004.039124, 0.250000);
		RemoveBuildingForPlayer(playerid,2404, 203.539093, -129.414093, 1003.734375, 0.250000);
		RemoveBuildingForPlayer(playerid,2411, 211.515594, -134.015594, 1003.484375, 0.250000);
		RemoveBuildingForPlayer(playerid,2389, 212.257797, -129.554703, 1003.500000, 0.250000);
		RemoveBuildingForPlayer(playerid,2388, 212.523407, -129.039093, 1002.507813, 0.250000);
		RemoveBuildingForPlayer(playerid,2389, 212.281296, -129.000000, 1003.500000, 0.250000);
		RemoveBuildingForPlayer(playerid,2398, 212.796906, -126.390602, 1003.054688, 0.250000);
		RemoveBuildingForPlayer(playerid,2401, 211.218796, -126.390602, 1003.054688, 0.250000);
		RemoveBuildingForPlayer(playerid,2401, 211.953094, -126.390602, 1003.054688, 0.250000);
		RemoveBuildingForPlayer(playerid,2399, 211.218796, -126.390602, 1004.046875, 0.250000);
		RemoveBuildingForPlayer(playerid,2399, 211.960907, -126.390602, 1004.046875, 0.250000);
		RemoveBuildingForPlayer(playerid,2396, 210.328094, -126.390602, 1004.062500, 0.250000);
		RemoveBuildingForPlayer(playerid,2396, 209.578094, -126.390602, 1004.062500, 0.250000);
		RemoveBuildingForPlayer(playerid,2390, 210.328094, -126.382797, 1003.054688, 0.250000);
		RemoveBuildingForPlayer(playerid,2397, 212.804703, -126.382797, 1004.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,2390, 209.585907, -126.382797, 1003.054688, 0.250000);
		RemoveBuildingForPlayer(playerid,2689, 216.187500, -137.234406, 1003.789124, 0.250000);
		RemoveBuildingForPlayer(playerid,2689, 216.187500, -139.000000, 1003.789124, 0.250000);
		RemoveBuildingForPlayer(playerid,2689, 216.187500, -138.406296, 1002.968811, 0.250000);
		RemoveBuildingForPlayer(playerid,2704, 216.179703, -136.039093, 1003.789124, 0.250000);
		RemoveBuildingForPlayer(playerid,2704, 216.179703, -136.039093, 1002.953125, 0.250000);
		RemoveBuildingForPlayer(playerid,2398, 213.515594, -126.390602, 1003.054688, 0.250000);
		RemoveBuildingForPlayer(playerid,2397, 213.523407, -126.382797, 1004.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,2401, 216.375000, -128.921906, 1003.304688, 0.250000);
		RemoveBuildingForPlayer(playerid,2401, 216.375000, -129.656296, 1003.304688, 0.250000);
		RemoveBuildingForPlayer(playerid,2399, 216.375000, -128.921906, 1004.296875, 0.250000);
		RemoveBuildingForPlayer(playerid,2399, 216.375000, -129.664093, 1004.296875, 0.250000);
		RemoveBuildingForPlayer(playerid,2390, 216.382797, -127.289101, 1003.304688, 0.250000);
		RemoveBuildingForPlayer(playerid,2390, 216.382797, -128.031296, 1003.304688, 0.250000);
		RemoveBuildingForPlayer(playerid,2396, 216.375000, -128.031296, 1004.312500, 0.250000);
		RemoveBuildingForPlayer(playerid,2396, 216.375000, -127.281303, 1004.312500, 0.250000);
		RemoveBuildingForPlayer(playerid,2401, 217.203094, -134.085907, 1003.078125, 0.250000);
		RemoveBuildingForPlayer(playerid,2401, 217.203094, -133.398407, 1003.078125, 0.250000);
		RemoveBuildingForPlayer(playerid,2706, 217.359406, -134.085907, 1004.187500, 0.250000);
		RemoveBuildingForPlayer(playerid,2706, 217.359406, -133.398407, 1004.187500, 0.250000);
		RemoveBuildingForPlayer(playerid,2705, 217.359406, -132.523407, 1004.187500, 0.250000);
		RemoveBuildingForPlayer(playerid,2401, 217.203094, -132.507797, 1003.078125, 0.250000);
		RemoveBuildingForPlayer(playerid,2705, 217.359406, -131.851593, 1004.187500, 0.250000);
		RemoveBuildingForPlayer(playerid,2401, 217.203094, -131.835907, 1003.078125, 0.250000);
		RemoveBuildingForPlayer(playerid,16650, 247.703094, 1823.843750, 6.554700, 0.250000);
		RemoveBuildingForPlayer(playerid,16651, 247.906296, 1825.625000, 5.562500, 0.250000);
		RemoveBuildingForPlayer(playerid,16666, 246.328094, 1827.648438, 3.804700, 0.250000);
		RemoveBuildingForPlayer(playerid,2729, 212.546906, -94.804703, 1005.890625, 0.250000);
		RemoveBuildingForPlayer(playerid,2730, 199.710907, -107.945297, 1006.320313, 0.250000);
		RemoveBuildingForPlayer(playerid,2383, 199.921906, -109.125000, 1004.929688, 0.250000);
		RemoveBuildingForPlayer(playerid,2374, 199.921906, -107.718803, 1004.929688, 0.250000);
		RemoveBuildingForPlayer(playerid,2720, 199.710907, -105.156303, 1006.070313, 0.250000);
		RemoveBuildingForPlayer(playerid,2399, 199.906296, -105.039101, 1004.929688, 0.250000);
		RemoveBuildingForPlayer(playerid,2372, 201.625000, -98.078102, 1004.242188, 0.250000);
		RemoveBuildingForPlayer(playerid,2382, 201.835907, -99.187500, 1004.828125, 0.250000);
		RemoveBuildingForPlayer(playerid,2382, 201.835907, -98.164101, 1004.828125, 0.250000);
		RemoveBuildingForPlayer(playerid,2382, 203.007797, -106.140602, 1004.718811, 0.250000);
		RemoveBuildingForPlayer(playerid,2382, 201.976593, -106.140602, 1004.718811, 0.250000);
		RemoveBuildingForPlayer(playerid,2392, 205.179703, -108.375000, 1004.734375, 0.250000);
		RemoveBuildingForPlayer(playerid,2392, 205.851593, -108.375000, 1004.734375, 0.250000);
		RemoveBuildingForPlayer(playerid,2371, 205.554703, -107.281303, 1004.109375, 0.250000);
		RemoveBuildingForPlayer(playerid,2392, 205.851593, -107.437500, 1004.734375, 0.250000);
		RemoveBuildingForPlayer(playerid,2392, 205.179703, -107.437500, 1004.734375, 0.250000);
		RemoveBuildingForPlayer(playerid,2720, 205.953094, -111.539101, 1006.070313, 0.250000);
		RemoveBuildingForPlayer(playerid,2412, 206.992203, -110.742203, 1004.117188, 0.250000);
		RemoveBuildingForPlayer(playerid,2719, 209.328094, -111.539101, 1006.070313, 0.250000);
		RemoveBuildingForPlayer(playerid,2371, 209.734406, -107.281303, 1004.109375, 0.250000);
		RemoveBuildingForPlayer(playerid,2381, 210.031296, -107.851601, 1004.750000, 0.250000);
		RemoveBuildingForPlayer(playerid,2381, 209.367203, -107.906303, 1004.750000, 0.250000);
		RemoveBuildingForPlayer(playerid,2721, 211.812500, -112.843803, 1005.382813, 0.250000);
		RemoveBuildingForPlayer(playerid,2371, 212.054703, -109.062500, 1004.109375, 0.250000);
		RemoveBuildingForPlayer(playerid,2394, 212.632797, -106.812500, 1004.726624, 0.250000);
		RemoveBuildingForPlayer(playerid,2721, 213.117203, -112.843803, 1006.164124, 0.250000);
		RemoveBuildingForPlayer(playerid,2720, 202.304703, -103.789101, 1006.703125, 0.250000);
		RemoveBuildingForPlayer(playerid,2720, 202.304703, -103.773399, 1006.703125, 0.250000);
		RemoveBuildingForPlayer(playerid,2392, 202.320297, -101.851601, 1004.882813, 0.250000);
		RemoveBuildingForPlayer(playerid,2720, 207.664093, -103.789101, 1006.703125, 0.250000);
		RemoveBuildingForPlayer(playerid,2720, 207.664093, -103.773399, 1006.703125, 0.250000);
		RemoveBuildingForPlayer(playerid,2720, 212.765594, -103.789101, 1006.703125, 0.250000);
		RemoveBuildingForPlayer(playerid,2720, 212.765594, -103.773399, 1006.703125, 0.250000);
		RemoveBuildingForPlayer(playerid,2394, 213.359406, -102.062500, 1004.867188, 0.250000);
		RemoveBuildingForPlayer(playerid,2381, 218.539093, -100.968803, 1004.914124, 0.250000);
		RemoveBuildingForPlayer(playerid,1514, 208.835907, -99.343803, 1005.531311, 0.250000);
		RemoveBuildingForPlayer(playerid,2730, 215.921906, -97.421898, 1005.890625, 0.250000);
		RemoveBuildingForPlayer(playerid,2722, 207.234406, -96.351601, 1006.906311, 0.250000);
		RemoveBuildingForPlayer(playerid,713, 1457.937500, -1620.695313, 13.453100, 0.250000);
		RemoveBuildingForPlayer(playerid,713, 1496.867188, -1707.820313, 13.406300, 0.250000);
		RemoveBuildingForPlayer(playerid,1280, 1074.960938, -1783.078125, 13.000000, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1357.515625, -1732.937500, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1376.515625, -1731.851563, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,700, 1438.031250, -1747.937500, 13.445300, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1441.859375, -1733.007813, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1403.367188, -1733.007813, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1414.414063, -1731.429688, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1430.171875, -1719.468750, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,4003, 1481.078125, -1747.031250, 33.523399, 0.250000);
		RemoveBuildingForPlayer(playerid,1226, 1467.984375, -1727.671875, 16.421900, 0.250000);
		RemoveBuildingForPlayer(playerid,1226, 1485.171875, -1727.671875, 16.421900, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 1479.695313, -1716.703125, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,1226, 1505.179688, -1727.671875, 16.421900, 0.250000);
		RemoveBuildingForPlayer(playerid,1280, 1488.765625, -1713.703125, 13.453100, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1513.234375, -1732.921875, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,1258, 1445.007813, -1704.765625, 13.695300, 0.250000);
		RemoveBuildingForPlayer(playerid,1226, 1433.710938, -1702.359375, 16.421900, 0.250000);
		RemoveBuildingForPlayer(playerid,1258, 1445.007813, -1692.234375, 13.695300, 0.250000);
		RemoveBuildingForPlayer(playerid,1226, 1433.710938, -1656.250000, 16.421900, 0.250000);
		RemoveBuildingForPlayer(playerid,1226, 1433.710938, -1636.234375, 16.421900, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 1445.812500, -1650.023438, 22.257799, 0.250000);
		RemoveBuildingForPlayer(playerid,1226, 1433.710938, -1619.054688, 16.421900, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1428.937500, -1605.820313, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1428.898438, -1577.132813, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1443.203125, -1592.945313, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,1280, 1468.984375, -1704.640625, 13.453100, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 1479.695313, -1702.531250, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,1280, 1468.984375, -1694.046875, 13.453100, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 1479.382813, -1692.390625, 15.632800, 0.250000);
		RemoveBuildingForPlayer(playerid,700, 1463.062500, -1690.648438, 13.726600, 0.250000);
		RemoveBuildingForPlayer(playerid,625, 1457.273438, -1666.296875, 13.695300, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 1471.406250, -1666.179688, 22.257799, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 1479.382813, -1682.312500, 15.632800, 0.250000);
		RemoveBuildingForPlayer(playerid,625, 1458.257813, -1659.257813, 13.695300, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 1449.851563, -1655.937500, 22.257799, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 1477.937500, -1652.726563, 15.632800, 0.250000);
		RemoveBuildingForPlayer(playerid,625, 1457.351563, -1650.570313, 13.695300, 0.250000);
		RemoveBuildingForPlayer(playerid,625, 1454.421875, -1642.492188, 13.695300, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 1466.468750, -1637.960938, 15.632800, 0.250000);
		RemoveBuildingForPlayer(playerid,625, 1449.593750, -1635.046875, 13.695300, 0.250000);
		RemoveBuildingForPlayer(playerid,1232, 1465.890625, -1629.976563, 15.531300, 0.250000);
		RemoveBuildingForPlayer(playerid,1232, 1465.835938, -1608.375000, 15.375000, 0.250000);
		RemoveBuildingForPlayer(playerid,1280, 1488.765625, -1704.593750, 13.453100, 0.250000);
		RemoveBuildingForPlayer(playerid,1280, 1488.765625, -1682.671875, 13.453100, 0.250000);
		RemoveBuildingForPlayer(playerid,712, 1480.609375, -1666.179688, 22.257799, 0.250000);
		RemoveBuildingForPlayer(playerid,1232, 1494.414063, -1629.976563, 15.531300, 0.250000);
		RemoveBuildingForPlayer(playerid,1287, 1504.750000, -1704.468750, 13.593800, 0.250000);
		RemoveBuildingForPlayer(playerid,625, 1504.164063, -1662.015625, 13.695300, 0.250000);
		RemoveBuildingForPlayer(playerid,625, 1504.718750, -1670.921875, 13.695300, 0.250000);
		RemoveBuildingForPlayer(playerid,625, 1505.695313, -1654.835938, 13.695300, 0.250000);
		RemoveBuildingForPlayer(playerid,625, 1508.515625, -1647.859375, 13.695300, 0.250000);
		RemoveBuildingForPlayer(playerid,625, 1513.273438, -1642.492188, 13.695300, 0.250000);
		RemoveBuildingForPlayer(playerid,1258, 1510.890625, -1607.312500, 13.695300, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1516.164063, -1591.656250, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,673, 1553.257813, -1764.812500, 12.796900, 0.250000);
		RemoveBuildingForPlayer(playerid,700, 1553.703125, -1747.937500, 13.406300, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1568.882813, -1745.476563, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1545.765625, -1731.671875, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,1226, 1524.828125, -1721.632813, 16.421900, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1530.117188, -1717.007813, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 1541.453125, -1709.640625, 13.046900, 0.250000);
		RemoveBuildingForPlayer(playerid,1226, 1524.828125, -1705.273438, 16.421900, 0.250000);
		RemoveBuildingForPlayer(playerid,646, 1545.523438, -1678.843750, 14.000000, 0.250000);
		RemoveBuildingForPlayer(playerid,646, 1553.867188, -1677.726563, 16.437500, 0.250000);
		RemoveBuildingForPlayer(playerid,646, 1553.867188, -1673.460938, 16.437500, 0.250000);
		RemoveBuildingForPlayer(playerid,646, 1545.562500, -1672.218750, 14.000000, 0.250000);
		RemoveBuildingForPlayer(playerid,620, 1547.570313, -1661.031250, 13.046900, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1582.671875, -1733.132813, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,4192, 1591.695313, -1674.851563, 20.492201, 0.250000);
		RemoveBuildingForPlayer(playerid,1226, 1524.828125, -1647.640625, 16.421900, 0.250000);
		RemoveBuildingForPlayer(playerid,1226, 1524.828125, -1621.960938, 16.421900, 0.250000);
		RemoveBuildingForPlayer(playerid,1226, 1525.382813, -1611.156250, 16.421900, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1528.953125, -1605.859375, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,1283, 1544.625000, -1593.031250, 15.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,1290, 971.476624, -1790.617188, 18.226601, 0.250000);
		RemoveBuildingForPlayer(playerid,1290, 998.109375, -1796.375000, 18.226601, 0.250000);
		RemoveBuildingForPlayer(playerid,1290, 1316.656250, -1519.273438, 18.226601, 0.250000);
		RemoveBuildingForPlayer(playerid,1290, 1329.710938, -1498.679688, 18.226601, 0.250000);
		RemoveBuildingForPlayer(playerid,1290, 1341.351563, -1476.601563, 18.226601, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 678.375000, -1874.640625, 7.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 678.375000, -1860.046875, 7.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 700.367188, -1805.296875, 13.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 741.210876, -1807.453125, 14.101600, 0.250000);
		RemoveBuildingForPlayer(playerid,1284, 639.484375, -1745.406250, 15.460900, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 643.859375, -1790.632813, 12.929700, 0.250000);
		RemoveBuildingForPlayer(playerid,1290, 665.031311, -1746.210938, 18.226601, 0.250000);
		RemoveBuildingForPlayer(playerid,1290, 693.226624, -1754.421875, 18.226601, 0.250000);
		RemoveBuildingForPlayer(playerid,1297, 734.460876, -1780.562500, 15.515600, 0.250000);
		RemoveBuildingForPlayer(playerid,1290, 740.773376, -1769.125000, 18.226601, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 749.632813, -1753.632813, 11.757800, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 762.742188, -1760.203125, 11.757800, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 820.835876, -1917.734375, 14.570300, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 820.835876, -1907.578125, 14.570300, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 821.546875, -2048.898438, 14.570300, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 851.757813, -2023.742188, 14.570300, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 851.757813, -2012.703125, 14.570300, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 852.210876, -1961.125000, 14.570300, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 852.210876, -1950.593750, 14.570300, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 851.625000, -1879.781250, 14.570300, 0.250000);
		RemoveBuildingForPlayer(playerid,1231, 820.359375, -1864.554688, 14.570300, 0.250000);
		RemoveBuildingForPlayer(playerid,1350, 820.585876, -1763.882813, 12.398400, 0.250000);
		RemoveBuildingForPlayer(playerid,1290, 820.023376, -1776.976563, 18.226601, 0.250000);
		RemoveBuildingForPlayer(playerid,1290, 893.328125, -1778.632813, 18.226601, 0.250000);
		RemoveBuildingForPlayer(playerid,1268, 598.179688, -1742.078125, 27.398399, 0.250000);
		RemoveBuildingForPlayer(playerid,1284, 639.484375, -1745.406250, 15.460900, 0.250000);
		RemoveBuildingForPlayer(playerid,1259, 598.179688, -1742.078125, 27.398399, 0.250000);
		RemoveBuildingForPlayer(playerid,1290, 496.539093, -1718.906250, 16.671900, 0.250000);
		RemoveBuildingForPlayer(playerid,1290, 548.710876, -1725.835938, 17.656300, 0.250000);
		RemoveBuildingForPlayer(playerid,1290, 597.468811, -1733.210938, 18.414101, 0.250000);
		RemoveBuildingForPlayer(playerid,1284, 611.742188, -1728.843750, 16.218800, 0.250000);
		RemoveBuildingForPlayer(playerid,1284, 633.960876, -1720.789063, 16.195299, 0.250000);
		RemoveBuildingForPlayer(playerid,1686, -1607.304688, -2716.601563, 47.929699, 0.250000);
		RemoveBuildingForPlayer(playerid,3425, -1124.734375, -1637.492188, 86.507797, 0.250000);
		RemoveBuildingForPlayer(playerid,3276, -1064.960938, -1273.015625, 129.062500, 0.250000);
		RemoveBuildingForPlayer(playerid,1676, 1941.656250, -1767.289063, 14.140600, 0.250000);
		RemoveBuildingForPlayer(playerid,1268, 311.953094, -1383.148438, 19.671900, 0.250000);
		RemoveBuildingForPlayer(playerid,6415, 154.210907, -1950.195313, 26.406300, 0.250000);
		RemoveBuildingForPlayer(playerid,1259, 311.953094, -1383.148438, 19.671900, 0.250000);
		RemoveBuildingForPlayer(playerid,6295, 154.210907, -1950.195313, 26.406300, 0.250000);
		RemoveBuildingForPlayer(playerid,1676, -92.101601, -1161.789063, 2.960900, 0.250000);
		RemoveBuildingForPlayer(playerid,2755, 768.140625, -28.804701, 1001.312500, 0.250000);
		RemoveBuildingForPlayer(playerid,1280, 1472.898438, -1651.507813, 13.453100, 0.250000);
		RemoveBuildingForPlayer(playerid,946, 2795.492188, -2019.617188, 14.593800, 0.250000);
		RemoveBuildingForPlayer(playerid,1280, 942.351624, -1656.179688, 12.898400, 0.250000);
		RemoveBuildingForPlayer(playerid,6056, 701.437500, -1417.125000, 17.664101, 0.250000);
		RemoveBuildingForPlayer(playerid,5811, 1131.195313, -1380.421875, 17.070299, 0.250000);
		RemoveBuildingForPlayer(playerid,1686, -1665.523438, 416.914093, 6.382800, 0.250000);
		RemoveBuildingForPlayer(playerid,11417, -1650.632813, 423.164093, 11.054700, 0.250000);
		RemoveBuildingForPlayer(playerid,1256, -1970.445313, 140.640594, 27.343800, 0.250000);
		RemoveBuildingForPlayer(playerid,1256, -1970.445313, 151.812500, 27.343800, 0.250000);
		RemoveBuildingForPlayer(playerid,3390, 311.578094, 1827.187500, 4.835900, 0.250000);
		RemoveBuildingForPlayer(playerid,3391, 306.789093, 1827.187500, 4.835900, 0.250000);
		RemoveBuildingForPlayer(playerid,3383, 306.492188, 1832.164063, 4.835900, 0.250000);
		RemoveBuildingForPlayer(playerid,3392, 319.453094, 1827.179688, 4.835900, 0.250000);
		RemoveBuildingForPlayer(playerid,3383, 314.078094, 1832.164063, 4.835900, 0.250000);
		RemoveBuildingForPlayer(playerid,3393, 326.460907, 1827.179688, 4.835900, 0.250000);
		RemoveBuildingForPlayer(playerid,3383, 321.804688, 1832.164063, 4.835900, 0.250000);
		RemoveBuildingForPlayer(playerid,18102, 477.265594, -18.171900, 1001.648376, 0.250000);
		RemoveBuildingForPlayer(playerid,2290, 483.515594, -26.351601, 1002.085876, 0.250000);
		RemoveBuildingForPlayer(playerid,1754, 484.125000, -24.617201, 1002.093811, 0.250000);
		RemoveBuildingForPlayer(playerid,2596, 482.445313, -20.593800, 1002.296875, 0.250000);
		RemoveBuildingForPlayer(playerid,2125, 484.835907, -20.500000, 1000.000000, 0.250000);
		RemoveBuildingForPlayer(playerid,1754, 485.453094, -24.703100, 1002.093811, 0.250000);
		RemoveBuildingForPlayer(playerid,1544, 486.679688, -24.640600, 1002.562500, 0.250000);
		RemoveBuildingForPlayer(playerid,1544, 486.812500, -24.750000, 1002.562500, 0.250000);
		RemoveBuildingForPlayer(playerid,1754, 488.031311, -23.390600, 1002.093811, 0.250000);
		RemoveBuildingForPlayer(playerid,1517, 500.757813, -23.734400, 1000.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,1517, 501.000000, -23.796900, 1000.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,1520, 500.804688, -23.148399, 1000.796875, 0.250000);
		RemoveBuildingForPlayer(playerid,1542, 501.429688, -22.171900, 1000.710876, 0.250000);
		RemoveBuildingForPlayer(playerid,1547, 501.109406, -22.812500, 1000.726624, 0.250000);
		RemoveBuildingForPlayer(playerid,1541, 501.437500, -21.226601, 1000.890625, 0.250000);
		RemoveBuildingForPlayer(playerid,1548, 501.109406, -21.226601, 1000.734375, 0.250000);
		RemoveBuildingForPlayer(playerid,1520, 503.273407, -22.789101, 1000.710876, 0.250000);
		RemoveBuildingForPlayer(playerid,1517, 503.468811, -22.945299, 1000.835876, 0.250000);
		RemoveBuildingForPlayer(playerid,1545, 503.148407, -21.093800, 1001.531311, 0.250000);
		RemoveBuildingForPlayer(playerid,1517, 503.585907, -21.148399, 1002.085876, 0.250000);
		RemoveBuildingForPlayer(playerid,1517, 503.382813, -20.757799, 1002.085876, 0.250000);
		RemoveBuildingForPlayer(playerid,1520, 483.679688, -20.101601, 1000.203125, 0.250000);
		RemoveBuildingForPlayer(playerid,2125, 486.093811, -19.593800, 1000.000000, 0.250000);
		RemoveBuildingForPlayer(playerid,1823, 493.375000, -18.125000, 999.656311, 0.250000);
		RemoveBuildingForPlayer(playerid,2125, 493.351593, -18.664101, 1000.000000, 0.250000);
		RemoveBuildingForPlayer(playerid,2125, 494.390594, -18.656300, 1000.000000, 0.250000);
		RemoveBuildingForPlayer(playerid,1517, 494.179688, -17.601601, 1000.343811, 0.250000);
		RemoveBuildingForPlayer(playerid,2125, 493.539093, -16.421900, 1000.000000, 0.250000);
		RemoveBuildingForPlayer(playerid,2125, 496.015594, -14.968800, 1000.000000, 0.250000);
		RemoveBuildingForPlayer(playerid,1823, 495.648407, -14.570300, 999.656311, 0.250000);
		RemoveBuildingForPlayer(playerid,1520, 496.148407, -13.867200, 1000.203125, 0.250000);
		RemoveBuildingForPlayer(playerid,2125, 497.281311, -13.742200, 1000.000000, 0.250000);
		RemoveBuildingForPlayer(playerid,1548, 501.125000, -18.117201, 1000.734375, 0.250000);
		RemoveBuildingForPlayer(playerid,1517, 500.890594, -16.562500, 1000.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,1517, 501.140594, -16.546900, 1000.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,1520, 503.304688, -16.890600, 1000.710876, 0.250000);
		RemoveBuildingForPlayer(playerid,1544, 503.390594, -17.617201, 1001.343811, 0.250000);
		RemoveBuildingForPlayer(playerid,1544, 503.562500, -17.445299, 1001.343811, 0.250000);
		RemoveBuildingForPlayer(playerid,1436, 479.593811, -4.296900, 1002.632813, 0.250000);
		RemoveBuildingForPlayer(playerid,2779, 501.468811, -10.367200, 999.679688, 0.250000);
		RemoveBuildingForPlayer(playerid,2778, 502.406311, -7.531300, 999.679688, 0.250000);
		RemoveBuildingForPlayer(playerid,2001, 329.687500, 173.898407, 1018.976624, 0.250000);
		RemoveBuildingForPlayer(playerid,1703, 335.085907, 178.429703, 1018.976624, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 350.375000, 168.179703, 1018.984375, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 351.109406, 168.265594, 1018.984375, 0.250000);
		RemoveBuildingForPlayer(playerid,2010, 347.320313, 178.585907, 1018.960876, 0.250000);
		RemoveBuildingForPlayer(playerid,1703, 353.039093, 178.429703, 1018.976624, 0.250000);
		RemoveBuildingForPlayer(playerid,1817, 355.921906, 177.960907, 1018.976624, 0.250000);
		RemoveBuildingForPlayer(playerid,2001, 364.242188, 173.937500, 1018.976624, 0.250000);
		RemoveBuildingForPlayer(playerid,2001, 372.710907, 169.453094, 1018.976624, 0.250000);
		RemoveBuildingForPlayer(playerid,1703, 371.851593, 171.250000, 1018.976624, 0.250000);
		RemoveBuildingForPlayer(playerid,1817, 370.406311, 173.054703, 1018.976624, 0.250000);
		RemoveBuildingForPlayer(playerid,2002, 369.781311, 178.414093, 1018.976624, 0.250000);
		RemoveBuildingForPlayer(playerid,2010, 342.515594, 164.539093, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,2202, 351.679688, 156.437500, 1024.781250, 0.250000);
		RemoveBuildingForPlayer(playerid,2001, 351.726593, 159.515594, 1024.781250, 0.250000);
		RemoveBuildingForPlayer(playerid,2001, 351.726593, 164.695297, 1024.781250, 0.250000);
		RemoveBuildingForPlayer(playerid,2009, 353.382813, 152.312500, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 354.968811, 152.500000, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 354.210907, 152.500000, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,1999, 355.421906, 153.312500, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,1999, 354.632813, 170.937500, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 354.257813, 171.750000, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 355.843811, 171.750000, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,2009, 356.671906, 171.937500, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,2164, 362.203094, 148.578094, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,2164, 364.109406, 148.578094, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,2001, 359.632813, 148.859406, 1024.781250, 0.250000);
		RemoveBuildingForPlayer(playerid,2009, 361.179688, 152.156296, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 362.000000, 152.671906, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 363.585907, 152.632797, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,1999, 363.218811, 153.156296, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,14599, 358.710907, 162.085907, 1026.703125, 0.250000);
		RemoveBuildingForPlayer(playerid,2010, 359.023407, 164.679703, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,2010, 359.023407, 159.578094, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,2001, 366.632813, 159.515594, 1024.781250, 0.250000);
		RemoveBuildingForPlayer(playerid,2001, 366.632813, 164.695297, 1024.781250, 0.250000);
		RemoveBuildingForPlayer(playerid,1999, 362.382813, 170.937500, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 362.007813, 172.250000, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,2164, 361.484406, 175.593796, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 366.414093, 167.632797, 1024.750000, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 366.414093, 166.640594, 1024.750000, 0.250000);
		RemoveBuildingForPlayer(playerid,2202, 366.062500, 169.265594, 1024.781250, 0.250000);
		RemoveBuildingForPlayer(playerid,2009, 364.421906, 171.937500, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 363.593811, 171.421906, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,2164, 363.390594, 175.593796, 1024.773438, 0.250000);
		RemoveBuildingForPlayer(playerid,2001, 365.960907, 175.234406, 1024.781250, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 199.851593, -166.789093, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 199.851593, -163.242203, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 199.851593, -165.000000, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 201.695297, -166.773407, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2387, 202.343796, -164.281296, 999.531311, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 199.851593, -161.476593, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2387, 202.343796, -161.976593, 999.531311, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 199.851593, -159.718796, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 199.851593, -157.968796, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 201.601593, -157.968796, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 203.460907, -166.773407, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 203.367203, -157.968796, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 205.218796, -166.773407, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 205.125000, -157.968796, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2412, 205.929703, -168.648407, 999.515625, 0.250000);
		RemoveBuildingForPlayer(playerid,2387, 206.132797, -164.281296, 999.531311, 0.250000);
		RemoveBuildingForPlayer(playerid,2387, 206.132797, -161.976593, 999.531311, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 206.984406, -166.773407, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 206.890594, -157.968796, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 208.671906, -157.968796, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 208.726593, -166.773407, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 208.734406, -163.257797, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 208.734406, -165.023407, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 208.734406, -161.500000, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,2707, 208.734406, -159.734406, 1003.921875, 0.250000);
		RemoveBuildingForPlayer(playerid,3389, 284.882813, 1831.734375, 7.039100, 0.250000);
		RemoveBuildingForPlayer(playerid,3387, 284.882813, 1834.484375, 7.039100, 0.250000);
		RemoveBuildingForPlayer(playerid,3383, 289.859406, 1830.695313, 7.039100, 0.250000);
		RemoveBuildingForPlayer(playerid,3393, 291.726593, 1835.437500, 7.031300, 0.250000);
		RemoveBuildingForPlayer(playerid,4051, 1371.820313, -1754.820313, 19.046900, 0.250000);
		RemoveBuildingForPlayer(playerid,4055, 1394.359375, -1620.664063, 32.148399, 0.250000);
		RemoveBuildingForPlayer(playerid,4077, 1781.476563, -1648.421875, 26.835899, 0.250000);
		RemoveBuildingForPlayer(playerid,1531, 1767.210938, -1617.539063, 15.039100, 0.250000);
		RemoveBuildingForPlayer(playerid,4220, 1370.640625, -1643.445313, 33.179699, 0.250000);
		RemoveBuildingForPlayer(playerid,4021, 1371.820313, -1754.820313, 19.046900, 0.250000);
		RemoveBuildingForPlayer(playerid,4006, 1394.359375, -1620.664063, 32.148399, 0.250000);
		RemoveBuildingForPlayer(playerid,4028, 1781.476563, -1648.421875, 26.835899, 0.250000);
		RemoveBuildingForPlayer(playerid,5849, 1046.679688, -935.195313, 46.992199, 0.250000);
		RemoveBuildingForPlayer(playerid,5854, 992.531311, -962.734375, 60.781300, 0.250000);
		RemoveBuildingForPlayer(playerid,5935, 1120.156250, -1303.453125, 18.570299, 0.250000);
		RemoveBuildingForPlayer(playerid,1266, 1029.179688, -939.515625, 52.750000, 0.250000);
		RemoveBuildingForPlayer(playerid,1260, 1029.179688, -939.515625, 52.750000, 0.250000);
		RemoveBuildingForPlayer(playerid,5848, 1046.679688, -935.195313, 46.992199, 0.250000);
		RemoveBuildingForPlayer(playerid,5737, 1120.156250, -1303.453125, 18.570299, 0.250000);
		RemoveBuildingForPlayer(playerid,3680, 1439.585938, -924.500000, 41.796902, 0.250000);
		RemoveBuildingForPlayer(playerid,1687, 1435.367188, -922.500000, 48.117199, 0.250000);
		RemoveBuildingForPlayer(playerid,1687, 1435.796875, -919.843811, 48.117199, 0.250000);
		RemoveBuildingForPlayer(playerid,3678, 1439.585938, -924.500000, 41.796902, 0.250000);
		RemoveBuildingForPlayer(playerid,1690, 1444.578125, -920.890625, 47.984402, 0.250000);
		RemoveBuildingForPlayer(playerid,10505, -2285.523438, -157.109406, 40.281300, 0.250000);
		RemoveBuildingForPlayer(playerid,10507, -2339.859375, -53.906300, 40.296902, 0.250000);
		RemoveBuildingForPlayer(playerid,10522, -2637.414063, 376.039093, 15.898400, 0.250000);
		RemoveBuildingForPlayer(playerid,10670, -2586.328125, 121.265602, 10.187500, 0.250000);
		RemoveBuildingForPlayer(playerid,10392, -2339.859375, -53.906300, 40.296902, 0.250000);
		RemoveBuildingForPlayer(playerid,10630, -2586.328125, 121.265602, 10.187500, 0.250000);
		RemoveBuildingForPlayer(playerid,1232, -2657.867188, 390.273407, 5.968800, 0.250000);
		RemoveBuildingForPlayer(playerid,10381, -2637.414063, 376.039093, 15.898400, 0.250000);
		RemoveBuildingForPlayer(playerid,10388, -2285.523438, -157.109406, 40.281300, 0.250000);
		RemoveBuildingForPlayer(playerid,1500, -2271.031250, -156.726593, 34.312500, 0.250000);
		RemoveBuildingForPlayer(playerid,737, -2598.039063, 124.867203, 3.429700, 0.250000);
		RemoveBuildingForPlayer(playerid,10840, -1666.125000, -62.078098, 10.945300, 0.250000);
		RemoveBuildingForPlayer(playerid,10910, -1681.109375, -24.679701, 5.476600, 0.250000);
		RemoveBuildingForPlayer(playerid,10911, -1711.203125, -47.710899, 5.609400, 0.250000);
		RemoveBuildingForPlayer(playerid,10912, -1666.125000, -62.078098, 10.945300, 0.250000);
		RemoveBuildingForPlayer(playerid,1226, -1725.960938, -64.796898, 5.992200, 0.250000);
		RemoveBuildingForPlayer(playerid,10845, -1711.203125, -47.710899, 5.609400, 0.250000);
		RemoveBuildingForPlayer(playerid,1226, -1679.921875, -47.632801, 6.656300, 0.250000);
		RemoveBuildingForPlayer(playerid,10844, -1681.109375, -24.679701, 5.476600, 0.250000);
		RemoveBuildingForPlayer(playerid,9949, -1535.421875, 1054.523438, 18.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,9964, -1535.421875, 1054.523438, 18.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,2616, 325.828094, 302.039093, 1000.257813, 0.250000);
		RemoveBuildingForPlayer(playerid,2309, 326.937500, 304.992188, 998.156311, 0.250000);
		RemoveBuildingForPlayer(playerid,1808, 320.414093, 308.289093, 998.140625, 0.250000);
		RemoveBuildingForPlayer(playerid,2612, 324.414093, 309.960907, 999.914124, 0.250000);
		RemoveBuildingForPlayer(playerid,2614, 325.234406, 309.945313, 1001.328125, 0.250000);
		RemoveBuildingForPlayer(playerid,2309, 325.453094, 309.164093, 998.156311, 0.250000);
		RemoveBuildingForPlayer(playerid,2192, 327.039093, 309.617188, 999.617188, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 323.375000, 314.171906, 998.148376, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 210.984406, 171.546906, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 222.625000, 171.492203, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 217.851593, 172.617203, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 210.984406, 175.593796, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 213.289093, 182.421906, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 231.617203, 179.671906, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 231.617203, 179.023407, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 231.617203, 181.593796, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 231.617203, 182.257797, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1808, 231.937500, 180.250000, 1002.046875, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 213.289093, 185.156296, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 213.289093, 187.554703, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,2185, 213.757797, 184.335907, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 216.640594, 185.789093, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 218.492203, 185.789093, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,1808, 227.343796, 184.921906, 1002.046875, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 229.195297, 184.617203, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 229.859406, 184.617203, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 231.617203, 182.906296, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,2191, 216.976593, 115.257797, 1002.273376, 0.250000);
		RemoveBuildingForPlayer(playerid,2356, 222.359406, 110.226601, 1002.234375, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 225.257797, 108.125000, 1002.195313, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 223.398407, 120.421898, 998.000000, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 224.234406, 121.765602, 1002.210876, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 224.921906, 121.765602, 1002.210876, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 225.570297, 121.765602, 1002.210876, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 227.851593, 108.117203, 1002.195313, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 228.289093, 114.632797, 1002.195313, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 230.429703, 110.601601, 1002.195313, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 234.929703, 109.859398, 1002.195313, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 235.085907, 111.226601, 1002.195313, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 235.078094, 112.703102, 1002.195313, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 226.750000, 119.257797, 998.000000, 0.250000);
		RemoveBuildingForPlayer(playerid,950, 227.148407, 121.992203, 1002.757813, 0.250000);
		RemoveBuildingForPlayer(playerid,950, 213.156296, 140.476593, 1002.562500, 0.250000);
		RemoveBuildingForPlayer(playerid,1715, 210.187500, 148.109406, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1715, 211.468796, 148.109406, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,1715, 216.632797, 147.257797, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1715, 216.671906, 148.203094, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1715, 215.109406, 148.242203, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1714, 211.031296, 150.015594, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,2206, 211.843796, 149.109406, 1002.007813, 0.250000);
		RemoveBuildingForPlayer(playerid,2241, 212.437500, 151.796906, 1002.500000, 0.250000);
		RemoveBuildingForPlayer(playerid,1715, 216.656296, 149.257797, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 210.984406, 163.015594, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 210.984406, 165.828094, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 210.984406, 167.148407, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,950, 218.437500, 140.476593, 1002.562500, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 227.617203, 141.257797, 1002.031311, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 227.617203, 142.593796, 1002.031311, 0.250000);
		RemoveBuildingForPlayer(playerid,1808, 227.921906, 143.476593, 1002.007813, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 228.820297, 145.226593, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1715, 220.179703, 147.296906, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,1715, 221.453094, 147.203094, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 228.820297, 147.328094, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,1808, 228.554703, 155.117203, 1002.007813, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 217.851593, 162.937500, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 217.851593, 164.960907, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 217.851593, 166.937500, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,2356, 222.203094, 167.218796, 1002.023376, 0.250000);
		RemoveBuildingForPlayer(playerid,2252, 231.578094, 158.789093, 1003.359375, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 230.523407, 164.164093, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,1806, 230.523407, 166.000000, 1002.015625, 0.250000);
		RemoveBuildingForPlayer(playerid,2165, 235.484406, 111.875000, 1002.210876, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 240.289093, 109.437500, 1002.210876, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 240.289093, 110.085899, 1002.210876, 0.250000);
		RemoveBuildingForPlayer(playerid,2161, 239.304703, 111.007797, 1002.210876, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 252.539093, 113.953102, 1002.210876, 0.250000);
		RemoveBuildingForPlayer(playerid,1722, 252.539093, 115.289101, 1002.210876, 0.250000);
		RemoveBuildingForPlayer(playerid,14897, 243.203094, 117.304703, 1009.125000, 0.250000);
		RemoveBuildingForPlayer(playerid,2611, 257.750000, 68.523399, 1004.500000, 0.250000);
		RemoveBuildingForPlayer(playerid,2356, 253.382797, 69.710899, 1002.625000, 0.250000);
		RemoveBuildingForPlayer(playerid,1251, 998.093811, 1755.687500, 11.265600, 0.250000);
		RemoveBuildingForPlayer(playerid,1250, 997.726624, 1759.125000, 10.851600, 0.250000);
		RemoveBuildingForPlayer(playerid,3274, 759.921875, 2040.117188, 5.710900, 0.250000);
		RemoveBuildingForPlayer(playerid,961, 2570.734375, 2829.773438, 11.171900, 0.250000);
		RemoveBuildingForPlayer(playerid,960, 2570.734375, 2829.773438, 11.164100, 0.250000);
		RemoveBuildingForPlayer(playerid,961, 2594.585938, 2821.375000, 11.171900, 0.250000);
		RemoveBuildingForPlayer(playerid,960, 2594.593750, 2821.375000, 11.164100, 0.250000);
		RemoveBuildingForPlayer(playerid,961, 2608.796875, 2806.906250, 11.171900, 0.250000);
		RemoveBuildingForPlayer(playerid,960, 2608.796875, 2806.906250, 11.164100, 0.250000);
		RemoveBuildingForPlayer(playerid,1413, 1453.250000, 2323.070313, 11.093800, 0.250000);
		RemoveBuildingForPlayer(playerid,680, 1556.187500, 2278.078125, 9.976600, 0.250000);
		RemoveBuildingForPlayer(playerid,1257, 1558.382813, 2345.539063, 11.093800, 0.250000);
		RemoveBuildingForPlayer(playerid,3465, 1590.351563, 2204.500000, 11.312500, 0.250000);
		RemoveBuildingForPlayer(playerid,1410, 1571.375000, 2163.632813, 10.484400, 0.250000);
		RemoveBuildingForPlayer(playerid,3465, 2141.671875, 2753.320313, 11.273400, 0.250000);
		RemoveBuildingForPlayer(playerid,1412, 1712.140625, 2723.539063, 11.109400, 0.250000);
		RemoveBuildingForPlayer(playerid,1290, 1102.562500, 2484.726563, 15.773400, 0.250000);
		RemoveBuildingForPlayer(playerid,7657, 1047.390625, 2063.687500, 11.539100, 0.250000);
		RemoveBuildingForPlayer(playerid,1268, 1108.367188, 2073.593750, 25.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,1268, 1003.484375, 2178.492188, 25.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,3447, 1063.328125, 2030.140625, 17.320299, 0.250000);
		RemoveBuildingForPlayer(playerid,1410, 1054.500000, 2043.039063, 10.484400, 0.250000);
		RemoveBuildingForPlayer(playerid,1410, 1060.492188, 2043.039063, 10.484400, 0.250000);
		RemoveBuildingForPlayer(playerid,1410, 1065.164063, 2043.039063, 10.484400, 0.250000);
		RemoveBuildingForPlayer(playerid,1257, 1073.375000, 2062.078125, 11.093800, 0.250000);
		RemoveBuildingForPlayer(playerid,1259, 1108.367188, 2073.593750, 25.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,7914, 1108.453125, 2075.265625, 31.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,3474, 978.289124, 2094.992188, 16.742201, 0.250000);
		RemoveBuildingForPlayer(playerid,7915, 1005.164124, 2178.398438, 31.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,1259, 1003.484375, 2178.492188, 25.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,1251, 998.093811, 1755.687500, 11.265600, 0.250000);
		RemoveBuildingForPlayer(playerid,1250, 997.726624, 1759.125000, 10.851600, 0.250000);
		RemoveBuildingForPlayer(playerid,3274, 771.515625, 2064.875000, 5.710900, 0.250000);
		RemoveBuildingForPlayer(playerid,1686, 624.046875, 1677.601563, 6.179700, 0.250000);
		RemoveBuildingForPlayer(playerid,1686, 606.898376, 1702.218750, 6.179700, 0.250000);
		RemoveBuildingForPlayer(playerid,1686, 610.250000, 1697.265625, 6.179700, 0.250000);
		RemoveBuildingForPlayer(playerid,1468, 664.976624, 1699.382813, 7.406300, 0.250000);
		RemoveBuildingForPlayer(playerid,1468, 668.742188, 1699.156250, 7.406300, 0.250000);
		RemoveBuildingForPlayer(playerid,3274, 751.500000, 2052.414063, 5.710900, 0.250000);
		RemoveBuildingForPlayer(playerid,3273, 770.929688, 2033.093750, 5.710900, 0.250000);
		RemoveBuildingForPlayer(playerid,986, 2497.406250, 2769.109375, 11.531300, 0.250000);
		RemoveBuildingForPlayer(playerid,16309, 566.648376, 874.484375, -39.531300, 0.250000);
		RemoveBuildingForPlayer(playerid,986, 2497.406250, 2769.109375, 11.531300, 0.250000);
		RemoveBuildingForPlayer(playerid,986, 2497.406250, 2769.109375, 11.531300, 0.250000);
		RemoveBuildingForPlayer(playerid,16309, 566.648376, 874.484375, -39.531300, 0.250000);
		RemoveBuildingForPlayer(playerid,12922, -28.242201, 163.679703, 4.789100, 0.250000);
		RemoveBuildingForPlayer(playerid,3276, -34.296902, 160.015594, 2.320300, 0.250000);
		RemoveBuildingForPlayer(playerid,616, 2798.062500, 2244.906250, 9.820300, 0.250000);
		RemoveBuildingForPlayer(playerid,1290, 948.742188, 738.757813, 15.570300, 0.250000);
		RemoveBuildingForPlayer(playerid,1308, 9.023400, 15.156300, -5.710900, 0.250000);
		RemoveBuildingForPlayer(playerid,703, -893.976624, 1608.554688, 22.210899, 0.250000);
		RemoveBuildingForPlayer(playerid,11500, -1192.179688, 1809.937500, 40.773399, 0.250000);
		RemoveBuildingForPlayer(playerid,649, -853.148376, 1550.757813, 22.429701, 0.250000);
		RemoveBuildingForPlayer(playerid,11435, -867.234375, 1611.328125, 30.851601, 0.250000);
		RemoveBuildingForPlayer(playerid,1340, -799.781311, 1624.218750, 27.125000, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -1672.968750, 2701.062500, 57.148399, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -1584.789063, 2695.718750, 54.781300, 0.250000);
		RemoveBuildingForPlayer(playerid,703, -1554.992188, 2510.070313, 57.054699, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -1535.476563, 2505.757813, 55.242199, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -1470.789063, 2553.710938, 55.242199, 0.250000);
		RemoveBuildingForPlayer(playerid,700, -1459.320313, 2552.828125, 55.226601, 0.250000);
		RemoveBuildingForPlayer(playerid,672, -1454.273438, 2640.140625, 55.828098, 0.250000);
		RemoveBuildingForPlayer(playerid,1294, -1437.585938, 2597.039063, 59.273399, 0.250000);
		RemoveBuildingForPlayer(playerid,672, -1403.476563, 2611.804688, 55.578098, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -1368.593750, 2635.242188, 51.734402, 0.250000);
		RemoveBuildingForPlayer(playerid,700, -1441.789063, 2647.328125, 55.226601, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -1449.523438, 2705.476563, 55.242199, 0.250000);
		RemoveBuildingForPlayer(playerid,672, -1466.992188, 2705.945313, 55.828098, 0.250000);
		RemoveBuildingForPlayer(playerid,11677, -1303.367188, 2664.078125, 53.578098, 0.250000);
		RemoveBuildingForPlayer(playerid,3425, -466.429688, 2190.273438, 55.992199, 0.250000);
		RemoveBuildingForPlayer(playerid,652, -748.945313, 2745.031250, 45.898399, 0.250000);
		RemoveBuildingForPlayer(playerid,652, -749.265625, 2755.500000, 46.007801, 0.250000);
		RemoveBuildingForPlayer(playerid,652, -749.187500, 2764.695313, 45.882801, 0.250000);
		RemoveBuildingForPlayer(playerid,1223, -251.546906, 2647.367188, 61.609402, 0.250000);
		RemoveBuildingForPlayer(playerid,16776, -237.023407, 2662.835938, 62.609402, 0.250000);
		RemoveBuildingForPlayer(playerid,1340, -197.492203, 2659.914063, 62.820301, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -206.632797, 2672.242188, 61.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -278.968811, 2679.023438, 61.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -156.023407, 2675.203125, 61.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,672, -243.031296, 2688.304688, 62.484402, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -356.843811, 2707.421875, 62.804699, 0.250000);
		RemoveBuildingForPlayer(playerid,1223, -245.007797, 2706.710938, 61.609402, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -333.570313, 2719.351563, 61.867199, 0.250000);
		RemoveBuildingForPlayer(playerid,672, -240.835907, 2737.148438, 62.484402, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -269.695313, 2750.460938, 61.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -297.804688, 2755.187500, 61.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,672, -245.312500, 2781.492188, 62.367199, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -232.164093, 2685.273438, 61.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -202.570297, 2687.968750, 61.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,1223, -211.593796, 2695.695313, 61.609402, 0.250000);
		RemoveBuildingForPlayer(playerid,672, -213.289093, 2787.929688, 61.921902, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -211.960907, 2805.664063, 61.875000, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -155.093796, 2711.234375, 61.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -164.164093, 2754.765625, 61.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -168.484406, 2740.554688, 61.367199, 0.250000);
		RemoveBuildingForPlayer(playerid,669, -174.554703, 2769.460938, 61.109402, 0.250000);
		RemoveBuildingForPlayer(playerid,1367, -2607.554688, 2341.273438, 7.976600, 0.250000);
		RemoveBuildingForPlayer(playerid,1346, -2553.054688, 2320.484375, 5.320300, 0.250000);
		RemoveBuildingForPlayer(playerid,1297, -2691.171875, 2542.656250, 79.554703, 0.250000);
		RemoveBuildingForPlayer(playerid,1297, -2476.437500, 2616.625000, 57.570301, 0.250000);
		RemoveBuildingForPlayer(playerid,1297, -2391.382813, 2679.007813, 62.265598, 0.250000);
		RemoveBuildingForPlayer(playerid,1297, -2307.710938, 2629.062500, 57.242199, 0.250000);
		RemoveBuildingForPlayer(playerid,3276, 742.984375, 329.515594, 20.117201, 0.250000);
		RemoveBuildingForPlayer(playerid,1686, 655.664124, -558.929688, 15.359400, 0.250000);
		RemoveBuildingForPlayer(playerid,1686, 1380.632813, 460.273407, 19.328100, 0.250000);
		RemoveBuildingForPlayer(playerid,3338, -1575.007813, 1878.132813, 25.695299, 0.250000);
		RemoveBuildingForPlayer(playerid,3338, -1762.593750, 2014.203125, 12.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,708, -1063.671875, 1457.093750, 31.718800, 0.250000);
		RemoveBuildingForPlayer(playerid,703, -931.968811, 1129.007813, 27.804701, 0.250000);
		RemoveBuildingForPlayer(playerid,700, -947.562500, 1146.375000, 29.820299, 0.250000);
		RemoveBuildingForPlayer(playerid,672, -938.664124, 1144.304688, 30.062500, 0.250000);
		RemoveBuildingForPlayer(playerid,708, -910.929688, 1200.742188, 31.718800, 0.250000);
		RemoveBuildingForPlayer(playerid,703, -1317.164063, 1753.125000, 23.218800, 0.250000);
		RemoveBuildingForPlayer(playerid,1686, -1464.937500, 1860.562500, 31.820299, 0.250000);
		RemoveBuildingForPlayer(playerid,1686, -1477.851563, 1867.312500, 31.820299, 0.250000);
		RemoveBuildingForPlayer(playerid,3244, -1575.007813, 1878.132813, 25.695299, 0.250000);
		RemoveBuildingForPlayer(playerid,706, -1725.273438, 1931.851563, 17.945299, 0.250000);
		RemoveBuildingForPlayer(playerid,705, -842.593811, 1255.960938, 29.046900, 0.250000);
		RemoveBuildingForPlayer(playerid,713, -806.656311, 981.812500, 13.000000, 0.250000);
		RemoveBuildingForPlayer(playerid,705, -805.250000, 1034.859375, 21.898399, 0.250000);
		RemoveBuildingForPlayer(playerid,708, -699.546875, 1058.726563, 12.500000, 0.250000);
		RemoveBuildingForPlayer(playerid,691, -665.890625, 1004.179688, 11.585900, 0.250000);
		RemoveBuildingForPlayer(playerid,691, -652.554688, 999.906311, 11.585900, 0.250000);
		RemoveBuildingForPlayer(playerid,705, -645.507813, 1094.453125, 12.640600, 0.250000);
		RemoveBuildingForPlayer(playerid,705, -621.859375, 985.890625, 8.078100, 0.250000);
		RemoveBuildingForPlayer(playerid,3244, -1762.593750, 2014.203125, 12.156300, 0.250000);
		RemoveBuildingForPlayer(playerid,1676, -92.101601, -1161.789063, 2.960900, 0.250000);
		RemoveBuildingForPlayer(playerid,1294, -198.679703, 984.015625, 23.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,16061, -193.375000, 1055.289063, 18.320299, 0.250000);
		RemoveBuildingForPlayer(playerid,1294, -199.671906, 1043.187500, 23.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,1294, -199.671906, 1058.125000, 23.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,1294, -186.460907, 1058.648438, 23.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,1294, -186.460907, 1073.562500, 23.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,1294, -199.671906, 1123.554688, 23.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,1294, -186.460907, 1138.460938, 23.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,16060, -192.046906, 1147.390625, 17.695299, 0.250000);
		RemoveBuildingForPlayer(playerid,1294, -199.671906, 1158.921875, 23.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,1294, -186.460907, 1173.562500, 23.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,3286, -230.203094, 1185.773438, 23.351601, 0.250000);
		RemoveBuildingForPlayer(playerid,1294, -81.718803, 1193.640625, 23.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,1294, -96.078102, 1202.882813, 23.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,16777, -105.359398, 1212.070313, 18.734400, 0.250000);
		RemoveBuildingForPlayer(playerid,652, -127.265602, 1222.515625, 18.656300, 0.250000);
		RemoveBuildingForPlayer(playerid,1294, 20.914101, 1193.640625, 23.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,1294, 49.140598, 1193.640625, 23.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,1294, 49.140598, 1202.882813, 23.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,16000, 110.812500, 1023.992188, 12.648400, 0.250000);
		RemoveBuildingForPlayer(playerid,16002, 172.804703, 1088.625000, 18.109400, 0.250000);
		RemoveBuildingForPlayer(playerid,16590, 199.343796, 1943.789063, 18.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,16619, 199.335907, 1943.875000, 18.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,1411, 347.195313, 1799.265625, 18.757799, 0.250000);
		RemoveBuildingForPlayer(playerid,1411, 342.937500, 1796.289063, 18.757799, 0.250000);
		RemoveBuildingForPlayer(playerid,16670, 330.789093, 1813.218750, 17.828100, 0.250000);
		RemoveBuildingForPlayer(playerid,1697, 220.382797, 1835.343750, 23.234400, 0.250000);
		RemoveBuildingForPlayer(playerid,1697, 228.796906, 1835.343750, 23.234400, 0.250000);
		RemoveBuildingForPlayer(playerid,1697, 236.992203, 1835.343750, 23.234400, 0.250000);
		RemoveBuildingForPlayer(playerid,16094, 191.140594, 1870.039063, 21.476601, 0.250000);
		RemoveBuildingForPlayer(playerid,16203, 199.343796, 1943.789063, 18.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,16323, 199.335907, 1943.875000, 18.203100, 0.250000);
		RemoveBuildingForPlayer(playerid,16671, 193.953094, 2051.796875, 20.179701, 0.250000);
		RemoveBuildingForPlayer(playerid,16668, 357.937500, 2049.421875, 16.843800, 0.250000);
		RemoveBuildingForPlayer(playerid,16669, 380.257813, 1914.960938, 17.429701, 0.250000);
		RemoveBuildingForPlayer(playerid,3260, 259.023407, 1861.906250, 8.757800, 0.250000);
		RemoveBuildingForPlayer(playerid,3260, 259.968811, 1864.937500, 8.757800, 0.250000);
		RemoveBuildingForPlayer(playerid,3260, 258.078094, 1862.953125, 8.757800, 0.250000);
		RemoveBuildingForPlayer(playerid,16322, 248.726593, 1869.984375, 11.851600, 0.250000);
		RemoveBuildingForPlayer(playerid,3260, 259.968811, 1866.921875, 8.757800, 0.250000);
		RemoveBuildingForPlayer(playerid,3260, 258.078094, 1866.921875, 8.757800, 0.250000);
		RemoveBuildingForPlayer(playerid,16641, 251.445297, 1866.304688, 9.289100, 0.250000);
		RemoveBuildingForPlayer(playerid,3394, 271.789093, 1852.953125, 7.750000, 0.250000);
		RemoveBuildingForPlayer(playerid,3395, 276.273407, 1852.937500, 7.750000, 0.250000);
		RemoveBuildingForPlayer(playerid,3397, 280.656311, 1855.523438, 7.750000, 0.250000);
		RemoveBuildingForPlayer(playerid,3383, 275.375000, 1859.148438, 7.757800, 0.250000);
		RemoveBuildingForPlayer(playerid,3383, 269.093811, 1858.320313, 7.757800, 0.250000);
		RemoveBuildingForPlayer(playerid,3389, 266.867188, 1852.906250, 7.757800, 0.250000);
		RemoveBuildingForPlayer(playerid,3396, 275.312500, 1874.242188, 7.750000, 0.250000);
		RemoveBuildingForPlayer(playerid,3384, 278.093811, 1869.101563, 9.179700, 0.250000);
		RemoveBuildingForPlayer(playerid,3384, 278.093811, 1870.335938, 9.179700, 0.250000);
		RemoveBuildingForPlayer(playerid,3387, 271.250000, 1869.695313, 7.757800, 0.250000);
		RemoveBuildingForPlayer(playerid,3388, 271.226593, 1870.929688, 7.757800, 0.250000);
		RemoveBuildingForPlayer(playerid,3386, 271.265594, 1868.187500, 7.757800, 0.250000);
		RemoveBuildingForPlayer(playerid,3395, 280.328094, 1874.234375, 7.750000, 0.250000);
		RemoveBuildingForPlayer(playerid,3384, 276.593811, 1868.960938, 9.179700, 0.250000);
		RemoveBuildingForPlayer(playerid,3384, 276.593811, 1870.195313, 9.179700, 0.250000);

		   // new constr[80],strip[15];
		   // GetPlayerIp(playerid,strip,15);
		    //format(constr,80,"ВХОД: {5fc66d}%s[%d]{766458}IP: {5fc66d}%s",pInfo[playerid][Name],playerid,strip);
		  //  for(new i=0;i<4;i++)
		//	{
		//	   SendClientMessage(AdminId[i],0x766458,constr);
		//	}
	}

	return 1;
}

forward PlayerAutorizaed(playerid);
public PlayerAutorizaed(playerid)
{
    static str_auth_dialog[1867];//=//(70+24)+80+67+90+81+101+76+87+75+74+90+86+84+79+73+76+71+70+79+87+74+98+75]=//
	format(str_auth_dialog,1867,
"{E8D699}Приветствуем тебя на Секторе, выживший {00E100}%s{E8D699}!\n\n\
{D50000}Выбирайся на поверхность и начни свой опасный путь! Там тебя ждут:\n\n\
{FF8000}Более 5000 мест{E8D699}, в которых может появиться лут!\n\
{FF8000}Более 50 заброшенных зданий{E8D699} с ценным лутом: старые больницы, магазины,\n\
{E8D699}рестораны, отели, полицейские участки, склады, шахты и многое другое!\n\
{FF8000}Более 220 видов вещей{E8D699}: медикаменты, одежда, провизия, оружие и прочее снаряжение!\n\
{FF8000}50 зомби{E8D699}: агрессивные боты, с искусственным интеллектом!\n\
{FF8000}Система канализаций{E8D699}, под землей вы сможете пройти километры пути!\n\n\
{D50000}Но помни о суровых условиях поверхности и своих потребностях:\n\n\
{FF8000}Голод{E8D699}: нужно регулярно есть, причем думать что именно!\n\
{E8D699}От плесневой шаурмы ты можешь заболеть, а разогретая тушенка придаст тебе сил!\n\
{FF8000}Жажда{E8D699}: Пей как можно больше жидкости, но тоже думай, что ты пьешь.\n\
{E8D699}От кислого молока скорее всего скрючит живот, а от водки может вырубить.\n\
{FF8000}Иммунитет{E8D699}: Не выходи без респиратора и в бурю - это смерть.\n\
{FF8000}Холод{E8D699}: Ночью очень холодно и можно быстро замерзнуть.\n\
{E8D699}Разводи костры, пей и ешь горячее или передвигайся в автомобиле!\n\
{FF8000}Усталость{E8D699}: Ты не робот, тебе регулярно нужно спать.\n\
{E8D699}Старайся не спать на голой земле без костра. Делай лагерь!\n\
{FF8000}Нужда{E8D699}: Тебе регулярно нужно ходить в туалет, как без этого?\n\
{FF8000}Настроение{E8D699}: Ты не хладнокровный убийца, следи за своим настроением.\n\
{E8D699}Поднимай его алкоголем, сексом, молитвами или игрой на гитаре.\n\
{FF8000}Болезни{E8D699}: Не бегай под дождем, не вздумай залезть в реку и не ешь все подряд.\n\n\
{E8D699}Хорошего хабара! {00E100}",pInfo[playerid][Name]);

	new str_file_n[34];
	format(str_file_n,34,"accaunts/%s.txt",pInfo[playerid][Name]);
    if(fexist(str_file_n)==0)//аккаунт не существует
    {
      //  format(str_auth_title,64,"{FFFFFF}Новый аккаунт. {51FF0F}Регистрация:");
	//	format(str_auth_,59,);//59
	    strcat(str_auth_dialog,"Придумай сложный пароль и не забудь его:");//41
        
        ShowPlayerDialog(playerid,2,3,!"{FFFFFF}Новый аккаунт. {51FF0F}Регистрация:",str_auth_dialog,!"Ок",!"Выход");
        SetPVarInt(playerid,"reg",1);
    }
	else//аккаунт существеут
	{
	 //   format(str_auth_title,64,"{FFFFFF}Аккаунт с таким ником существует. {51FF0F}Авторизация:");
	    strcat(str_auth_dialog,"Введи свой пароль и погнали:");
	    ShowPlayerDialog(playerid,1,3,!"{FFFFFF}Аккаунт с таким ником существует. {51FF0F}Авторизация:",str_auth_dialog,!"Ок",!"Выход");
	    
	    new File:opnfile; // создаём файловую переменную
		opnfile=fopen(str_file_n,io_read); /* открываем файл file с возможностью чтения и записываем его идентификатор в opnfile */
		new str_save_p[400]="";
		fread(opnfile,str_save_p); // читаем первую строку из файла и записываем её в tostring
		fclose(opnfile);
		

		new len_pas;
  		sscanf(str_save_p,"p<|>d",len_pas);
	    printf("len_pas: %d",len_pas);

	    new strb[55];
	    format(strb,55,"p<|>ds[%d]d",len_pas);
		new vw=0;
	    sscanf(str_save_p, strb ,len_pas ,pInfo[playerid][Password],vw);
	    SetPVarInt(playerid,"virtual",vw);
	}
}
public OnPlayerDisconnect(playerid,reason)
{
    DeletePVar(playerid,"er");
	return 1;
}
public OnPlayerClickTextDraw(playerid, Text:clickedid)
{
    if(pInfo[playerid][openInv]==true)
    {
	    if(clickedid == Text:65535 || clickedid==INV_CROSS)
	    {
	        pInfo[playerid][openInv]=false;
			for(new Text:i=INV_YELLOY_MENU;i<=INV_KPK_MODEL_LAPTOP;i++)
			{
				TextDrawHideForPlayer(playerid,i);
			}
			for(new tid=0,maxs=pInfo[playerid][end_slot];tid<=maxs;tid++)
			{
			    if(PLAYER_LOOT_DRAW[playerid][tid][loottype]!=0)
			    {
	            	PlayerTextDrawHide(playerid,PLAYER_LOOT_DRAW[playerid][tid][loot_model]);
					PlayerTextDrawHide(playerid,PLAYER_LOOT_DRAW[playerid][tid][loot_textX]);
				}
			}
			PlayerTextDrawHide(playerid, PLAYER_DRAWS[playerid][21]);
			PlayerPlaySound(playerid, 4602, 0.000000, 0.000000, 0.000000);

			ApplyAnimation(playerid,"CARRY","crry_prtial",4.000000, 0, 0,0,0,0);
			
			if(clickedid==INV_CROSS)
			{
				CancelSelectTextDraw(playerid);
			}
			return 1;
		}
		else if(clickedid == INV_KPK_MODEL_LAPTOP)//значок ноутбука кпк в инвенторе
		{
			PlayerPlaySound(playerid,40405,0.0,0.0,0.0);
			ShowPlayerDialog(playerid, 12500,2, !"{51FF0F}КПК", !"{E8D699}Баланс\n\
{E8D699}СМС\n\
{E8D699}Календарь\n\
{E8D699}Рингтон смс\n\
{E8D699}Радио 'Сектор'\n\
{E8D699}Выключить радио\n\
{E8D699}Камера: сделать селфи", !"Ок", !"Отмена");
		}
		else if(clickedid == INV_TORG)//значок доллара торговли в инвенторе
		{
		    PlayerPlaySound(playerid,20801,0.0,0.0,0.0);
		    ShowPlayerDialog(playerid, 10013,2, !"{51FF0F}Торговля", !"Открыть лавку\nЗакрыть лавку\nСправка", !"Выбрать", !"Отмена");
		}
	}
    return 0;
}

public OnPlayerClickPlayerTextDraw(playerid, PlayerText:playertextid)
{

	if(playertextid!=PlayerText:65535)
	{
		for(new i=0;i<MAX_INVENTORY_LOOT;i++)
		{
		    if(PLAYER_LOOT_DRAW[playerid][i][loot_model]==playertextid)
		    {
		        new loot_type=PLAYER_LOOT_DRAW[playerid][i][loottype];
		        PLAYER_PRE_USE_[playerid]=i;

				new str_lootname[30];
				format(str_lootname,30,"{FF0000}%s",InfoLoot[loot_type][NAMEloot]);

		    	ShowPlayerDialog(playerid,100,2, str_lootname,
"Что это?\n\
Использовать\n\
Выбросить\n\
Передать\n\
Предложить купить (игроку)\n\
Продать торговцу (NPC)", "Далее","Назад"
				);

				break;
		    }
		}
	}
    return 0;
}
public OnPlayerClickPlayer(playerid, clickedplayerid, source)
{
	if(IsPlayerConnected(clickedplayerid)&&clickedplayerid<501&&IsPlayerNPC(clickedplayerid)==0)
	{
	    pInfo[playerid][player_c]=clickedplayerid;
	    ShowPlayerDialog(playerid,2642,2,!"Выберите нужный пункт:",!"Отправить личное сообщение\nЗаказать убийство (нанять киллера)",!"Ок",!"Отмена");
	}
	return 1;
}
	   

public OnPlayerLeaveDynamicArea(playerid,areaid)
{
	if(areaid==AREA_BUNKER)
	{
	    if(pInfo[playerid][Resp]==true)
	    {
			AttachResp(playerid);
		}
	}
	return 1;
}
public OnPlayerEnterDynamicArea(playerid,areaid)
{
	if(areaid==BUNKER_VOROTA)
	{
	    if(vorota_open==0)
	    {
	        SetPreciseTimer("vorota_close",7500,0);
        	MoveDynamicObject(vorota, 212.600006,1875.630005,17.170000, 1.0);
            vorota_open=1;
            new Float:x,Float:y,Float:z;
		    GetDynamicObjectPos(vorota,x,y,z);
		    if(z<14.0)
		    {
		    	foreach(Player, i)
				{
				    if(IsPlayerInRangeOfPoint(i,16.0,212.600006,1875.630005,13.970000))
				    {
		        		PlayerPlaySound(i,12201,0.0,0.0,0.0);
					}
				}
		    }
	    }

	}
	else if(areaid==AREA_BUNKER)
	{
	    RemovePlayerAttachedObject(playerid, AttachPack_9);

	    pInfo[playerid][Virus]=0;

		pInfo[playerid][Temp]=20;

	}
	else if(areaid>=STOL_A&&areaid<=STOL_i)//на фабрике столы
	{
 		if(pInfo[playerid][Ready_clothe]==1)
	    {
			new object;
			switch(areaid)
			{
				case STOL_A:
				{

				    SetPlayerCheckpoint(playerid, 308.557678,1830.822510,6.384280,1.000000);
				    object=CreateDynamicObject(2843, 307.83429, 1830.97461, 6.85450,   0.00000, 0.00000, 0.00000);
				    SetPlayerFacingAngle(playerid,0.0);
				}
				case STOL_B:
				{
				    SetPlayerCheckpoint(playerid, 306.158386,1830.822510,6.384300,1.000000);
					object=CreateDynamicObject(2843, 305.61249, 1830.97095, 6.85450,   0.00000, 0.00000, 0.00000);
					SetPlayerFacingAngle(playerid,0.0);
				}
				case STOL_C:
				{
				    SetPlayerCheckpoint(playerid, 303.954315,1830.822510,6.384300,1.000000);
                    object=CreateDynamicObject(2843, 303.49469, 1830.97021, 6.85450,   0.00000, 0.00000, 0.00000);
                    SetPlayerFacingAngle(playerid,0.0);
				}
				//////////////////
				case STOL_D:
				{
				    SetPlayerCheckpoint(playerid, 308.809601,1833.592651,6.384300,1.000000);
                    object=CreateDynamicObject(2843, 308.21289, 1832.64429, 6.85450,   0.00000, 0.00000, 0.00000);
                    SetPlayerFacingAngle(playerid,180.0);
				}
				case STOL_E:
				{
				    SetPlayerCheckpoint(playerid, 306.227112,1833.592651,6.384300,1.000000);
                    object=CreateDynamicObject(2843, 305.81516, 1832.64307, 6.85450,   0.00000, 0.00000, 0.00000);
                    SetPlayerFacingAngle(playerid,180.0);
				}
				case STOL_F:
				{
				    SetPlayerCheckpoint(playerid, 303.870514,1833.592651,6.384300,1.000000);
                    object=CreateDynamicObject(2843, 303.61554, 1832.64563, 6.85450,   0.00000, 0.00000, 0.00000);
                    SetPlayerFacingAngle(playerid,180.0);
				}
				//////////////////
				case STOL_G:
				{
				    SetPlayerCheckpoint(playerid, 308.736511,1835.484253,6.384300,1.000000);
                    object=CreateDynamicObject(2843, 308.03830, 1835.64307, 6.85450,   0.00000, 0.00000, 0.00000);
                    SetPlayerFacingAngle(playerid,0.0);
				}
				case STOL_H:
				{
				    SetPlayerCheckpoint(playerid, 306.440491,1835.484253,6.384300,1.000000);
                    object=CreateDynamicObject(2843, 305.84790, 1835.48950, 6.85450,   0.00000, 0.00000, 0.00000);
                    SetPlayerFacingAngle(playerid,0.0);
				}
				case STOL_i:
				{
				    SetPlayerCheckpoint(playerid, 304.335999,1835.484253,6.384300,1.000000);
                    object=CreateDynamicObject(2843, 303.82825, 1835.62512, 6.85450,   0.00000, 0.00000, 0.00000);
                    SetPlayerFacingAngle(playerid,0.0);
				}
				//////////////////
			}
            SetPlayerPos(playerid,pInfo[playerid][pos_x],pInfo[playerid][pos_y], 7.276799);
			RemovePlayerAttachedObject(playerid,8);
			ApplyAnimation(playerid,"INT_SHOP","shop_cashier",4.1,0,0,0,1,15000);
			SetPlayerAttachedObject(playerid,8,18632,5,0.072000,0.023900,-0.013000,-44.200001,-93.190002,26.799999,0.780000,0.750000,0.180000);
			SendClientMessage(playerid,0x008800FF,"Вы шьёте одежду! Подождите...");
			SetPreciseTimer("FABRIC_CLOTHES",6000,0,"dd",playerid,object);
			pInfo[playerid][Ready_clothe]=2;

		}
	}
	else if(areaid==FABRIC_PRODUCTION)//готовая продукция
	{
	    SetPlayerCheckpoint(playerid, 316.494751,1834.342041,6.581740,2.000000);
	    if(pInfo[playerid][Ready_clothe]==3)
	    {
	        RemovePlayerAttachedObject(playerid,8);
		    pInfo[playerid][Clothes]++;
	        pInfo[playerid][Ready_clothe]=1;

	        new fabrick_str[50];
	        format(fabrick_str,50,"Изготовлено одежды: {00FF00}%d{FFFFFF}/{FF0000}10",pInfo[playerid][Clothes]);
			SendClientMessage(playerid,-1,fabrick_str);

	        SendClientMessage(playerid,0x008800AA,!"Возьмите новый материал с ткацкого станка.");

			if(pInfo[playerid][Clothes]==10)
			{
			    pInfo[playerid][Clothes]=0;
				pInfo[playerid][Ready_clothe]=0;
				pInfo[playerid][Resp]=true;
				SendClientMessage(playerid,0x008800AA,!"Оплата: {FF0000}Респиратор {008800}(сразу используется)!");
				SendClientMessage(playerid,0xFFFFFFAA,!"Вы использовали респиратор, он сохраняется с релогом, но пропадает при гибели.");
			//	SendClientMessage(playerid,0xFFFFFFAA,!"Одного респиратора хватает, примерно, на трое суток (игровых). Износ идет только на поверхности!");
				PlayerPlaySound(playerid,33402,0.000000,0.000000,0.000000);
			}
		}
	}
	return 1;
}
forward FABRIC_CLOTHES(playerid,object);
public FABRIC_CLOTHES(playerid,object)
{
    ApplyAnimation(playerid,"CARRY","crry_prtial",4.1,0,1,1,1,1);
    SendClientMessage(playerid,0x008800AA,"Положите одежду в коробку!");
    RemovePlayerAttachedObject(playerid,8);
    SetPlayerAttachedObject(playerid,8,2386,5, 0.041000,0.056900,0.161000,-83.889999,2.100000,-76.089996,1.000000,1.000000,1.000000);
    pInfo[playerid][Ready_clothe]=3;
    DestroyDynamicObject(object);
}

forward vorota_close();
public vorota_close()
{
	MoveDynamicObject(vorota, 212.600006,1875.630005,13.970000, 1.0);
	vorota_open=0;
}

forward OXPAHA();
public OXPAHA()
{
	static oxpana[74];
	for(new i;i<12;i++)
	{
		
		if(random(4)==2)
		{
			switch(random(50))
			{
			    
			    case 0 :format(oxpana, 74, "Проходи, что уставился?");
			    case 1 :format(oxpana, 74, "Как дела на поверхности?");
			    case 2 :format(oxpana, 74, "Неее! Я из бункера ни ногой!");
			    case 3 :format(oxpana, 74, "На заброшенных заводах еще может быть много еды.");
			    case 4 :format(oxpana, 74, "Говорят, мародеры нашли сарай людоеда, с кучей трупов и гнилого мяса.");
			    case 5 :format(oxpana, 74, "Говорят, под землей есть большая сеть канализаций!");
			    case 6 :format(oxpana, 74, "Если совсем туго придется, надежда только на спасателей.");
			    case 7 :format(oxpana, 74, "Тут всем плевать, кем ты был раньше!");
			    case 8 :format(oxpana, 74, "А-аай! Не самый подходящий день для смерти.");
			    case 9 :format(oxpana, 74, "Скоро мы все станем зараженными!");
			    case 10:format(oxpana, 74, "Нужно расширять территорию!");
			    case 11:format(oxpana, 74, "Иваныч ждет от тебя вестей.");
			    case 12:format(oxpana, 74, "Иваныч говорит, что в метро появился новый барыга.");
			    case 13:format(oxpana, 74, "Мы так долго здесь не продержимся...");
			    case 14:format(oxpana, 74, "Говорят, есть заброшенное бомбоубежище. Вот бы его найти!");
			    case 15:format(oxpana, 74, "Здарова, выживший!");
			    case 16:format(oxpana, 74, "Мародера, как волка - ноги кормят!");
			    case 17:format(oxpana, 74, "Ты даже не представляешь где я был и что там видел.");
			    case 18:format(oxpana, 74, "Скоро это место будет только на карте... Старой карте.");
			    case 19:format(oxpana, 74, "Сейчас бы пожрать чего горяченького...");
			    case 20:format(oxpana, 74, "От меня ты помощи не дождешься!");
			    case 21:format(oxpana, 74, "Даа, босс вас..хах, пожалеет!");
			    case 22:format(oxpana, 74, "Бури на поверхности все чаще. Эх, сейчас бы поваляться на солнышке!");
			    case 23:format(oxpana, 74, "Проходи, не до тебя сейчас.");
			    case 24:format(oxpana, 74, "Мы с боссом вам поможем!");
			    case 25:format(oxpana, 74, "Похоже... у нас неприятности...");
			    case 26:format(oxpana, 74, "Э-эх, сейчас бы пожрать чего горячеького...");
			    case 27:format(oxpana, 74, "Милое местечно! Ты хочешь, чтобы с ним было все в порядке?");
			    case 28:format(oxpana, 74, "Приятель, за крышу платить надо, а то протекать будет!");
			    case 29:format(oxpana, 74, "Хорошенькое местечко! Я уверен, ты хочешь чтобы оно таким же и осталось!");
		        case 30:format(oxpana, 74, "Все ништяк!");
		        case 31:format(oxpana, 74, "Пора расшибить пару чьих нибудь лбов!");
		        case 32:format(oxpana, 74, "Слыхал? Говорят на трассе самолет разбился!");
		        case 33:format(oxpana, 74, "Для нас настали сложные времена.");
		        case 34:format(oxpana, 74, "Нужно расширять территорию!");
		        case 35:format(oxpana, 74, "Здесь скоро не хрена не будет!");
		        case 36:format(oxpana, 74, "Поговаривают, Шрам с Иванычем что-то не поделили. Ой, что-то будет...");
		        case 37:format(oxpana, 74, "Что принес?");
		        case 38:format(oxpana, 74, "О, привет, заходи! Сейчас поставлю чайник и мы выпьем по рюмочке.");
			}
			CallLocalFunction("OnPlayerText","ds",i,oxpana);
		}
	}
}

public OnPlayerText(playerid,text[])
{
//	if(IsPlayerNPC(playerid))
//	{
//		strins(text,"[Охранник]:",0,73);
//	}
/*
AddPlayerClass(2,248.6003,1857.2114,8.7578,180.6488,0,0,0,0,0,0); // radius_point

AddPlayerClass(2,248.8071,1838.2416,8.5472,359.3704,0,0,0,0,0,0); // radiusdal
AddPlayerClass(2,248.8083,1847.9465,8.7734,1.5794,0,0,0,0,0,0); // radius_dal_blije
AddPlayerClass(2,248.7424,1852.6857,8.7658,1.0990,0,0,0,0,0,0); // radius_ewe_blije
AddPlayerClass(2,248.7376,1854.9166,8.7742,1.0990,0,0,0,0,0,0); // radius_eweeweblije
AddPlayerClass(2,248.6522,1856.2289,8.7621,2.0599,0,0,0,0,0,0); // radius_onecolor

    */
    if(pInfo[playerid][pMutDo]<=gettime(_,_,_))
    {
	    SetPlayerChatBubble(playerid,text,0x00FF00AA,20.0,10000);


		new str_chat[120],
			Float:chat_dist;
		format(str_chat,120,"%s[%d]: %s",pInfo[playerid],playerid,text);
		
		foreach(Player, i)
		{
			if(i!=playerid)
			{
		        chat_dist=GetPlayerDistanceFromPoint(playerid,pInfo[i][pos_x],pInfo[i][pos_y],pInfo[i][pos_z]);

				if(chat_dist<=1.0)
				{
				    SendClientMessage(i,0xE6E6E6E6,str_chat);//-421075226    светлый - самый ближний
				}                                                   //          чем ниже тем темнее
				else if(chat_dist<=2.3100)
				{
				    SendClientMessage(i,0xC8C8C8C8,str_chat);//-926365496
				}
				else if(chat_dist<=4.6100)
				{
		            SendClientMessage(i,0xAAAAAAAA,str_chat);//-1431655766
				}
				else if(chat_dist<=9.3100)
				{
		            SendClientMessage(i,0x8C8C8C8C,str_chat);//-1936946036
				}
				else if(chat_dist<=19.2200)
				{
		            SendClientMessage(i,0x6E6E6E6E,str_chat);//1852730990    темный - самый дальний
				}
			}
		}
	}
	else//если у игрока есть мут
	{
		SetPlayerChatBubble(playerid,"Пытается что-то сказать...",0xFF0000AA,20.0,10000);
	    new str_ymute[41];
	    format(str_ymute,41,"У вас бан чата! До снятия %d секунд(ы)",pInfo[playerid][pMutDo]-gettime(_,_,_));
	    SendClientMessage(playerid,0xFF6347AA,str_ymute);
	}
}
public OnPlayerCommandText(playerid, cmdtext[])
{
    if(strfind(cmdtext,"/торг ")==0)
    {
		strdel(cmdtext,0,6);
		new open_torgid;//=strval(cmdtext);
		if(sscanf(cmdtext,"d",open_torgid))return SendClientMessage(playerid,-86,!"Введите /торг id игрока.");
//		if(open_torgid)
		
		if(IsPlayerConnected(open_torgid))
		{
		    if(pInfo[open_torgid][torg]==true)
		    {
				SetPlayerChatBubble(playerid,"смотрит товары",0x007900AA,30.0,10000);
				
		    }
		    else
		    {
		        SendClientMessage(playerid,-1263159297,!"Этот человек сейчас ничего не продает.");
		    }
		}
		else
		{
		}
		
		
		
      //  return 1;
    }
    else if(strfind(cmdtext,"/в ")==0)
    {
	    if(pInfo[playerid][Isvip]==true)
		{
		    strdel(cmdtext,0,3);
		    
			new str_vip[120];
			format(str_vip,120,"{FF4D00}VIP{FFFF00}: %s[%d]: %s",pInfo[playerid][Name],playerid,cmdtext);
		  //  FF4D00
			foreach(Player, i)
			{
			 	if(pInfo[i][Isvip]==true&&pInfo[i][vip_chat]==true)
			 	{
			 	    SendClientMessage(i,-1,str_vip);
			 	}
			}
		}
		else
		{
		    SendClientMessage(playerid,0xFF000000,!"Пополните счет, чтобы писать в VIP чат (подробности на сайте samp-sektor-2.ru)");
		}
	}
	else if(strfind(cmdtext,"/к ")==0)
    {
    //проверку на мут
    
            strdel(cmdtext,0,3);
            if(strlen(cmdtext)!=0)
            {
                new str_kriknul[120];

                format(str_kriknul,120,"- %s[%d] кричит: %s",pInfo[playerid][Name],playerid,cmdtext);
                

            }
			else
			{
			    SendClientMessage(playerid,0xDDA0DD00,!">> Введите{FFFFFF}: /к [текст]");
			}
	}
	else if(strfind(cmdtext,"/mute ")==0)
	{
	    //проверку на админа
	        strdel(cmdtext,0,6);
	        new myte_id,seconds;
	        if(sscanf(cmdtext,"dd",myte_id,seconds))return SendClientMessage(playerid,0xFF000000,!"/mute [id][second]");
	        
	        SetPlayerChatBubble(playerid,"Заткнут(а)",0x007900aa,30.0,10000);
	        
	        new timech=gettime(_,_,_);
	        pInfo[myte_id][pMutDo]=timech+seconds;
	        
	        new str_mutes[102];
	        format(str_mutes,102,"Вы выдали бан чата игроку {00FF00}%s {FF0000}на {00FF00}%d {FF0000}секунд",pInfo[myte_id][Name],seconds);
	        SendClientMessage(playerid,0xFF000000,str_mutes);
	        
	        format(str_mutes,102,"%s получает бан чата от %s",pInfo[myte_id][Name],pInfo[playerid][Name]);
	        SendClientMessageToAll(0xFF6347AA,str_mutes);
	        SendClientMessage(myte_id,0xFF6347AA,!"Вам выдали бан чата.");
	}
    return 1;

}
/*
//cmd:ban(playerid,params[])
{
	for(new i;i<4;i++)
	{
	    if(AdminId[i]==playerid)
	    {
	    
	        sscanf(params,"ds[25]",params[0],params[1]);
	        if(pInfo[params[0]][spawned]==true)
	        {
	            new str[125];
	            format(str,125,"Администратор %s забанил %s. Причина: %s",pInfo[AdminId[i]][Name],pInfo[params[0]][Name],params[1]);
	        	SendClientMessageToAll(0xf95100ff,str);

	            SendClientMessage(playerid,0xdf0000ff,!"СДЕЛАЙТЕ СКРИНШОТ (F8)! Ваш аккаунт заблокирован. Наш сайт: www.samp-sektor-2.ru");
	            SendClientMessage(playerid,-1,!"Введите /q, чтобы выйти.");
	            
	            KickP(playerid);
	        }
	        else
	        {
	            SendClientMessage(playerid,0xdf0000ff,!"Игрок не авторизировался!");
	        }
	        break;
	    }
	}
}*/
stock AC_KICK(playerid)
{
    SendClientMessage(playerid,0xf95100ff,!"Вас отключил античит!{df0000} Возможно вы залагали или используете читы/моды.");
    SendClientMessage(playerid,0xff6347ff,!"ОБЯЗАТЕЛЬНО СДЕЛАЙТЕ СКРИНШОТ (клавиша F8)!");
}
KickP(playerid)
{
	new value = 500*500;
	so_KICK:{
    value -- ;
    if value != 0*then goto so_KICK;
	}
	#emit PUSH.S playerid
	#emit PUSH.C 4
	#emit SYSREQ.C Kick
	#emit STACK 8
	#emit RETN
	return;
}


/* 4:24
   1:45
   3:12
   3:14
	0:4
*/
forward podskazki();
public podskazki()
{
	static str_pods[155];
	
	switch(random(90))
	{

		case 0:format(str_pods,155,"Если ваши индикаторы голода и жажды не изменили цвет, то здоровье будет восстанавливаться!");
		case 1:format(str_pods,155,"Респиратор - хорошая защита от вирусов! Его можно купить у Иваныча или найти на поверхности!");
		case 2:format(str_pods,155,"Ваш КПК сканирует окружающий мир на вирусы. Если его показатель больше 0, то вы теряете иммунитет!");
		case 3:format(str_pods,155,"Респиратор имеет фильтр -5, это значит он спасает от вирусов до такой сложности.");
		case 4:format(str_pods,155,"Мотоциклетный шлем можно купить и одеть только на байке. Он защитит вас от вирусов!");
		case 5:format(str_pods,155,"Настроение можно поднять алкоголем, игрой на гитаре и сексом!");
		case 6:format(str_pods,155,"В заброшенном храме можно помолиться и повысить настроение!");
		case 7:format(str_pods,155,"Если вы промокнете, то можете простудиться и заболеть!");
		case 8:format(str_pods,155,"Если есть сомнительную пищу - бургеры, шаурму, молоко и т.п. то можно отравиться.");
		case 9:format(str_pods,155,"Если вы отравились или простыли, то можно излечиться снадобьем! Его можно купить в госпитале.");
		case 10:format(str_pods,155,"Если купить байк у Механика, то его не смогут угнать.");
		case 11:format(str_pods,155,"Во время бури уровень вирусов зашкаливает и полностью защищает только набор \"топ-шлем-респиратор\".");
		case 12:format(str_pods,155,"Еще одно убежище можно найти в ЛС, в Метро!");
		case 13:format(str_pods,155,"Самый дорогой лут можно отыскать в зданиях!");
		case 14:format(str_pods,155,"Если ваш иммунитет ослаб - используйте аптечку. В ней есть антибиотики.");
		case 15:format(str_pods,155,"Виски может немного согреть вас, а водка поправить иммунитет.");
		case 16:format(str_pods,155,"Если вокруг вас вирусов больше +5, то респиратор начнет их пропускать и вы будете терять иммунитет.");
		case 17:format(str_pods,155,"Респиратор не дает полной защиты от вирусов, во время бури он может их пропустить!");
		case 18:format(str_pods,155,"Во время бури не выходите на поверхность! Уровень вирусов зашкаливает!");
		case 19:format(str_pods,155,"Вирусы расстелаются по поверхности земли и поднимаются с порывом ветра. От ветра и меняется значение сканера.");
		case 20:format(str_pods,155,"Теплая одежда стоит дорого, но зато теплее и лучше защищает от вирусов!");
		case 21:format(str_pods,155,"Иваныч покупает вещи за треть стоимости, поэтому выгодней открывать свою лавку!");
		case 22:format(str_pods,155,"Открыть свою торговую лавку можно через личное меню (клавиша N)!");
		case 23:format(str_pods,155,"Если вы открыли лавку, то игроки смогут купить все вещи из вашего рюкзака!");
		case 24:format(str_pods,155,"Можно купить большой рюкзак, чтобы переносить больше хабара!");
		case 25:format(str_pods,155,"В теплой одежде вы будете меньше мерзнуть ночью.");
		case 26:format(str_pods,155,"Купите теплую одежду, чтобы не замерзать ночью!");
		case 27:format(str_pods,155,"Продавать вещи игрокам выгодней, чем отдавать их Иванычу!");
		case 28:format(str_pods,155,"Торговать в своей лавке можно даже в АФК!");
		case 29:format(str_pods,155,"Если прыгнуть с высоты, то можно вывихнуть ногу!");
		case 30:format(str_pods,155,"Не прыгайте с высоты - можете вывихнуть ногу!");
		case 31:format(str_pods,155,"Если у вас нет бронежилета, то вы получите кровотечение от пулевых ранений!");
		case 32:format(str_pods,155,"Если у вас кровотечение или вывих, то здоровье не будет генерироваться.");
		case 33:format(str_pods,155,"От урона катаной можно получить кровотечение!");
		case 34:format(str_pods,155,"Во время бури счетчик вирусов зашкаливает. Лучше искать укрытие.");
		case 35:format(str_pods,155,"Вывихи и кровотечения можно вылечить бинтами или аптечками!");
		case 36:format(str_pods,155,"Если промокнуть, то можно легко простудиться.");
		case 37:format(str_pods,155,"Если спать на улице, то лучше развести костер, иначе замерзнете!");
		case 38:format(str_pods,155,"На поверхности есть много мест с лутом, не занесенных в навигатор!");
		case 39:format(str_pods,155,"В своей комнате можно безопасно справлять нужду или спать.");
		case 40:format(str_pods,155,"Старайтесь спать чаще, чтобы не пришлось спать долго!");
		case 41:format(str_pods,155,"Старайтесь не есть сомнительную пищу - бургеры, шаурму, молоко и т.п.. Она может быть испорчена!");
		case 42:format(str_pods,155,"От прямой атаки зомби можно получить кровотечение.");
		case 43:format(str_pods,155,"В игре есть вид от первого лица (клавиша N - настройки).");
		case 44:format(str_pods,155,"Тайники с лутом обновляются 1 раз в сутки!");
		case 45:format(str_pods,155,"В комнату можно купить личный сейф, который никто не откроет!");
		case 46:format(str_pods,155,"Рация ловит на несколько километров и не работает в дождь!");
		case 47:format(str_pods,155,"На гитаре можно играть различные мелодии и петь песни!");
		case 48:format(str_pods,155,"В навигаторе много меток на здания с лутом!");
		case 49:format(str_pods,155,"На поверхности есть много мест с лутом, не занесенных в навигатор!");
		case 50:format(str_pods,155,"Можно купить карту, чтобы легче ориентироваться на поверхности.");
		case 51:format(str_pods,155,"Рация имеет две частоты: /р и /б.");
		case 52:format(str_pods,155,"Цвет бригады выбирает лидер, когда создает бригаду!");
		case 53:format(str_pods,155,"В бункере можно стоять АФК сколько угодно, а в зданиях или на улице вас может кикнуть.");
		case 54:format(str_pods,155,"Когда вы торгуете в бункере - параметры не расходуются!");
		case 55:format(str_pods,155,"Деньги можно положить в Хранилище бункера, тогда вы их не потеряете!");
		case 56:format(str_pods,155,"Иваныч - самый главный в бункере Сектор-2, он занимается скупкой и продажей различных вещей!");
		case 57:format(str_pods,155,"Пустую канистру можно наполнить бензином на любой АЗС!");
		case 58:format(str_pods,155,"Чем больше полезного вы делаете для бункера, тем выше ваш Авторитет!");
		case 59:format(str_pods,155,"Если вы замерзаете вдали от бункера, то можно развести костер и согреться.");
		case 60:format(str_pods,155,"Если вы замерзаете вдали от бункера - разведите костер.");
		case 61:format(str_pods,155,"В заведенной машине вам не страшен холод!");
		case 62:format(str_pods,155,"Крепкий алкоголь не только немного утоляет жажду, но и согреет вас!");
		case 63:format(str_pods,155,"Если пить много алкоголя, то вас может \"вырубить\".");
		case 64:format(str_pods,155,"Тайники с провизией, как правило, появляются у разбитых машин, ящиков и д.р. мусора.");
		case 65:format(str_pods,155,"Спрятать свои вещи можно в термоящик!");
		case 66:format(str_pods,155,"Термоящик можно купить и установить на поверхности где угодно!");
		case 67:format(str_pods,155,"Дрова для костра чаще всего можно найти в местах скопления деревьев.");
		case 68:format(str_pods,155,"Больше всего провизии появляется в складских помещениях.");
		case 69:format(str_pods,155,"За каждое убийство вы теряете настроение и можете впасть в депрессию.");
		case 70:format(str_pods,155,"Если вы впали в депрессию, то не сможете держать в руках оружие.");
		case 71:format(str_pods,155,"Золото является ценным ресурсом. Его можно купить или найти на поверхности - в старой шахте и в заброшенном храме.");
		case 72:format(str_pods,155,"Патроны и оружие можно найти в заброшенных магазинах оружия и полицейских участках.");
		case 73:format(str_pods,155,"Бензин машины расходуется всегда, когда двигатель заведен, а аккумулятор наоборот, расходуется в простое.");
		case 74:format(str_pods,155,"В машине можно закрыться.");
		case 75:format(str_pods,155,"В безопасной зоне нельзя запрыгнуть на машину.");
		case 76:format(str_pods,155,"В любой момент у вашей машины может пробить колесо, из-за раскиданного мусора.");
		case 77:format(str_pods,155,"Есть несколько видов запчастей - для ремонта автомобилей, мотоциклов и колес.");
		case 78:format(str_pods,155,"Инструменты и канистры можно использовать бесконечно.");
		case 79:format(str_pods,155,"Хорошо заработать можно на заданиях. Например, на задании \"Курьер\".");
		case 80:format(str_pods,155,"Не спешите продавать провизию Иванычу, попробуйте выполнять его задания!");
		case 81:format(str_pods,155,"Недалеко от бункера есть парковка \"допа\" - транспорта с системой анти-угона.Купить такой транспорт можно через администрацию.");
		case 82:format(str_pods,155,"VIP защита сохранит все ваши вещи при гибели.");
		case 83:format(str_pods,155,"В любом огнестрельном оружии ограниченное количество патронов.");
		case 84:format(str_pods,155,"В мире есть сеть подземных канализаций, со своими секретами.");
		case 85:format(str_pods,155,"В мире есть транспорт, попробуйте найти его!");
		case 86:format(str_pods,155,"Разбогатеть вам поможет торговля - откройте свою лавку (клавиша N)!");
		case 87:format(str_pods,155,"Устанавливая палатку, не забудьте рядом развести костер!");
		case 88:format(str_pods,155,"Избегайте контакта с зараженными. Как минимум, можете получить кровотечение.");
		case 89:format(str_pods,155,"Чем быстрей вы крутите педали на велике, тем быстрей расходуется жажда и усталость!");
	}
	strins(str_pods,"{C40000}ПОДСКАЗКА: {ACAC59}",0);
	SendClientMessageToAll(0x00ffffff,str_pods);
}
//{C40000}?????????: {ACAC59}??? ?????? ????????? ?? ??????? ??? ???????, ??? ???? ??? ?????????!



forward MainVehicle();
public MainVehicle()
{

//	vInfo[vid][Engine]
//	vInfo[vid][akum];
//	vInfo[vid][benz];
	
	for(new vid;vid<MAX_CARS;++vid)
	{
	    if(vInfo[vid][Engine]==false)//если двигатель заглушен
	    {
	        if(vInfo[vid][akum]>0)
	        {
	            --vInfo[vid][akum];
	        }
	    }
	    else//движок заведен
	    {
	        if(vInfo[vid][benz]>0)
	        {
	            --vInfo[vid][benz];
	            if(vInfo[vid][benz]==0)
	            {
	                if(vInfo[vid][driveid]!=0)
	                {
	                    SendClientMessage(vInfo[vid][driveid],0xFF0000AA,!"Бензобак пуст!");
	                }
	                
		            new engine, lights, alarm, dors, bonnet, boot, objective;
					GetVehicleParamsEx(vid, engine, lights, alarm, dors, bonnet, boot, objective);
					SetVehicleParamsEx(vid, 0, 0, 0, dors, bonnet, boot, objective);
	                SetVehicleVelocity(vid,0.0,0.0,0.0);
	            }
	        }
	    }
	    if(vInfo[vid][driveid]!=0)//&&(vInfo[vid][benz]!=0||vInfo[vid][akum]!=0))
	    {
	    	new str_vehicle[8];
	    	
	    	new benzina=vInfo[vid][benz];
	    	
	    	if(benzina<=16)
	    	{
	    	    format(str_vehicle,6,"~r~F");
	    	}
	    	else if(benzina<=32)
	    	{
	    	    format(str_vehicle,6,"~y~F");
	    	}
	    	else if(benzina<=50)
	    	{
	    	    format(str_vehicle,6,"~g~F");
	    	}
	    	
	    	new playerid=vInfo[vid][driveid];
	    	
	    	PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][23],str_vehicle);

			new akummulator=vInfo[vid][akum];
			
			if(akummulator<=33)
	    	{
	    	    format(str_vehicle,8,"~r~+/-");
	    	}
	    	else if(akummulator<=66)
	    	{
	    	    format(str_vehicle,8,"~y~+/-");
	    	}
	    	else if(akummulator<=100)
	    	{
	    	    format(str_vehicle,8,"~g~+/-");
	    	}
            PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][24],str_vehicle);
		}
	}
}
new str_speed[10],Float:uvx,Float:uvy,Float:uvz;
forward UpSpeed();
public UpSpeed()
{
	foreach(PlyrInVeh,playerid)
	{
		GetVehicleVelocity(pInfo[playerid][car_id],uvx, uvy, uvz);
	    format(str_speed,10,"%d km/h",floatround(floatsqroot(floatpower(floatabs(uvx), 2.0) + floatpower(floatabs(uvy), 2.0) + floatpower(floatabs(uvz), 2.0)) * 105.0));
		PlayerTextDrawSetString(playerid,PLAYER_DRAWS[playerid][22],str_speed);
	}
}







